/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const NET_EDHCP: i32 = -36;
pub const NET_EWRONGKEY: i32 = -37;
pub const NET_EAUTH: i32 = -38;
pub const NET_EFLIGHTMODE: i32 = -39;
pub const VN_NOPATH: u32 = 1;
pub const VN_NOESCAPE: u32 = 2;
pub const VN_ABSOLUTE: u32 = 4;
pub const VN_RELATIVE: u32 = 8;
pub const A2DP_DISCONNECTED: u32 = 0;
pub const A2DP_CONNECTED_TO_SNK: u32 = 1;
pub const CF_CONFIG_RESUME: u32 = 1;
pub const FONT_ACTIVATE_CODE: u32 = 2410017735;
pub const IV_NULL_HANDLER_DESCRIPTOR: u32 = 0;
pub const MT_QUEUE_LEN: u32 = 10;
pub const MT_SECTION_LEN: u32 = 2;
pub const MT_CONTAINER_QUEUE_LEN: u32 = 10;
pub const MAX_BT_SERVICE_USER: u32 = 16;
pub const GSENSOR_OFF: u32 = 0;
pub const GSENSOR_ON: u32 = 1;
pub const GSENSOR_INTR: u32 = 2;
pub const LOOKUP_WORD_FOUND_EXACT: u32 = 2;
pub const LOOKUP_WORD_FOUND_SIMILAR: u32 = 1;
pub const LOOKUP_WORD_NOT_FOUND: u32 = 0;
pub const IV_OSY_STATUS_TURNED_OFF: u32 = 0;
pub const IV_OSY_STATUS_WRONG_LOGIN_PASSWORD: u32 = 1;
pub const IV_OSY_STATUS_DOWNLOADING: u32 = 2;
pub const IV_OSY_STATUS_PAUSED: u32 = 3;
pub const IV_OSY_STATUS_IDLE: u32 = 4;
pub const IV_OSY_STATUS_ERROR: u32 = 5;
pub const HIGH_PRIORITY_JOB_OPEN_STORE: u32 = 0;
pub const HIGH_PRIORITY_JOB_OPEN_BOOK: u32 = 1;
pub const BTGATT_CLIENT_PATH: &[u8; 23] = b"/usr/bin/btgatt-client\0";
pub const BTGATT_SERVICE_PATH: &[u8; 36] = b"/usr/libexec/bluetooth/gatt-service\0";
pub const BTGATT_SERVICE_RX_NODE: &[u8; 68] =
    b"/var/run/bt_gatt_services/0000ffff-0000-1000-8000-00805f9b34fb/0001\0";
pub const BTGATT_SERVICE_TX_NODE: &[u8; 68] =
    b"/var/run/bt_gatt_services/0000ffff-0000-1000-8000-00805f9b34fb/0002\0";
pub const BTGATT_SERVICE_STATUS_NODE: &[u8; 33] = b"/var/run/bt_gatt_services/status\0";
pub const CONFIGSTORAGESIZE: u32 = 4096;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __quad_t = ::std::os::raw::c_longlong;
pub type __u_quad_t = ::std::os::raw::c_ulonglong;
pub type __dev_t = __u_quad_t;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = __u_quad_t;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = __quad_t;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = __u_quad_t;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = __quad_t;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = __u_quad_t;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = __u_quad_t;
pub type __fsword_t = ::std::os::raw::c_int;
pub type __ssize_t = ::std::os::raw::c_int;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_int;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type FILE = _IO_FILE;
pub type __FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 12usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 4usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __gnuc_va_list = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_marker"][::std::mem::size_of::<_IO_marker>() - 12usize];
    ["Alignment of _IO_marker"][::std::mem::align_of::<_IO_marker>() - 4usize];
    ["Offset of field: _IO_marker::_next"][::std::mem::offset_of!(_IO_marker, _next) - 0usize];
    ["Offset of field: _IO_marker::_sbuf"][::std::mem::offset_of!(_IO_marker, _sbuf) - 4usize];
    ["Offset of field: _IO_marker::_pos"][::std::mem::offset_of!(_IO_marker, _pos) - 8usize];
};
pub const __codecvt_result___codecvt_ok: __codecvt_result = 0;
pub const __codecvt_result___codecvt_partial: __codecvt_result = 1;
pub const __codecvt_result___codecvt_error: __codecvt_result = 2;
pub const __codecvt_result___codecvt_noconv: __codecvt_result = 3;
pub type __codecvt_result = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 152usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 4usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 12usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 16usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 20usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 24usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 28usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 32usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 36usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 40usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 44usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 48usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 52usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 56usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 60usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 64usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 68usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 70usize];
    ["Offset of field: _IO_FILE::_shortbuf"][::std::mem::offset_of!(_IO_FILE, _shortbuf) - 71usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 72usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 80usize];
    ["Offset of field: _IO_FILE::__pad1"][::std::mem::offset_of!(_IO_FILE, __pad1) - 88usize];
    ["Offset of field: _IO_FILE::__pad2"][::std::mem::offset_of!(_IO_FILE, __pad2) - 92usize];
    ["Offset of field: _IO_FILE::__pad3"][::std::mem::offset_of!(_IO_FILE, __pad3) - 96usize];
    ["Offset of field: _IO_FILE::__pad4"][::std::mem::offset_of!(_IO_FILE, __pad4) - 100usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 104usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 108usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 112usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
pub type __io_read_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type __io_write_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> __ssize_t,
>;
pub type __io_seek_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type __io_close_fn = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type va_list = __gnuc_va_list;
pub type off_t = __off_t;
pub type fpos_t = _G_fpos_t;
pub type wchar_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union wait {
    pub w_status: ::std::os::raw::c_int,
    pub __wait_terminated: wait__bindgen_ty_1,
    pub __wait_stopped: wait__bindgen_ty_2,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait__bindgen_ty_1"][::std::mem::size_of::<wait__bindgen_ty_1>() - 4usize];
    ["Alignment of wait__bindgen_ty_1"][::std::mem::align_of::<wait__bindgen_ty_1>() - 4usize];
};
impl wait__bindgen_ty_1 {
    #[inline]
    pub fn __w_termsig(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set___w_termsig(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __w_termsig_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                7u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___w_termsig_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __w_coredump(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set___w_coredump(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __w_coredump_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___w_coredump_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __w_retcode(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___w_retcode(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __w_retcode_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___w_retcode_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        __w_termsig: ::std::os::raw::c_uint,
        __w_coredump: ::std::os::raw::c_uint,
        __w_retcode: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 7u8, {
            let __w_termsig: u32 = unsafe { ::std::mem::transmute(__w_termsig) };
            __w_termsig as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let __w_coredump: u32 = unsafe { ::std::mem::transmute(__w_coredump) };
            __w_coredump as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let __w_retcode: u32 = unsafe { ::std::mem::transmute(__w_retcode) };
            __w_retcode as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait__bindgen_ty_2"][::std::mem::size_of::<wait__bindgen_ty_2>() - 4usize];
    ["Alignment of wait__bindgen_ty_2"][::std::mem::align_of::<wait__bindgen_ty_2>() - 4usize];
};
impl wait__bindgen_ty_2 {
    #[inline]
    pub fn __w_stopval(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___w_stopval(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __w_stopval_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___w_stopval_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __w_stopsig(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set___w_stopsig(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __w_stopsig_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___w_stopsig_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        __w_stopval: ::std::os::raw::c_uint,
        __w_stopsig: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let __w_stopval: u32 = unsafe { ::std::mem::transmute(__w_stopval) };
            __w_stopval as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let __w_stopsig: u32 = unsafe { ::std::mem::transmute(__w_stopsig) };
            __w_stopsig as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait"][::std::mem::size_of::<wait>() - 4usize];
    ["Alignment of wait"][::std::mem::align_of::<wait>() - 4usize];
    ["Offset of field: wait::w_status"][::std::mem::offset_of!(wait, w_status) - 0usize];
    ["Offset of field: wait::__wait_terminated"]
        [::std::mem::offset_of!(wait, __wait_terminated) - 0usize];
    ["Offset of field: wait::__wait_stopped"]
        [::std::mem::offset_of!(wait, __wait_stopped) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union __WAIT_STATUS {
    pub __uptr: *mut wait,
    pub __iptr: *mut ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __WAIT_STATUS"][::std::mem::size_of::<__WAIT_STATUS>() - 4usize];
    ["Alignment of __WAIT_STATUS"][::std::mem::align_of::<__WAIT_STATUS>() - 4usize];
    ["Offset of field: __WAIT_STATUS::__uptr"]
        [::std::mem::offset_of!(__WAIT_STATUS, __uptr) - 0usize];
    ["Offset of field: __WAIT_STATUS::__iptr"]
        [::std::mem::offset_of!(__WAIT_STATUS, __iptr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 8usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 4usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type time_t = __time_t;
pub type clockid_t = __clockid_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = ::std::os::raw::c_int;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 4usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 8usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 4usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 8usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 4usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 4usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 4usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 28usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 4usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 4usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 8usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 12usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 16usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 20usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 116usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 4usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 52usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 56usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 60usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 64usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
pub const _ISupper: _bindgen_ty_1 = 256;
pub const _ISlower: _bindgen_ty_1 = 512;
pub const _ISalpha: _bindgen_ty_1 = 1024;
pub const _ISdigit: _bindgen_ty_1 = 2048;
pub const _ISxdigit: _bindgen_ty_1 = 4096;
pub const _ISspace: _bindgen_ty_1 = 8192;
pub const _ISprint: _bindgen_ty_1 = 16384;
pub const _ISgraph: _bindgen_ty_1 = 32768;
pub const _ISblank: _bindgen_ty_1 = 1;
pub const _IScntrl: _bindgen_ty_1 = 2;
pub const _ISpunct: _bindgen_ty_1 = 4;
pub const _ISalnum: _bindgen_ty_1 = 8;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub type useconds_t = __useconds_t;
pub type socklen_t = __socklen_t;
pub const _PC_LINK_MAX: _bindgen_ty_2 = 0;
pub const _PC_MAX_CANON: _bindgen_ty_2 = 1;
pub const _PC_MAX_INPUT: _bindgen_ty_2 = 2;
pub const _PC_NAME_MAX: _bindgen_ty_2 = 3;
pub const _PC_PATH_MAX: _bindgen_ty_2 = 4;
pub const _PC_PIPE_BUF: _bindgen_ty_2 = 5;
pub const _PC_CHOWN_RESTRICTED: _bindgen_ty_2 = 6;
pub const _PC_NO_TRUNC: _bindgen_ty_2 = 7;
pub const _PC_VDISABLE: _bindgen_ty_2 = 8;
pub const _PC_SYNC_IO: _bindgen_ty_2 = 9;
pub const _PC_ASYNC_IO: _bindgen_ty_2 = 10;
pub const _PC_PRIO_IO: _bindgen_ty_2 = 11;
pub const _PC_SOCK_MAXBUF: _bindgen_ty_2 = 12;
pub const _PC_FILESIZEBITS: _bindgen_ty_2 = 13;
pub const _PC_REC_INCR_XFER_SIZE: _bindgen_ty_2 = 14;
pub const _PC_REC_MAX_XFER_SIZE: _bindgen_ty_2 = 15;
pub const _PC_REC_MIN_XFER_SIZE: _bindgen_ty_2 = 16;
pub const _PC_REC_XFER_ALIGN: _bindgen_ty_2 = 17;
pub const _PC_ALLOC_SIZE_MIN: _bindgen_ty_2 = 18;
pub const _PC_SYMLINK_MAX: _bindgen_ty_2 = 19;
pub const _PC_2_SYMLINKS: _bindgen_ty_2 = 20;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const _SC_ARG_MAX: _bindgen_ty_3 = 0;
pub const _SC_CHILD_MAX: _bindgen_ty_3 = 1;
pub const _SC_CLK_TCK: _bindgen_ty_3 = 2;
pub const _SC_NGROUPS_MAX: _bindgen_ty_3 = 3;
pub const _SC_OPEN_MAX: _bindgen_ty_3 = 4;
pub const _SC_STREAM_MAX: _bindgen_ty_3 = 5;
pub const _SC_TZNAME_MAX: _bindgen_ty_3 = 6;
pub const _SC_JOB_CONTROL: _bindgen_ty_3 = 7;
pub const _SC_SAVED_IDS: _bindgen_ty_3 = 8;
pub const _SC_REALTIME_SIGNALS: _bindgen_ty_3 = 9;
pub const _SC_PRIORITY_SCHEDULING: _bindgen_ty_3 = 10;
pub const _SC_TIMERS: _bindgen_ty_3 = 11;
pub const _SC_ASYNCHRONOUS_IO: _bindgen_ty_3 = 12;
pub const _SC_PRIORITIZED_IO: _bindgen_ty_3 = 13;
pub const _SC_SYNCHRONIZED_IO: _bindgen_ty_3 = 14;
pub const _SC_FSYNC: _bindgen_ty_3 = 15;
pub const _SC_MAPPED_FILES: _bindgen_ty_3 = 16;
pub const _SC_MEMLOCK: _bindgen_ty_3 = 17;
pub const _SC_MEMLOCK_RANGE: _bindgen_ty_3 = 18;
pub const _SC_MEMORY_PROTECTION: _bindgen_ty_3 = 19;
pub const _SC_MESSAGE_PASSING: _bindgen_ty_3 = 20;
pub const _SC_SEMAPHORES: _bindgen_ty_3 = 21;
pub const _SC_SHARED_MEMORY_OBJECTS: _bindgen_ty_3 = 22;
pub const _SC_AIO_LISTIO_MAX: _bindgen_ty_3 = 23;
pub const _SC_AIO_MAX: _bindgen_ty_3 = 24;
pub const _SC_AIO_PRIO_DELTA_MAX: _bindgen_ty_3 = 25;
pub const _SC_DELAYTIMER_MAX: _bindgen_ty_3 = 26;
pub const _SC_MQ_OPEN_MAX: _bindgen_ty_3 = 27;
pub const _SC_MQ_PRIO_MAX: _bindgen_ty_3 = 28;
pub const _SC_VERSION: _bindgen_ty_3 = 29;
pub const _SC_PAGESIZE: _bindgen_ty_3 = 30;
pub const _SC_RTSIG_MAX: _bindgen_ty_3 = 31;
pub const _SC_SEM_NSEMS_MAX: _bindgen_ty_3 = 32;
pub const _SC_SEM_VALUE_MAX: _bindgen_ty_3 = 33;
pub const _SC_SIGQUEUE_MAX: _bindgen_ty_3 = 34;
pub const _SC_TIMER_MAX: _bindgen_ty_3 = 35;
pub const _SC_BC_BASE_MAX: _bindgen_ty_3 = 36;
pub const _SC_BC_DIM_MAX: _bindgen_ty_3 = 37;
pub const _SC_BC_SCALE_MAX: _bindgen_ty_3 = 38;
pub const _SC_BC_STRING_MAX: _bindgen_ty_3 = 39;
pub const _SC_COLL_WEIGHTS_MAX: _bindgen_ty_3 = 40;
pub const _SC_EQUIV_CLASS_MAX: _bindgen_ty_3 = 41;
pub const _SC_EXPR_NEST_MAX: _bindgen_ty_3 = 42;
pub const _SC_LINE_MAX: _bindgen_ty_3 = 43;
pub const _SC_RE_DUP_MAX: _bindgen_ty_3 = 44;
pub const _SC_CHARCLASS_NAME_MAX: _bindgen_ty_3 = 45;
pub const _SC_2_VERSION: _bindgen_ty_3 = 46;
pub const _SC_2_C_BIND: _bindgen_ty_3 = 47;
pub const _SC_2_C_DEV: _bindgen_ty_3 = 48;
pub const _SC_2_FORT_DEV: _bindgen_ty_3 = 49;
pub const _SC_2_FORT_RUN: _bindgen_ty_3 = 50;
pub const _SC_2_SW_DEV: _bindgen_ty_3 = 51;
pub const _SC_2_LOCALEDEF: _bindgen_ty_3 = 52;
pub const _SC_PII: _bindgen_ty_3 = 53;
pub const _SC_PII_XTI: _bindgen_ty_3 = 54;
pub const _SC_PII_SOCKET: _bindgen_ty_3 = 55;
pub const _SC_PII_INTERNET: _bindgen_ty_3 = 56;
pub const _SC_PII_OSI: _bindgen_ty_3 = 57;
pub const _SC_POLL: _bindgen_ty_3 = 58;
pub const _SC_SELECT: _bindgen_ty_3 = 59;
pub const _SC_UIO_MAXIOV: _bindgen_ty_3 = 60;
pub const _SC_IOV_MAX: _bindgen_ty_3 = 60;
pub const _SC_PII_INTERNET_STREAM: _bindgen_ty_3 = 61;
pub const _SC_PII_INTERNET_DGRAM: _bindgen_ty_3 = 62;
pub const _SC_PII_OSI_COTS: _bindgen_ty_3 = 63;
pub const _SC_PII_OSI_CLTS: _bindgen_ty_3 = 64;
pub const _SC_PII_OSI_M: _bindgen_ty_3 = 65;
pub const _SC_T_IOV_MAX: _bindgen_ty_3 = 66;
pub const _SC_THREADS: _bindgen_ty_3 = 67;
pub const _SC_THREAD_SAFE_FUNCTIONS: _bindgen_ty_3 = 68;
pub const _SC_GETGR_R_SIZE_MAX: _bindgen_ty_3 = 69;
pub const _SC_GETPW_R_SIZE_MAX: _bindgen_ty_3 = 70;
pub const _SC_LOGIN_NAME_MAX: _bindgen_ty_3 = 71;
pub const _SC_TTY_NAME_MAX: _bindgen_ty_3 = 72;
pub const _SC_THREAD_DESTRUCTOR_ITERATIONS: _bindgen_ty_3 = 73;
pub const _SC_THREAD_KEYS_MAX: _bindgen_ty_3 = 74;
pub const _SC_THREAD_STACK_MIN: _bindgen_ty_3 = 75;
pub const _SC_THREAD_THREADS_MAX: _bindgen_ty_3 = 76;
pub const _SC_THREAD_ATTR_STACKADDR: _bindgen_ty_3 = 77;
pub const _SC_THREAD_ATTR_STACKSIZE: _bindgen_ty_3 = 78;
pub const _SC_THREAD_PRIORITY_SCHEDULING: _bindgen_ty_3 = 79;
pub const _SC_THREAD_PRIO_INHERIT: _bindgen_ty_3 = 80;
pub const _SC_THREAD_PRIO_PROTECT: _bindgen_ty_3 = 81;
pub const _SC_THREAD_PROCESS_SHARED: _bindgen_ty_3 = 82;
pub const _SC_NPROCESSORS_CONF: _bindgen_ty_3 = 83;
pub const _SC_NPROCESSORS_ONLN: _bindgen_ty_3 = 84;
pub const _SC_PHYS_PAGES: _bindgen_ty_3 = 85;
pub const _SC_AVPHYS_PAGES: _bindgen_ty_3 = 86;
pub const _SC_ATEXIT_MAX: _bindgen_ty_3 = 87;
pub const _SC_PASS_MAX: _bindgen_ty_3 = 88;
pub const _SC_XOPEN_VERSION: _bindgen_ty_3 = 89;
pub const _SC_XOPEN_XCU_VERSION: _bindgen_ty_3 = 90;
pub const _SC_XOPEN_UNIX: _bindgen_ty_3 = 91;
pub const _SC_XOPEN_CRYPT: _bindgen_ty_3 = 92;
pub const _SC_XOPEN_ENH_I18N: _bindgen_ty_3 = 93;
pub const _SC_XOPEN_SHM: _bindgen_ty_3 = 94;
pub const _SC_2_CHAR_TERM: _bindgen_ty_3 = 95;
pub const _SC_2_C_VERSION: _bindgen_ty_3 = 96;
pub const _SC_2_UPE: _bindgen_ty_3 = 97;
pub const _SC_XOPEN_XPG2: _bindgen_ty_3 = 98;
pub const _SC_XOPEN_XPG3: _bindgen_ty_3 = 99;
pub const _SC_XOPEN_XPG4: _bindgen_ty_3 = 100;
pub const _SC_CHAR_BIT: _bindgen_ty_3 = 101;
pub const _SC_CHAR_MAX: _bindgen_ty_3 = 102;
pub const _SC_CHAR_MIN: _bindgen_ty_3 = 103;
pub const _SC_INT_MAX: _bindgen_ty_3 = 104;
pub const _SC_INT_MIN: _bindgen_ty_3 = 105;
pub const _SC_LONG_BIT: _bindgen_ty_3 = 106;
pub const _SC_WORD_BIT: _bindgen_ty_3 = 107;
pub const _SC_MB_LEN_MAX: _bindgen_ty_3 = 108;
pub const _SC_NZERO: _bindgen_ty_3 = 109;
pub const _SC_SSIZE_MAX: _bindgen_ty_3 = 110;
pub const _SC_SCHAR_MAX: _bindgen_ty_3 = 111;
pub const _SC_SCHAR_MIN: _bindgen_ty_3 = 112;
pub const _SC_SHRT_MAX: _bindgen_ty_3 = 113;
pub const _SC_SHRT_MIN: _bindgen_ty_3 = 114;
pub const _SC_UCHAR_MAX: _bindgen_ty_3 = 115;
pub const _SC_UINT_MAX: _bindgen_ty_3 = 116;
pub const _SC_ULONG_MAX: _bindgen_ty_3 = 117;
pub const _SC_USHRT_MAX: _bindgen_ty_3 = 118;
pub const _SC_NL_ARGMAX: _bindgen_ty_3 = 119;
pub const _SC_NL_LANGMAX: _bindgen_ty_3 = 120;
pub const _SC_NL_MSGMAX: _bindgen_ty_3 = 121;
pub const _SC_NL_NMAX: _bindgen_ty_3 = 122;
pub const _SC_NL_SETMAX: _bindgen_ty_3 = 123;
pub const _SC_NL_TEXTMAX: _bindgen_ty_3 = 124;
pub const _SC_XBS5_ILP32_OFF32: _bindgen_ty_3 = 125;
pub const _SC_XBS5_ILP32_OFFBIG: _bindgen_ty_3 = 126;
pub const _SC_XBS5_LP64_OFF64: _bindgen_ty_3 = 127;
pub const _SC_XBS5_LPBIG_OFFBIG: _bindgen_ty_3 = 128;
pub const _SC_XOPEN_LEGACY: _bindgen_ty_3 = 129;
pub const _SC_XOPEN_REALTIME: _bindgen_ty_3 = 130;
pub const _SC_XOPEN_REALTIME_THREADS: _bindgen_ty_3 = 131;
pub const _SC_ADVISORY_INFO: _bindgen_ty_3 = 132;
pub const _SC_BARRIERS: _bindgen_ty_3 = 133;
pub const _SC_BASE: _bindgen_ty_3 = 134;
pub const _SC_C_LANG_SUPPORT: _bindgen_ty_3 = 135;
pub const _SC_C_LANG_SUPPORT_R: _bindgen_ty_3 = 136;
pub const _SC_CLOCK_SELECTION: _bindgen_ty_3 = 137;
pub const _SC_CPUTIME: _bindgen_ty_3 = 138;
pub const _SC_THREAD_CPUTIME: _bindgen_ty_3 = 139;
pub const _SC_DEVICE_IO: _bindgen_ty_3 = 140;
pub const _SC_DEVICE_SPECIFIC: _bindgen_ty_3 = 141;
pub const _SC_DEVICE_SPECIFIC_R: _bindgen_ty_3 = 142;
pub const _SC_FD_MGMT: _bindgen_ty_3 = 143;
pub const _SC_FIFO: _bindgen_ty_3 = 144;
pub const _SC_PIPE: _bindgen_ty_3 = 145;
pub const _SC_FILE_ATTRIBUTES: _bindgen_ty_3 = 146;
pub const _SC_FILE_LOCKING: _bindgen_ty_3 = 147;
pub const _SC_FILE_SYSTEM: _bindgen_ty_3 = 148;
pub const _SC_MONOTONIC_CLOCK: _bindgen_ty_3 = 149;
pub const _SC_MULTI_PROCESS: _bindgen_ty_3 = 150;
pub const _SC_SINGLE_PROCESS: _bindgen_ty_3 = 151;
pub const _SC_NETWORKING: _bindgen_ty_3 = 152;
pub const _SC_READER_WRITER_LOCKS: _bindgen_ty_3 = 153;
pub const _SC_SPIN_LOCKS: _bindgen_ty_3 = 154;
pub const _SC_REGEXP: _bindgen_ty_3 = 155;
pub const _SC_REGEX_VERSION: _bindgen_ty_3 = 156;
pub const _SC_SHELL: _bindgen_ty_3 = 157;
pub const _SC_SIGNALS: _bindgen_ty_3 = 158;
pub const _SC_SPAWN: _bindgen_ty_3 = 159;
pub const _SC_SPORADIC_SERVER: _bindgen_ty_3 = 160;
pub const _SC_THREAD_SPORADIC_SERVER: _bindgen_ty_3 = 161;
pub const _SC_SYSTEM_DATABASE: _bindgen_ty_3 = 162;
pub const _SC_SYSTEM_DATABASE_R: _bindgen_ty_3 = 163;
pub const _SC_TIMEOUTS: _bindgen_ty_3 = 164;
pub const _SC_TYPED_MEMORY_OBJECTS: _bindgen_ty_3 = 165;
pub const _SC_USER_GROUPS: _bindgen_ty_3 = 166;
pub const _SC_USER_GROUPS_R: _bindgen_ty_3 = 167;
pub const _SC_2_PBS: _bindgen_ty_3 = 168;
pub const _SC_2_PBS_ACCOUNTING: _bindgen_ty_3 = 169;
pub const _SC_2_PBS_LOCATE: _bindgen_ty_3 = 170;
pub const _SC_2_PBS_MESSAGE: _bindgen_ty_3 = 171;
pub const _SC_2_PBS_TRACK: _bindgen_ty_3 = 172;
pub const _SC_SYMLOOP_MAX: _bindgen_ty_3 = 173;
pub const _SC_STREAMS: _bindgen_ty_3 = 174;
pub const _SC_2_PBS_CHECKPOINT: _bindgen_ty_3 = 175;
pub const _SC_V6_ILP32_OFF32: _bindgen_ty_3 = 176;
pub const _SC_V6_ILP32_OFFBIG: _bindgen_ty_3 = 177;
pub const _SC_V6_LP64_OFF64: _bindgen_ty_3 = 178;
pub const _SC_V6_LPBIG_OFFBIG: _bindgen_ty_3 = 179;
pub const _SC_HOST_NAME_MAX: _bindgen_ty_3 = 180;
pub const _SC_TRACE: _bindgen_ty_3 = 181;
pub const _SC_TRACE_EVENT_FILTER: _bindgen_ty_3 = 182;
pub const _SC_TRACE_INHERIT: _bindgen_ty_3 = 183;
pub const _SC_TRACE_LOG: _bindgen_ty_3 = 184;
pub const _SC_LEVEL1_ICACHE_SIZE: _bindgen_ty_3 = 185;
pub const _SC_LEVEL1_ICACHE_ASSOC: _bindgen_ty_3 = 186;
pub const _SC_LEVEL1_ICACHE_LINESIZE: _bindgen_ty_3 = 187;
pub const _SC_LEVEL1_DCACHE_SIZE: _bindgen_ty_3 = 188;
pub const _SC_LEVEL1_DCACHE_ASSOC: _bindgen_ty_3 = 189;
pub const _SC_LEVEL1_DCACHE_LINESIZE: _bindgen_ty_3 = 190;
pub const _SC_LEVEL2_CACHE_SIZE: _bindgen_ty_3 = 191;
pub const _SC_LEVEL2_CACHE_ASSOC: _bindgen_ty_3 = 192;
pub const _SC_LEVEL2_CACHE_LINESIZE: _bindgen_ty_3 = 193;
pub const _SC_LEVEL3_CACHE_SIZE: _bindgen_ty_3 = 194;
pub const _SC_LEVEL3_CACHE_ASSOC: _bindgen_ty_3 = 195;
pub const _SC_LEVEL3_CACHE_LINESIZE: _bindgen_ty_3 = 196;
pub const _SC_LEVEL4_CACHE_SIZE: _bindgen_ty_3 = 197;
pub const _SC_LEVEL4_CACHE_ASSOC: _bindgen_ty_3 = 198;
pub const _SC_LEVEL4_CACHE_LINESIZE: _bindgen_ty_3 = 199;
pub const _SC_IPV6: _bindgen_ty_3 = 235;
pub const _SC_RAW_SOCKETS: _bindgen_ty_3 = 236;
pub const _SC_V7_ILP32_OFF32: _bindgen_ty_3 = 237;
pub const _SC_V7_ILP32_OFFBIG: _bindgen_ty_3 = 238;
pub const _SC_V7_LP64_OFF64: _bindgen_ty_3 = 239;
pub const _SC_V7_LPBIG_OFFBIG: _bindgen_ty_3 = 240;
pub const _SC_SS_REPL_MAX: _bindgen_ty_3 = 241;
pub const _SC_TRACE_EVENT_NAME_MAX: _bindgen_ty_3 = 242;
pub const _SC_TRACE_NAME_MAX: _bindgen_ty_3 = 243;
pub const _SC_TRACE_SYS_MAX: _bindgen_ty_3 = 244;
pub const _SC_TRACE_USER_EVENT_MAX: _bindgen_ty_3 = 245;
pub const _SC_XOPEN_STREAMS: _bindgen_ty_3 = 246;
pub const _SC_THREAD_ROBUST_PRIO_INHERIT: _bindgen_ty_3 = 247;
pub const _SC_THREAD_ROBUST_PRIO_PROTECT: _bindgen_ty_3 = 248;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const _CS_PATH: _bindgen_ty_4 = 0;
pub const _CS_V6_WIDTH_RESTRICTED_ENVS: _bindgen_ty_4 = 1;
pub const _CS_GNU_LIBC_VERSION: _bindgen_ty_4 = 2;
pub const _CS_GNU_LIBPTHREAD_VERSION: _bindgen_ty_4 = 3;
pub const _CS_V5_WIDTH_RESTRICTED_ENVS: _bindgen_ty_4 = 4;
pub const _CS_V7_WIDTH_RESTRICTED_ENVS: _bindgen_ty_4 = 5;
pub const _CS_LFS_CFLAGS: _bindgen_ty_4 = 1000;
pub const _CS_LFS_LDFLAGS: _bindgen_ty_4 = 1001;
pub const _CS_LFS_LIBS: _bindgen_ty_4 = 1002;
pub const _CS_LFS_LINTFLAGS: _bindgen_ty_4 = 1003;
pub const _CS_LFS64_CFLAGS: _bindgen_ty_4 = 1004;
pub const _CS_LFS64_LDFLAGS: _bindgen_ty_4 = 1005;
pub const _CS_LFS64_LIBS: _bindgen_ty_4 = 1006;
pub const _CS_LFS64_LINTFLAGS: _bindgen_ty_4 = 1007;
pub const _CS_XBS5_ILP32_OFF32_CFLAGS: _bindgen_ty_4 = 1100;
pub const _CS_XBS5_ILP32_OFF32_LDFLAGS: _bindgen_ty_4 = 1101;
pub const _CS_XBS5_ILP32_OFF32_LIBS: _bindgen_ty_4 = 1102;
pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS: _bindgen_ty_4 = 1103;
pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS: _bindgen_ty_4 = 1104;
pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_4 = 1105;
pub const _CS_XBS5_ILP32_OFFBIG_LIBS: _bindgen_ty_4 = 1106;
pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_4 = 1107;
pub const _CS_XBS5_LP64_OFF64_CFLAGS: _bindgen_ty_4 = 1108;
pub const _CS_XBS5_LP64_OFF64_LDFLAGS: _bindgen_ty_4 = 1109;
pub const _CS_XBS5_LP64_OFF64_LIBS: _bindgen_ty_4 = 1110;
pub const _CS_XBS5_LP64_OFF64_LINTFLAGS: _bindgen_ty_4 = 1111;
pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_4 = 1112;
pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_4 = 1113;
pub const _CS_XBS5_LPBIG_OFFBIG_LIBS: _bindgen_ty_4 = 1114;
pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_4 = 1115;
pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS: _bindgen_ty_4 = 1116;
pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS: _bindgen_ty_4 = 1117;
pub const _CS_POSIX_V6_ILP32_OFF32_LIBS: _bindgen_ty_4 = 1118;
pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS: _bindgen_ty_4 = 1119;
pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS: _bindgen_ty_4 = 1120;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_4 = 1121;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS: _bindgen_ty_4 = 1122;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_4 = 1123;
pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS: _bindgen_ty_4 = 1124;
pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS: _bindgen_ty_4 = 1125;
pub const _CS_POSIX_V6_LP64_OFF64_LIBS: _bindgen_ty_4 = 1126;
pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS: _bindgen_ty_4 = 1127;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_4 = 1128;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_4 = 1129;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS: _bindgen_ty_4 = 1130;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_4 = 1131;
pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS: _bindgen_ty_4 = 1132;
pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS: _bindgen_ty_4 = 1133;
pub const _CS_POSIX_V7_ILP32_OFF32_LIBS: _bindgen_ty_4 = 1134;
pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS: _bindgen_ty_4 = 1135;
pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS: _bindgen_ty_4 = 1136;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_4 = 1137;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS: _bindgen_ty_4 = 1138;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_4 = 1139;
pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS: _bindgen_ty_4 = 1140;
pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS: _bindgen_ty_4 = 1141;
pub const _CS_POSIX_V7_LP64_OFF64_LIBS: _bindgen_ty_4 = 1142;
pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS: _bindgen_ty_4 = 1143;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_4 = 1144;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_4 = 1145;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LIBS: _bindgen_ty_4 = 1146;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_4 = 1147;
pub const _CS_V6_ENV: _bindgen_ty_4 = 1148;
pub const _CS_V7_ENV: _bindgen_ty_4 = 1149;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 44usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 4usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::std::mem::offset_of!(tm, tm_gmtoff) - 36usize];
    ["Offset of field: tm::tm_zone"][::std::mem::offset_of!(tm, tm_zone) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec"][::std::mem::size_of::<itimerspec>() - 16usize];
    ["Alignment of itimerspec"][::std::mem::align_of::<itimerspec>() - 4usize];
    ["Offset of field: itimerspec::it_interval"]
        [::std::mem::offset_of!(itimerspec, it_interval) - 0usize];
    ["Offset of field: itimerspec::it_value"]
        [::std::mem::offset_of!(itimerspec, it_value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timezone"][::std::mem::size_of::<timezone>() - 8usize];
    ["Alignment of timezone"][::std::mem::align_of::<timezone>() - 4usize];
    ["Offset of field: timezone::tz_minuteswest"]
        [::std::mem::offset_of!(timezone, tz_minuteswest) - 0usize];
    ["Offset of field: timezone::tz_dsttime"]
        [::std::mem::offset_of!(timezone, tz_dsttime) - 4usize];
};
pub type __timezone_ptr_t = *mut timezone;
pub const __itimer_which_ITIMER_REAL: __itimer_which = 0;
pub const __itimer_which_ITIMER_VIRTUAL: __itimer_which = 1;
pub const __itimer_which_ITIMER_PROF: __itimer_which = 2;
pub type __itimer_which = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerval"][::std::mem::size_of::<itimerval>() - 16usize];
    ["Alignment of itimerval"][::std::mem::align_of::<itimerval>() - 4usize];
    ["Offset of field: itimerval::it_interval"]
        [::std::mem::offset_of!(itimerval, it_interval) - 0usize];
    ["Offset of field: itimerval::it_value"][::std::mem::offset_of!(itimerval, it_value) - 8usize];
};
pub type __itimer_which_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: __dev_t,
    pub __pad1: ::std::os::raw::c_ushort,
    pub st_ino: __ino_t,
    pub st_mode: __mode_t,
    pub st_nlink: __nlink_t,
    pub st_uid: __uid_t,
    pub st_gid: __gid_t,
    pub st_rdev: __dev_t,
    pub __pad2: ::std::os::raw::c_ushort,
    pub st_size: __off_t,
    pub st_blksize: __blksize_t,
    pub st_blocks: __blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __glibc_reserved4: ::std::os::raw::c_ulong,
    pub __glibc_reserved5: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stat"][::std::mem::size_of::<stat>() - 88usize];
    ["Alignment of stat"][::std::mem::align_of::<stat>() - 8usize];
    ["Offset of field: stat::st_dev"][::std::mem::offset_of!(stat, st_dev) - 0usize];
    ["Offset of field: stat::__pad1"][::std::mem::offset_of!(stat, __pad1) - 8usize];
    ["Offset of field: stat::st_ino"][::std::mem::offset_of!(stat, st_ino) - 12usize];
    ["Offset of field: stat::st_mode"][::std::mem::offset_of!(stat, st_mode) - 16usize];
    ["Offset of field: stat::st_nlink"][::std::mem::offset_of!(stat, st_nlink) - 20usize];
    ["Offset of field: stat::st_uid"][::std::mem::offset_of!(stat, st_uid) - 24usize];
    ["Offset of field: stat::st_gid"][::std::mem::offset_of!(stat, st_gid) - 28usize];
    ["Offset of field: stat::st_rdev"][::std::mem::offset_of!(stat, st_rdev) - 32usize];
    ["Offset of field: stat::__pad2"][::std::mem::offset_of!(stat, __pad2) - 40usize];
    ["Offset of field: stat::st_size"][::std::mem::offset_of!(stat, st_size) - 44usize];
    ["Offset of field: stat::st_blksize"][::std::mem::offset_of!(stat, st_blksize) - 48usize];
    ["Offset of field: stat::st_blocks"][::std::mem::offset_of!(stat, st_blocks) - 52usize];
    ["Offset of field: stat::st_atim"][::std::mem::offset_of!(stat, st_atim) - 56usize];
    ["Offset of field: stat::st_mtim"][::std::mem::offset_of!(stat, st_mtim) - 64usize];
    ["Offset of field: stat::st_ctim"][::std::mem::offset_of!(stat, st_ctim) - 72usize];
    ["Offset of field: stat::__glibc_reserved4"]
        [::std::mem::offset_of!(stat, __glibc_reserved4) - 80usize];
    ["Offset of field: stat::__glibc_reserved5"]
        [::std::mem::offset_of!(stat, __glibc_reserved5) - 84usize];
};
pub type sig_atomic_t = __sig_atomic_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigval"][::std::mem::size_of::<sigval>() - 4usize];
    ["Alignment of sigval"][::std::mem::align_of::<sigval>() - 4usize];
    ["Offset of field: sigval::sival_int"][::std::mem::offset_of!(sigval, sival_int) - 0usize];
    ["Offset of field: sigval::sival_ptr"][::std::mem::offset_of!(sigval, sival_ptr) - 0usize];
};
pub type sigval_t = sigval;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t {
    pub si_signo: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub _sifields: siginfo_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1 {
    pub _pad: [::std::os::raw::c_int; 29usize],
    pub _kill: siginfo_t__bindgen_ty_1__bindgen_ty_1,
    pub _timer: siginfo_t__bindgen_ty_1__bindgen_ty_2,
    pub _rt: siginfo_t__bindgen_ty_1__bindgen_ty_3,
    pub _sigchld: siginfo_t__bindgen_ty_1__bindgen_ty_4,
    pub _sigfault: siginfo_t__bindgen_ty_1__bindgen_ty_5,
    pub _sigpoll: siginfo_t__bindgen_ty_1__bindgen_ty_6,
    pub _sigsys: siginfo_t__bindgen_ty_1__bindgen_ty_7,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_1 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1::si_pid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_1, si_pid) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1::si_uid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_1, si_uid) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_2 {
    pub si_tid: ::std::os::raw::c_int,
    pub si_overrun: ::std::os::raw::c_int,
    pub si_sigval: sigval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>() - 12usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::si_tid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, si_tid) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::si_overrun"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, si_overrun) - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::si_sigval"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, si_sigval) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_3 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
    pub si_sigval: sigval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>() - 12usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>() - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_3::si_pid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_3, si_pid) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_3::si_uid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_3, si_uid) - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_3::si_sigval"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_3, si_sigval) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_4 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
    pub si_status: ::std::os::raw::c_int,
    pub si_utime: __clock_t,
    pub si_stime: __clock_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>() - 20usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>() - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_pid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_pid) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_uid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_uid) - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_status"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_status) - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_utime"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_utime) - 12usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_stime"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_stime) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_5 {
    pub si_addr: *mut ::std::os::raw::c_void,
    pub si_addr_lsb: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5>() - 8usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5>() - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5::si_addr"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_5, si_addr) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5::si_addr_lsb"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_5, si_addr_lsb) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_6 {
    pub si_band: ::std::os::raw::c_long,
    pub si_fd: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_6>() - 8usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_6>() - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_6::si_band"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_6, si_band) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_6::si_fd"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_6, si_fd) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_7 {
    pub _call_addr: *mut ::std::os::raw::c_void,
    pub _syscall: ::std::os::raw::c_int,
    pub _arch: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_7"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_7>() - 12usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_7"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_7>() - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_7::_call_addr"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_7, _call_addr) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_7::_syscall"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_7, _syscall) - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_7::_arch"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_7, _arch) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1>() - 116usize];
    ["Alignment of siginfo_t__bindgen_ty_1"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_pad"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _pad) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_kill"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _kill) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_timer"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _timer) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_rt"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _rt) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_sigchld"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigchld) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_sigfault"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigfault) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_sigpoll"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigpoll) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_sigsys"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigsys) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t"][::std::mem::size_of::<siginfo_t>() - 128usize];
    ["Alignment of siginfo_t"][::std::mem::align_of::<siginfo_t>() - 4usize];
    ["Offset of field: siginfo_t::si_signo"][::std::mem::offset_of!(siginfo_t, si_signo) - 0usize];
    ["Offset of field: siginfo_t::si_errno"][::std::mem::offset_of!(siginfo_t, si_errno) - 4usize];
    ["Offset of field: siginfo_t::si_code"][::std::mem::offset_of!(siginfo_t, si_code) - 8usize];
    ["Offset of field: siginfo_t::_sifields"]
        [::std::mem::offset_of!(siginfo_t, _sifields) - 12usize];
};
pub const SI_ASYNCNL: _bindgen_ty_5 = -60;
pub const SI_TKILL: _bindgen_ty_5 = -6;
pub const SI_SIGIO: _bindgen_ty_5 = -5;
pub const SI_ASYNCIO: _bindgen_ty_5 = -4;
pub const SI_MESGQ: _bindgen_ty_5 = -3;
pub const SI_TIMER: _bindgen_ty_5 = -2;
pub const SI_QUEUE: _bindgen_ty_5 = -1;
pub const SI_USER: _bindgen_ty_5 = 0;
pub const SI_KERNEL: _bindgen_ty_5 = 128;
pub type _bindgen_ty_5 = ::std::os::raw::c_int;
pub const ILL_ILLOPC: _bindgen_ty_6 = 1;
pub const ILL_ILLOPN: _bindgen_ty_6 = 2;
pub const ILL_ILLADR: _bindgen_ty_6 = 3;
pub const ILL_ILLTRP: _bindgen_ty_6 = 4;
pub const ILL_PRVOPC: _bindgen_ty_6 = 5;
pub const ILL_PRVREG: _bindgen_ty_6 = 6;
pub const ILL_COPROC: _bindgen_ty_6 = 7;
pub const ILL_BADSTK: _bindgen_ty_6 = 8;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
pub const FPE_INTDIV: _bindgen_ty_7 = 1;
pub const FPE_INTOVF: _bindgen_ty_7 = 2;
pub const FPE_FLTDIV: _bindgen_ty_7 = 3;
pub const FPE_FLTOVF: _bindgen_ty_7 = 4;
pub const FPE_FLTUND: _bindgen_ty_7 = 5;
pub const FPE_FLTRES: _bindgen_ty_7 = 6;
pub const FPE_FLTINV: _bindgen_ty_7 = 7;
pub const FPE_FLTSUB: _bindgen_ty_7 = 8;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
pub const SEGV_MAPERR: _bindgen_ty_8 = 1;
pub const SEGV_ACCERR: _bindgen_ty_8 = 2;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub const BUS_ADRALN: _bindgen_ty_9 = 1;
pub const BUS_ADRERR: _bindgen_ty_9 = 2;
pub const BUS_OBJERR: _bindgen_ty_9 = 3;
pub const BUS_MCEERR_AR: _bindgen_ty_9 = 4;
pub const BUS_MCEERR_AO: _bindgen_ty_9 = 5;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
pub const CLD_EXITED: _bindgen_ty_10 = 1;
pub const CLD_KILLED: _bindgen_ty_10 = 2;
pub const CLD_DUMPED: _bindgen_ty_10 = 3;
pub const CLD_TRAPPED: _bindgen_ty_10 = 4;
pub const CLD_STOPPED: _bindgen_ty_10 = 5;
pub const CLD_CONTINUED: _bindgen_ty_10 = 6;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
pub const POLL_IN: _bindgen_ty_11 = 1;
pub const POLL_OUT: _bindgen_ty_11 = 2;
pub const POLL_MSG: _bindgen_ty_11 = 3;
pub const POLL_ERR: _bindgen_ty_11 = 4;
pub const POLL_PRI: _bindgen_ty_11 = 5;
pub const POLL_HUP: _bindgen_ty_11 = 6;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
pub const SIGEV_SIGNAL: _bindgen_ty_12 = 0;
pub const SIGEV_NONE: _bindgen_ty_12 = 1;
pub const SIGEV_THREAD: _bindgen_ty_12 = 2;
pub const SIGEV_THREAD_ID: _bindgen_ty_12 = 4;
pub type _bindgen_ty_12 = ::std::os::raw::c_uint;
pub type __sighandler_t = ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type sig_t = __sighandler_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
    pub __sigaction_handler: sigaction__bindgen_ty_1,
    pub sa_mask: __sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
    pub sa_restorer: ::std::option::Option<unsafe extern "C" fn()>,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigaction__bindgen_ty_1 {
    pub sa_handler: __sighandler_t,
    pub sa_sigaction: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut siginfo_t,
            arg3: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction__bindgen_ty_1"][::std::mem::size_of::<sigaction__bindgen_ty_1>() - 4usize];
    ["Alignment of sigaction__bindgen_ty_1"]
        [::std::mem::align_of::<sigaction__bindgen_ty_1>() - 4usize];
    ["Offset of field: sigaction__bindgen_ty_1::sa_handler"]
        [::std::mem::offset_of!(sigaction__bindgen_ty_1, sa_handler) - 0usize];
    ["Offset of field: sigaction__bindgen_ty_1::sa_sigaction"]
        [::std::mem::offset_of!(sigaction__bindgen_ty_1, sa_sigaction) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction"][::std::mem::size_of::<sigaction>() - 140usize];
    ["Alignment of sigaction"][::std::mem::align_of::<sigaction>() - 4usize];
    ["Offset of field: sigaction::__sigaction_handler"]
        [::std::mem::offset_of!(sigaction, __sigaction_handler) - 0usize];
    ["Offset of field: sigaction::sa_mask"][::std::mem::offset_of!(sigaction, sa_mask) - 4usize];
    ["Offset of field: sigaction::sa_flags"]
        [::std::mem::offset_of!(sigaction, sa_flags) - 132usize];
    ["Offset of field: sigaction::sa_restorer"]
        [::std::mem::offset_of!(sigaction, sa_restorer) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigcontext {
    pub trap_no: ::std::os::raw::c_ulong,
    pub error_code: ::std::os::raw::c_ulong,
    pub oldmask: ::std::os::raw::c_ulong,
    pub arm_r0: ::std::os::raw::c_ulong,
    pub arm_r1: ::std::os::raw::c_ulong,
    pub arm_r2: ::std::os::raw::c_ulong,
    pub arm_r3: ::std::os::raw::c_ulong,
    pub arm_r4: ::std::os::raw::c_ulong,
    pub arm_r5: ::std::os::raw::c_ulong,
    pub arm_r6: ::std::os::raw::c_ulong,
    pub arm_r7: ::std::os::raw::c_ulong,
    pub arm_r8: ::std::os::raw::c_ulong,
    pub arm_r9: ::std::os::raw::c_ulong,
    pub arm_r10: ::std::os::raw::c_ulong,
    pub arm_fp: ::std::os::raw::c_ulong,
    pub arm_ip: ::std::os::raw::c_ulong,
    pub arm_sp: ::std::os::raw::c_ulong,
    pub arm_lr: ::std::os::raw::c_ulong,
    pub arm_pc: ::std::os::raw::c_ulong,
    pub arm_cpsr: ::std::os::raw::c_ulong,
    pub fault_address: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigcontext"][::std::mem::size_of::<sigcontext>() - 84usize];
    ["Alignment of sigcontext"][::std::mem::align_of::<sigcontext>() - 4usize];
    ["Offset of field: sigcontext::trap_no"][::std::mem::offset_of!(sigcontext, trap_no) - 0usize];
    ["Offset of field: sigcontext::error_code"]
        [::std::mem::offset_of!(sigcontext, error_code) - 4usize];
    ["Offset of field: sigcontext::oldmask"][::std::mem::offset_of!(sigcontext, oldmask) - 8usize];
    ["Offset of field: sigcontext::arm_r0"][::std::mem::offset_of!(sigcontext, arm_r0) - 12usize];
    ["Offset of field: sigcontext::arm_r1"][::std::mem::offset_of!(sigcontext, arm_r1) - 16usize];
    ["Offset of field: sigcontext::arm_r2"][::std::mem::offset_of!(sigcontext, arm_r2) - 20usize];
    ["Offset of field: sigcontext::arm_r3"][::std::mem::offset_of!(sigcontext, arm_r3) - 24usize];
    ["Offset of field: sigcontext::arm_r4"][::std::mem::offset_of!(sigcontext, arm_r4) - 28usize];
    ["Offset of field: sigcontext::arm_r5"][::std::mem::offset_of!(sigcontext, arm_r5) - 32usize];
    ["Offset of field: sigcontext::arm_r6"][::std::mem::offset_of!(sigcontext, arm_r6) - 36usize];
    ["Offset of field: sigcontext::arm_r7"][::std::mem::offset_of!(sigcontext, arm_r7) - 40usize];
    ["Offset of field: sigcontext::arm_r8"][::std::mem::offset_of!(sigcontext, arm_r8) - 44usize];
    ["Offset of field: sigcontext::arm_r9"][::std::mem::offset_of!(sigcontext, arm_r9) - 48usize];
    ["Offset of field: sigcontext::arm_r10"][::std::mem::offset_of!(sigcontext, arm_r10) - 52usize];
    ["Offset of field: sigcontext::arm_fp"][::std::mem::offset_of!(sigcontext, arm_fp) - 56usize];
    ["Offset of field: sigcontext::arm_ip"][::std::mem::offset_of!(sigcontext, arm_ip) - 60usize];
    ["Offset of field: sigcontext::arm_sp"][::std::mem::offset_of!(sigcontext, arm_sp) - 64usize];
    ["Offset of field: sigcontext::arm_lr"][::std::mem::offset_of!(sigcontext, arm_lr) - 68usize];
    ["Offset of field: sigcontext::arm_pc"][::std::mem::offset_of!(sigcontext, arm_pc) - 72usize];
    ["Offset of field: sigcontext::arm_cpsr"]
        [::std::mem::offset_of!(sigcontext, arm_cpsr) - 76usize];
    ["Offset of field: sigcontext::fault_address"]
        [::std::mem::offset_of!(sigcontext, fault_address) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigstack {
    pub ss_sp: *mut ::std::os::raw::c_void,
    pub ss_onstack: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigstack"][::std::mem::size_of::<sigstack>() - 8usize];
    ["Alignment of sigstack"][::std::mem::align_of::<sigstack>() - 4usize];
    ["Offset of field: sigstack::ss_sp"][::std::mem::offset_of!(sigstack, ss_sp) - 0usize];
    ["Offset of field: sigstack::ss_onstack"]
        [::std::mem::offset_of!(sigstack, ss_onstack) - 4usize];
};
pub const SS_ONSTACK: _bindgen_ty_13 = 1;
pub const SS_DISABLE: _bindgen_ty_13 = 2;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigaltstack {
    pub ss_sp: *mut ::std::os::raw::c_void,
    pub ss_flags: ::std::os::raw::c_int,
    pub ss_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaltstack"][::std::mem::size_of::<sigaltstack>() - 12usize];
    ["Alignment of sigaltstack"][::std::mem::align_of::<sigaltstack>() - 4usize];
    ["Offset of field: sigaltstack::ss_sp"][::std::mem::offset_of!(sigaltstack, ss_sp) - 0usize];
    ["Offset of field: sigaltstack::ss_flags"]
        [::std::mem::offset_of!(sigaltstack, ss_flags) - 4usize];
    ["Offset of field: sigaltstack::ss_size"]
        [::std::mem::offset_of!(sigaltstack, ss_size) - 8usize];
};
pub type stack_t = sigaltstack;
pub type greg_t = ::std::os::raw::c_int;
pub type gregset_t = [greg_t; 18usize];
pub const REG_R0: _bindgen_ty_14 = 0;
pub const REG_R1: _bindgen_ty_14 = 1;
pub const REG_R2: _bindgen_ty_14 = 2;
pub const REG_R3: _bindgen_ty_14 = 3;
pub const REG_R4: _bindgen_ty_14 = 4;
pub const REG_R5: _bindgen_ty_14 = 5;
pub const REG_R6: _bindgen_ty_14 = 6;
pub const REG_R7: _bindgen_ty_14 = 7;
pub const REG_R8: _bindgen_ty_14 = 8;
pub const REG_R9: _bindgen_ty_14 = 9;
pub const REG_R10: _bindgen_ty_14 = 10;
pub const REG_R11: _bindgen_ty_14 = 11;
pub const REG_R12: _bindgen_ty_14 = 12;
pub const REG_R13: _bindgen_ty_14 = 13;
pub const REG_R14: _bindgen_ty_14 = 14;
pub const REG_R15: _bindgen_ty_14 = 15;
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _libc_fpstate {
    pub fpregs: [_libc_fpstate__bindgen_ty_1; 8usize],
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
    pub ftype: [::std::os::raw::c_uchar; 8usize],
    pub init_flag: ::std::os::raw::c_uint,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _libc_fpstate__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 12usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _libc_fpstate__bindgen_ty_1"]
        [::std::mem::size_of::<_libc_fpstate__bindgen_ty_1>() - 12usize];
    ["Alignment of _libc_fpstate__bindgen_ty_1"]
        [::std::mem::align_of::<_libc_fpstate__bindgen_ty_1>() - 4usize];
};
impl _libc_fpstate__bindgen_ty_1 {
    #[inline]
    pub fn sign1(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_sign1(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sign1_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 12usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_sign1_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 12usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn unused(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 15u8) as u32) }
    }
    #[inline]
    pub fn set_unused(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn unused_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 12usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                15u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_unused_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 12usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                15u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sign2(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_sign2(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sign2_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 12usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_sign2_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 12usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn exponent(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 14u8) as u32) }
    }
    #[inline]
    pub fn set_exponent(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 14u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn exponent_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 12usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                17usize,
                14u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_exponent_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 12usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                14u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn j(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_j(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn j_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 12usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                31usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_j_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 12usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mantissa1(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_mantissa1(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mantissa1_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 12usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                32usize,
                31u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_mantissa1_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 12usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                32usize,
                31u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mantissa0(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_mantissa0(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(64usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mantissa0_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 12usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                64usize,
                32u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_mantissa0_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 12usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                64usize,
                32u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        sign1: ::std::os::raw::c_uint,
        unused: ::std::os::raw::c_uint,
        sign2: ::std::os::raw::c_uint,
        exponent: ::std::os::raw::c_uint,
        j: ::std::os::raw::c_uint,
        mantissa1: ::std::os::raw::c_uint,
        mantissa0: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 12usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 12usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let sign1: u32 = unsafe { ::std::mem::transmute(sign1) };
            sign1 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 15u8, {
            let unused: u32 = unsafe { ::std::mem::transmute(unused) };
            unused as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let sign2: u32 = unsafe { ::std::mem::transmute(sign2) };
            sign2 as u64
        });
        __bindgen_bitfield_unit.set(17usize, 14u8, {
            let exponent: u32 = unsafe { ::std::mem::transmute(exponent) };
            exponent as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let j: u32 = unsafe { ::std::mem::transmute(j) };
            j as u64
        });
        __bindgen_bitfield_unit.set(32usize, 31u8, {
            let mantissa1: u32 = unsafe { ::std::mem::transmute(mantissa1) };
            mantissa1 as u64
        });
        __bindgen_bitfield_unit.set(64usize, 32u8, {
            let mantissa0: u32 = unsafe { ::std::mem::transmute(mantissa0) };
            mantissa0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _libc_fpstate"][::std::mem::size_of::<_libc_fpstate>() - 116usize];
    ["Alignment of _libc_fpstate"][::std::mem::align_of::<_libc_fpstate>() - 4usize];
    ["Offset of field: _libc_fpstate::fpregs"]
        [::std::mem::offset_of!(_libc_fpstate, fpregs) - 0usize];
    ["Offset of field: _libc_fpstate::ftype"]
        [::std::mem::offset_of!(_libc_fpstate, ftype) - 104usize];
    ["Offset of field: _libc_fpstate::init_flag"]
        [::std::mem::offset_of!(_libc_fpstate, init_flag) - 112usize];
};
impl _libc_fpstate {
    #[inline]
    pub fn fpsr(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_fpsr(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn fpsr_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                32u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_fpsr_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                32u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn fpcr(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_fpcr(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn fpcr_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                32usize,
                32u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_fpcr_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                32usize,
                32u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        fpsr: ::std::os::raw::c_uint,
        fpcr: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 32u8, {
            let fpsr: u32 = unsafe { ::std::mem::transmute(fpsr) };
            fpsr as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let fpcr: u32 = unsafe { ::std::mem::transmute(fpcr) };
            fpcr as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type fpregset_t = _libc_fpstate;
pub type mcontext_t = sigcontext;
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct ucontext {
    pub uc_flags: ::std::os::raw::c_ulong,
    pub uc_link: *mut ucontext,
    pub uc_stack: stack_t,
    pub uc_mcontext: mcontext_t,
    pub uc_sigmask: __sigset_t,
    pub uc_regspace: [::std::os::raw::c_ulong; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ucontext"][::std::mem::size_of::<ucontext>() - 744usize];
    ["Alignment of ucontext"][::std::mem::align_of::<ucontext>() - 8usize];
    ["Offset of field: ucontext::uc_flags"][::std::mem::offset_of!(ucontext, uc_flags) - 0usize];
    ["Offset of field: ucontext::uc_link"][::std::mem::offset_of!(ucontext, uc_link) - 4usize];
    ["Offset of field: ucontext::uc_stack"][::std::mem::offset_of!(ucontext, uc_stack) - 8usize];
    ["Offset of field: ucontext::uc_mcontext"]
        [::std::mem::offset_of!(ucontext, uc_mcontext) - 20usize];
    ["Offset of field: ucontext::uc_sigmask"]
        [::std::mem::offset_of!(ucontext, uc_sigmask) - 104usize];
    ["Offset of field: ucontext::uc_regspace"]
        [::std::mem::offset_of!(ucontext, uc_regspace) - 232usize];
};
pub type ucontext_t = ucontext;
pub const idtype_t_P_ALL: idtype_t = 0;
pub const idtype_t_P_PID: idtype_t = 1;
pub const idtype_t_P_PGID: idtype_t = 2;
pub type idtype_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dirent {
    pub d_ino: __ino_t,
    pub d_off: __off_t,
    pub d_reclen: ::std::os::raw::c_ushort,
    pub d_type: ::std::os::raw::c_uchar,
    pub d_name: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dirent"][::std::mem::size_of::<dirent>() - 268usize];
    ["Alignment of dirent"][::std::mem::align_of::<dirent>() - 4usize];
    ["Offset of field: dirent::d_ino"][::std::mem::offset_of!(dirent, d_ino) - 0usize];
    ["Offset of field: dirent::d_off"][::std::mem::offset_of!(dirent, d_off) - 4usize];
    ["Offset of field: dirent::d_reclen"][::std::mem::offset_of!(dirent, d_reclen) - 8usize];
    ["Offset of field: dirent::d_type"][::std::mem::offset_of!(dirent, d_type) - 10usize];
    ["Offset of field: dirent::d_name"][::std::mem::offset_of!(dirent, d_name) - 11usize];
};
pub const DT_UNKNOWN: _bindgen_ty_15 = 0;
pub const DT_FIFO: _bindgen_ty_15 = 1;
pub const DT_CHR: _bindgen_ty_15 = 2;
pub const DT_DIR: _bindgen_ty_15 = 4;
pub const DT_BLK: _bindgen_ty_15 = 6;
pub const DT_REG: _bindgen_ty_15 = 8;
pub const DT_LNK: _bindgen_ty_15 = 10;
pub const DT_SOCK: _bindgen_ty_15 = 12;
pub const DT_WHT: _bindgen_ty_15 = 14;
pub type _bindgen_ty_15 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __dirstream {
    _unused: [u8; 0],
}
pub type DIR = __dirstream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct flock {
    pub l_type: ::std::os::raw::c_short,
    pub l_whence: ::std::os::raw::c_short,
    pub l_start: __off_t,
    pub l_len: __off_t,
    pub l_pid: __pid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of flock"][::std::mem::size_of::<flock>() - 16usize];
    ["Alignment of flock"][::std::mem::align_of::<flock>() - 4usize];
    ["Offset of field: flock::l_type"][::std::mem::offset_of!(flock, l_type) - 0usize];
    ["Offset of field: flock::l_whence"][::std::mem::offset_of!(flock, l_whence) - 2usize];
    ["Offset of field: flock::l_start"][::std::mem::offset_of!(flock, l_start) - 4usize];
    ["Offset of field: flock::l_len"][::std::mem::offset_of!(flock, l_len) - 8usize];
    ["Offset of field: flock::l_pid"][::std::mem::offset_of!(flock, l_pid) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group {
    pub gr_name: *mut ::std::os::raw::c_char,
    pub gr_passwd: *mut ::std::os::raw::c_char,
    pub gr_gid: __gid_t,
    pub gr_mem: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group"][::std::mem::size_of::<group>() - 16usize];
    ["Alignment of group"][::std::mem::align_of::<group>() - 4usize];
    ["Offset of field: group::gr_name"][::std::mem::offset_of!(group, gr_name) - 0usize];
    ["Offset of field: group::gr_passwd"][::std::mem::offset_of!(group, gr_passwd) - 4usize];
    ["Offset of field: group::gr_gid"][::std::mem::offset_of!(group, gr_gid) - 8usize];
    ["Offset of field: group::gr_mem"][::std::mem::offset_of!(group, gr_mem) - 12usize];
};
pub type __ipc_pid_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipc_perm {
    pub __key: __key_t,
    pub uid: __uid_t,
    pub gid: __gid_t,
    pub cuid: __uid_t,
    pub cgid: __gid_t,
    pub mode: ::std::os::raw::c_ushort,
    pub __pad1: ::std::os::raw::c_ushort,
    pub __seq: ::std::os::raw::c_ushort,
    pub __pad2: ::std::os::raw::c_ushort,
    pub __glibc_reserved1: __syscall_ulong_t,
    pub __glibc_reserved2: __syscall_ulong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipc_perm"][::std::mem::size_of::<ipc_perm>() - 36usize];
    ["Alignment of ipc_perm"][::std::mem::align_of::<ipc_perm>() - 4usize];
    ["Offset of field: ipc_perm::__key"][::std::mem::offset_of!(ipc_perm, __key) - 0usize];
    ["Offset of field: ipc_perm::uid"][::std::mem::offset_of!(ipc_perm, uid) - 4usize];
    ["Offset of field: ipc_perm::gid"][::std::mem::offset_of!(ipc_perm, gid) - 8usize];
    ["Offset of field: ipc_perm::cuid"][::std::mem::offset_of!(ipc_perm, cuid) - 12usize];
    ["Offset of field: ipc_perm::cgid"][::std::mem::offset_of!(ipc_perm, cgid) - 16usize];
    ["Offset of field: ipc_perm::mode"][::std::mem::offset_of!(ipc_perm, mode) - 20usize];
    ["Offset of field: ipc_perm::__pad1"][::std::mem::offset_of!(ipc_perm, __pad1) - 22usize];
    ["Offset of field: ipc_perm::__seq"][::std::mem::offset_of!(ipc_perm, __seq) - 24usize];
    ["Offset of field: ipc_perm::__pad2"][::std::mem::offset_of!(ipc_perm, __pad2) - 26usize];
    ["Offset of field: ipc_perm::__glibc_reserved1"]
        [::std::mem::offset_of!(ipc_perm, __glibc_reserved1) - 28usize];
    ["Offset of field: ipc_perm::__glibc_reserved2"]
        [::std::mem::offset_of!(ipc_perm, __glibc_reserved2) - 32usize];
};
pub type shmatt_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct shmid_ds {
    pub shm_perm: ipc_perm,
    pub shm_segsz: usize,
    pub shm_atime: __time_t,
    pub __glibc_reserved1: ::std::os::raw::c_ulong,
    pub shm_dtime: __time_t,
    pub __glibc_reserved2: ::std::os::raw::c_ulong,
    pub shm_ctime: __time_t,
    pub __glibc_reserved3: ::std::os::raw::c_ulong,
    pub shm_cpid: __pid_t,
    pub shm_lpid: __pid_t,
    pub shm_nattch: shmatt_t,
    pub __glibc_reserved4: ::std::os::raw::c_ulong,
    pub __glibc_reserved5: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of shmid_ds"][::std::mem::size_of::<shmid_ds>() - 84usize];
    ["Alignment of shmid_ds"][::std::mem::align_of::<shmid_ds>() - 4usize];
    ["Offset of field: shmid_ds::shm_perm"][::std::mem::offset_of!(shmid_ds, shm_perm) - 0usize];
    ["Offset of field: shmid_ds::shm_segsz"][::std::mem::offset_of!(shmid_ds, shm_segsz) - 36usize];
    ["Offset of field: shmid_ds::shm_atime"][::std::mem::offset_of!(shmid_ds, shm_atime) - 40usize];
    ["Offset of field: shmid_ds::__glibc_reserved1"]
        [::std::mem::offset_of!(shmid_ds, __glibc_reserved1) - 44usize];
    ["Offset of field: shmid_ds::shm_dtime"][::std::mem::offset_of!(shmid_ds, shm_dtime) - 48usize];
    ["Offset of field: shmid_ds::__glibc_reserved2"]
        [::std::mem::offset_of!(shmid_ds, __glibc_reserved2) - 52usize];
    ["Offset of field: shmid_ds::shm_ctime"][::std::mem::offset_of!(shmid_ds, shm_ctime) - 56usize];
    ["Offset of field: shmid_ds::__glibc_reserved3"]
        [::std::mem::offset_of!(shmid_ds, __glibc_reserved3) - 60usize];
    ["Offset of field: shmid_ds::shm_cpid"][::std::mem::offset_of!(shmid_ds, shm_cpid) - 64usize];
    ["Offset of field: shmid_ds::shm_lpid"][::std::mem::offset_of!(shmid_ds, shm_lpid) - 68usize];
    ["Offset of field: shmid_ds::shm_nattch"]
        [::std::mem::offset_of!(shmid_ds, shm_nattch) - 72usize];
    ["Offset of field: shmid_ds::__glibc_reserved4"]
        [::std::mem::offset_of!(shmid_ds, __glibc_reserved4) - 76usize];
    ["Offset of field: shmid_ds::__glibc_reserved5"]
        [::std::mem::offset_of!(shmid_ds, __glibc_reserved5) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct shminfo {
    pub shmmax: ::std::os::raw::c_ulong,
    pub shmmin: ::std::os::raw::c_ulong,
    pub shmmni: ::std::os::raw::c_ulong,
    pub shmseg: ::std::os::raw::c_ulong,
    pub shmall: ::std::os::raw::c_ulong,
    pub __glibc_reserved1: ::std::os::raw::c_ulong,
    pub __glibc_reserved2: ::std::os::raw::c_ulong,
    pub __glibc_reserved3: ::std::os::raw::c_ulong,
    pub __glibc_reserved4: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of shminfo"][::std::mem::size_of::<shminfo>() - 36usize];
    ["Alignment of shminfo"][::std::mem::align_of::<shminfo>() - 4usize];
    ["Offset of field: shminfo::shmmax"][::std::mem::offset_of!(shminfo, shmmax) - 0usize];
    ["Offset of field: shminfo::shmmin"][::std::mem::offset_of!(shminfo, shmmin) - 4usize];
    ["Offset of field: shminfo::shmmni"][::std::mem::offset_of!(shminfo, shmmni) - 8usize];
    ["Offset of field: shminfo::shmseg"][::std::mem::offset_of!(shminfo, shmseg) - 12usize];
    ["Offset of field: shminfo::shmall"][::std::mem::offset_of!(shminfo, shmall) - 16usize];
    ["Offset of field: shminfo::__glibc_reserved1"]
        [::std::mem::offset_of!(shminfo, __glibc_reserved1) - 20usize];
    ["Offset of field: shminfo::__glibc_reserved2"]
        [::std::mem::offset_of!(shminfo, __glibc_reserved2) - 24usize];
    ["Offset of field: shminfo::__glibc_reserved3"]
        [::std::mem::offset_of!(shminfo, __glibc_reserved3) - 28usize];
    ["Offset of field: shminfo::__glibc_reserved4"]
        [::std::mem::offset_of!(shminfo, __glibc_reserved4) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct shm_info {
    pub used_ids: ::std::os::raw::c_int,
    pub shm_tot: ::std::os::raw::c_ulong,
    pub shm_rss: ::std::os::raw::c_ulong,
    pub shm_swp: ::std::os::raw::c_ulong,
    pub swap_attempts: ::std::os::raw::c_ulong,
    pub swap_successes: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of shm_info"][::std::mem::size_of::<shm_info>() - 24usize];
    ["Alignment of shm_info"][::std::mem::align_of::<shm_info>() - 4usize];
    ["Offset of field: shm_info::used_ids"][::std::mem::offset_of!(shm_info, used_ids) - 0usize];
    ["Offset of field: shm_info::shm_tot"][::std::mem::offset_of!(shm_info, shm_tot) - 4usize];
    ["Offset of field: shm_info::shm_rss"][::std::mem::offset_of!(shm_info, shm_rss) - 8usize];
    ["Offset of field: shm_info::shm_swp"][::std::mem::offset_of!(shm_info, shm_swp) - 12usize];
    ["Offset of field: shm_info::swap_attempts"]
        [::std::mem::offset_of!(shm_info, swap_attempts) - 16usize];
    ["Offset of field: shm_info::swap_successes"]
        [::std::mem::offset_of!(shm_info, swap_successes) - 20usize];
};
pub type msgqnum_t = ::std::os::raw::c_ulong;
pub type msglen_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msqid_ds {
    pub msg_perm: ipc_perm,
    pub msg_stime: __time_t,
    pub __glibc_reserved1: ::std::os::raw::c_ulong,
    pub msg_rtime: __time_t,
    pub __glibc_reserved2: ::std::os::raw::c_ulong,
    pub msg_ctime: __time_t,
    pub __glibc_reserved3: ::std::os::raw::c_ulong,
    pub __msg_cbytes: ::std::os::raw::c_ulong,
    pub msg_qnum: msgqnum_t,
    pub msg_qbytes: msglen_t,
    pub msg_lspid: __pid_t,
    pub msg_lrpid: __pid_t,
    pub __glibc_reserved4: ::std::os::raw::c_ulong,
    pub __glibc_reserved5: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of msqid_ds"][::std::mem::size_of::<msqid_ds>() - 88usize];
    ["Alignment of msqid_ds"][::std::mem::align_of::<msqid_ds>() - 4usize];
    ["Offset of field: msqid_ds::msg_perm"][::std::mem::offset_of!(msqid_ds, msg_perm) - 0usize];
    ["Offset of field: msqid_ds::msg_stime"][::std::mem::offset_of!(msqid_ds, msg_stime) - 36usize];
    ["Offset of field: msqid_ds::__glibc_reserved1"]
        [::std::mem::offset_of!(msqid_ds, __glibc_reserved1) - 40usize];
    ["Offset of field: msqid_ds::msg_rtime"][::std::mem::offset_of!(msqid_ds, msg_rtime) - 44usize];
    ["Offset of field: msqid_ds::__glibc_reserved2"]
        [::std::mem::offset_of!(msqid_ds, __glibc_reserved2) - 48usize];
    ["Offset of field: msqid_ds::msg_ctime"][::std::mem::offset_of!(msqid_ds, msg_ctime) - 52usize];
    ["Offset of field: msqid_ds::__glibc_reserved3"]
        [::std::mem::offset_of!(msqid_ds, __glibc_reserved3) - 56usize];
    ["Offset of field: msqid_ds::__msg_cbytes"]
        [::std::mem::offset_of!(msqid_ds, __msg_cbytes) - 60usize];
    ["Offset of field: msqid_ds::msg_qnum"][::std::mem::offset_of!(msqid_ds, msg_qnum) - 64usize];
    ["Offset of field: msqid_ds::msg_qbytes"]
        [::std::mem::offset_of!(msqid_ds, msg_qbytes) - 68usize];
    ["Offset of field: msqid_ds::msg_lspid"][::std::mem::offset_of!(msqid_ds, msg_lspid) - 72usize];
    ["Offset of field: msqid_ds::msg_lrpid"][::std::mem::offset_of!(msqid_ds, msg_lrpid) - 76usize];
    ["Offset of field: msqid_ds::__glibc_reserved4"]
        [::std::mem::offset_of!(msqid_ds, __glibc_reserved4) - 80usize];
    ["Offset of field: msqid_ds::__glibc_reserved5"]
        [::std::mem::offset_of!(msqid_ds, __glibc_reserved5) - 84usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msginfo {
    pub msgpool: ::std::os::raw::c_int,
    pub msgmap: ::std::os::raw::c_int,
    pub msgmax: ::std::os::raw::c_int,
    pub msgmnb: ::std::os::raw::c_int,
    pub msgmni: ::std::os::raw::c_int,
    pub msgssz: ::std::os::raw::c_int,
    pub msgtql: ::std::os::raw::c_int,
    pub msgseg: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of msginfo"][::std::mem::size_of::<msginfo>() - 32usize];
    ["Alignment of msginfo"][::std::mem::align_of::<msginfo>() - 4usize];
    ["Offset of field: msginfo::msgpool"][::std::mem::offset_of!(msginfo, msgpool) - 0usize];
    ["Offset of field: msginfo::msgmap"][::std::mem::offset_of!(msginfo, msgmap) - 4usize];
    ["Offset of field: msginfo::msgmax"][::std::mem::offset_of!(msginfo, msgmax) - 8usize];
    ["Offset of field: msginfo::msgmnb"][::std::mem::offset_of!(msginfo, msgmnb) - 12usize];
    ["Offset of field: msginfo::msgmni"][::std::mem::offset_of!(msginfo, msgmni) - 16usize];
    ["Offset of field: msginfo::msgssz"][::std::mem::offset_of!(msginfo, msgssz) - 20usize];
    ["Offset of field: msginfo::msgtql"][::std::mem::offset_of!(msginfo, msgtql) - 24usize];
    ["Offset of field: msginfo::msgseg"][::std::mem::offset_of!(msginfo, msgseg) - 28usize];
};
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::std::mem::align_of::<__kernel_fd_set>() - 4usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_mode_t = ::std::os::raw::c_ushort;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_ushort;
pub type __kernel_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ushort;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_old_uid_t = __kernel_uid_t;
pub type __kernel_old_gid_t = __kernel_gid_t;
pub type __kernel_size_t = ::std::os::raw::c_uint;
pub type __kernel_ssize_t = ::std::os::raw::c_int;
pub type __kernel_ptrdiff_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sysinfo {
    pub uptime: __kernel_long_t,
    pub loads: [__kernel_ulong_t; 3usize],
    pub totalram: __kernel_ulong_t,
    pub freeram: __kernel_ulong_t,
    pub sharedram: __kernel_ulong_t,
    pub bufferram: __kernel_ulong_t,
    pub totalswap: __kernel_ulong_t,
    pub freeswap: __kernel_ulong_t,
    pub procs: __u16,
    pub pad: __u16,
    pub totalhigh: __kernel_ulong_t,
    pub freehigh: __kernel_ulong_t,
    pub mem_unit: __u32,
    pub _f: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sysinfo"][::std::mem::size_of::<sysinfo>() - 64usize];
    ["Alignment of sysinfo"][::std::mem::align_of::<sysinfo>() - 4usize];
    ["Offset of field: sysinfo::uptime"][::std::mem::offset_of!(sysinfo, uptime) - 0usize];
    ["Offset of field: sysinfo::loads"][::std::mem::offset_of!(sysinfo, loads) - 4usize];
    ["Offset of field: sysinfo::totalram"][::std::mem::offset_of!(sysinfo, totalram) - 16usize];
    ["Offset of field: sysinfo::freeram"][::std::mem::offset_of!(sysinfo, freeram) - 20usize];
    ["Offset of field: sysinfo::sharedram"][::std::mem::offset_of!(sysinfo, sharedram) - 24usize];
    ["Offset of field: sysinfo::bufferram"][::std::mem::offset_of!(sysinfo, bufferram) - 28usize];
    ["Offset of field: sysinfo::totalswap"][::std::mem::offset_of!(sysinfo, totalswap) - 32usize];
    ["Offset of field: sysinfo::freeswap"][::std::mem::offset_of!(sysinfo, freeswap) - 36usize];
    ["Offset of field: sysinfo::procs"][::std::mem::offset_of!(sysinfo, procs) - 40usize];
    ["Offset of field: sysinfo::pad"][::std::mem::offset_of!(sysinfo, pad) - 42usize];
    ["Offset of field: sysinfo::totalhigh"][::std::mem::offset_of!(sysinfo, totalhigh) - 44usize];
    ["Offset of field: sysinfo::freehigh"][::std::mem::offset_of!(sysinfo, freehigh) - 48usize];
    ["Offset of field: sysinfo::mem_unit"][::std::mem::offset_of!(sysinfo, mem_unit) - 52usize];
    ["Offset of field: sysinfo::_f"][::std::mem::offset_of!(sysinfo, _f) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 16usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 8usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 8usize];
};
pub type z_size_t = usize;
pub type Byte = ::std::os::raw::c_uchar;
pub type uInt = ::std::os::raw::c_uint;
pub type uLong = ::std::os::raw::c_ulong;
pub type Bytef = Byte;
pub type charf = ::std::os::raw::c_char;
pub type intf = ::std::os::raw::c_int;
pub type uIntf = uInt;
pub type uLongf = uLong;
pub type voidpc = *const ::std::os::raw::c_void;
pub type voidpf = *mut ::std::os::raw::c_void;
pub type voidp = *mut ::std::os::raw::c_void;
pub type z_crc_t = ::std::os::raw::c_uint;
pub type alloc_func =
    ::std::option::Option<unsafe extern "C" fn(opaque: voidpf, items: uInt, size: uInt) -> voidpf>;
pub type free_func = ::std::option::Option<unsafe extern "C" fn(opaque: voidpf, address: voidpf)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct internal_state {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_stream_s {
    pub next_in: *mut Bytef,
    pub avail_in: uInt,
    pub total_in: uLong,
    pub next_out: *mut Bytef,
    pub avail_out: uInt,
    pub total_out: uLong,
    pub msg: *mut ::std::os::raw::c_char,
    pub state: *mut internal_state,
    pub zalloc: alloc_func,
    pub zfree: free_func,
    pub opaque: voidpf,
    pub data_type: ::std::os::raw::c_int,
    pub adler: uLong,
    pub reserved: uLong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of z_stream_s"][::std::mem::size_of::<z_stream_s>() - 56usize];
    ["Alignment of z_stream_s"][::std::mem::align_of::<z_stream_s>() - 4usize];
    ["Offset of field: z_stream_s::next_in"][::std::mem::offset_of!(z_stream_s, next_in) - 0usize];
    ["Offset of field: z_stream_s::avail_in"]
        [::std::mem::offset_of!(z_stream_s, avail_in) - 4usize];
    ["Offset of field: z_stream_s::total_in"]
        [::std::mem::offset_of!(z_stream_s, total_in) - 8usize];
    ["Offset of field: z_stream_s::next_out"]
        [::std::mem::offset_of!(z_stream_s, next_out) - 12usize];
    ["Offset of field: z_stream_s::avail_out"]
        [::std::mem::offset_of!(z_stream_s, avail_out) - 16usize];
    ["Offset of field: z_stream_s::total_out"]
        [::std::mem::offset_of!(z_stream_s, total_out) - 20usize];
    ["Offset of field: z_stream_s::msg"][::std::mem::offset_of!(z_stream_s, msg) - 24usize];
    ["Offset of field: z_stream_s::state"][::std::mem::offset_of!(z_stream_s, state) - 28usize];
    ["Offset of field: z_stream_s::zalloc"][::std::mem::offset_of!(z_stream_s, zalloc) - 32usize];
    ["Offset of field: z_stream_s::zfree"][::std::mem::offset_of!(z_stream_s, zfree) - 36usize];
    ["Offset of field: z_stream_s::opaque"][::std::mem::offset_of!(z_stream_s, opaque) - 40usize];
    ["Offset of field: z_stream_s::data_type"]
        [::std::mem::offset_of!(z_stream_s, data_type) - 44usize];
    ["Offset of field: z_stream_s::adler"][::std::mem::offset_of!(z_stream_s, adler) - 48usize];
    ["Offset of field: z_stream_s::reserved"]
        [::std::mem::offset_of!(z_stream_s, reserved) - 52usize];
};
pub type z_stream = z_stream_s;
pub type z_streamp = *mut z_stream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gz_header_s {
    pub text: ::std::os::raw::c_int,
    pub time: uLong,
    pub xflags: ::std::os::raw::c_int,
    pub os: ::std::os::raw::c_int,
    pub extra: *mut Bytef,
    pub extra_len: uInt,
    pub extra_max: uInt,
    pub name: *mut Bytef,
    pub name_max: uInt,
    pub comment: *mut Bytef,
    pub comm_max: uInt,
    pub hcrc: ::std::os::raw::c_int,
    pub done: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gz_header_s"][::std::mem::size_of::<gz_header_s>() - 52usize];
    ["Alignment of gz_header_s"][::std::mem::align_of::<gz_header_s>() - 4usize];
    ["Offset of field: gz_header_s::text"][::std::mem::offset_of!(gz_header_s, text) - 0usize];
    ["Offset of field: gz_header_s::time"][::std::mem::offset_of!(gz_header_s, time) - 4usize];
    ["Offset of field: gz_header_s::xflags"][::std::mem::offset_of!(gz_header_s, xflags) - 8usize];
    ["Offset of field: gz_header_s::os"][::std::mem::offset_of!(gz_header_s, os) - 12usize];
    ["Offset of field: gz_header_s::extra"][::std::mem::offset_of!(gz_header_s, extra) - 16usize];
    ["Offset of field: gz_header_s::extra_len"]
        [::std::mem::offset_of!(gz_header_s, extra_len) - 20usize];
    ["Offset of field: gz_header_s::extra_max"]
        [::std::mem::offset_of!(gz_header_s, extra_max) - 24usize];
    ["Offset of field: gz_header_s::name"][::std::mem::offset_of!(gz_header_s, name) - 28usize];
    ["Offset of field: gz_header_s::name_max"]
        [::std::mem::offset_of!(gz_header_s, name_max) - 32usize];
    ["Offset of field: gz_header_s::comment"]
        [::std::mem::offset_of!(gz_header_s, comment) - 36usize];
    ["Offset of field: gz_header_s::comm_max"]
        [::std::mem::offset_of!(gz_header_s, comm_max) - 40usize];
    ["Offset of field: gz_header_s::hcrc"][::std::mem::offset_of!(gz_header_s, hcrc) - 44usize];
    ["Offset of field: gz_header_s::done"][::std::mem::offset_of!(gz_header_s, done) - 48usize];
};
pub type gz_header = gz_header_s;
pub type gz_headerp = *mut gz_header;
pub type in_func = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_uint,
>;
pub type out_func = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_uchar,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type gzFile = *mut gzFile_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gzFile_s {
    pub have: ::std::os::raw::c_uint,
    pub next: *mut ::std::os::raw::c_uchar,
    pub pos: off_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gzFile_s"][::std::mem::size_of::<gzFile_s>() - 12usize];
    ["Alignment of gzFile_s"][::std::mem::align_of::<gzFile_s>() - 4usize];
    ["Offset of field: gzFile_s::have"][::std::mem::offset_of!(gzFile_s, have) - 0usize];
    ["Offset of field: gzFile_s::next"][::std::mem::offset_of!(gzFile_s, next) - 4usize];
    ["Offset of field: gzFile_s::pos"][::std::mem::offset_of!(gzFile_s, pos) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sched_param {
    pub __sched_priority: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sched_param"][::std::mem::size_of::<sched_param>() - 4usize];
    ["Alignment of sched_param"][::std::mem::align_of::<sched_param>() - 4usize];
    ["Offset of field: sched_param::__sched_priority"]
        [::std::mem::offset_of!(sched_param, __sched_priority) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sched_param {
    pub __sched_priority: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sched_param"][::std::mem::size_of::<__sched_param>() - 4usize];
    ["Alignment of __sched_param"][::std::mem::align_of::<__sched_param>() - 4usize];
    ["Offset of field: __sched_param::__sched_priority"]
        [::std::mem::offset_of!(__sched_param, __sched_priority) - 0usize];
};
pub type __cpu_mask = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_set_t"][::std::mem::size_of::<cpu_set_t>() - 128usize];
    ["Alignment of cpu_set_t"][::std::mem::align_of::<cpu_set_t>() - 4usize];
    ["Offset of field: cpu_set_t::__bits"][::std::mem::offset_of!(cpu_set_t, __bits) - 0usize];
};
pub type __jmp_buf = [::std::os::raw::c_int; 64usize];
pub const PTHREAD_CREATE_JOINABLE: _bindgen_ty_16 = 0;
pub const PTHREAD_CREATE_DETACHED: _bindgen_ty_16 = 1;
pub type _bindgen_ty_16 = ::std::os::raw::c_uint;
pub const PTHREAD_MUTEX_TIMED_NP: _bindgen_ty_17 = 0;
pub const PTHREAD_MUTEX_RECURSIVE_NP: _bindgen_ty_17 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK_NP: _bindgen_ty_17 = 2;
pub const PTHREAD_MUTEX_ADAPTIVE_NP: _bindgen_ty_17 = 3;
pub const PTHREAD_MUTEX_NORMAL: _bindgen_ty_17 = 0;
pub const PTHREAD_MUTEX_RECURSIVE: _bindgen_ty_17 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK: _bindgen_ty_17 = 2;
pub const PTHREAD_MUTEX_DEFAULT: _bindgen_ty_17 = 0;
pub type _bindgen_ty_17 = ::std::os::raw::c_uint;
pub const PTHREAD_MUTEX_STALLED: _bindgen_ty_18 = 0;
pub const PTHREAD_MUTEX_STALLED_NP: _bindgen_ty_18 = 0;
pub const PTHREAD_MUTEX_ROBUST: _bindgen_ty_18 = 1;
pub const PTHREAD_MUTEX_ROBUST_NP: _bindgen_ty_18 = 1;
pub type _bindgen_ty_18 = ::std::os::raw::c_uint;
pub const PTHREAD_PRIO_NONE: _bindgen_ty_19 = 0;
pub const PTHREAD_PRIO_INHERIT: _bindgen_ty_19 = 1;
pub const PTHREAD_PRIO_PROTECT: _bindgen_ty_19 = 2;
pub type _bindgen_ty_19 = ::std::os::raw::c_uint;
pub const PTHREAD_RWLOCK_PREFER_READER_NP: _bindgen_ty_20 = 0;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NP: _bindgen_ty_20 = 1;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP: _bindgen_ty_20 = 2;
pub const PTHREAD_RWLOCK_DEFAULT_NP: _bindgen_ty_20 = 0;
pub type _bindgen_ty_20 = ::std::os::raw::c_uint;
pub const PTHREAD_INHERIT_SCHED: _bindgen_ty_21 = 0;
pub const PTHREAD_EXPLICIT_SCHED: _bindgen_ty_21 = 1;
pub type _bindgen_ty_21 = ::std::os::raw::c_uint;
pub const PTHREAD_SCOPE_SYSTEM: _bindgen_ty_22 = 0;
pub const PTHREAD_SCOPE_PROCESS: _bindgen_ty_22 = 1;
pub type _bindgen_ty_22 = ::std::os::raw::c_uint;
pub const PTHREAD_PROCESS_PRIVATE: _bindgen_ty_23 = 0;
pub const PTHREAD_PROCESS_SHARED: _bindgen_ty_23 = 1;
pub type _bindgen_ty_23 = ::std::os::raw::c_uint;
pub const PTHREAD_CANCEL_ENABLE: _bindgen_ty_24 = 0;
pub const PTHREAD_CANCEL_DISABLE: _bindgen_ty_24 = 1;
pub type _bindgen_ty_24 = ::std::os::raw::c_uint;
pub const PTHREAD_CANCEL_DEFERRED: _bindgen_ty_25 = 0;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: _bindgen_ty_25 = 1;
pub type _bindgen_ty_25 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_tag {
    _unused: [u8; 0],
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct winsize {
    pub ws_row: ::std::os::raw::c_ushort,
    pub ws_col: ::std::os::raw::c_ushort,
    pub ws_xpixel: ::std::os::raw::c_ushort,
    pub ws_ypixel: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of winsize"][::std::mem::size_of::<winsize>() - 8usize];
    ["Alignment of winsize"][::std::mem::align_of::<winsize>() - 2usize];
    ["Offset of field: winsize::ws_row"][::std::mem::offset_of!(winsize, ws_row) - 0usize];
    ["Offset of field: winsize::ws_col"][::std::mem::offset_of!(winsize, ws_col) - 2usize];
    ["Offset of field: winsize::ws_xpixel"][::std::mem::offset_of!(winsize, ws_xpixel) - 4usize];
    ["Offset of field: winsize::ws_ypixel"][::std::mem::offset_of!(winsize, ws_ypixel) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct termio {
    pub c_iflag: ::std::os::raw::c_ushort,
    pub c_oflag: ::std::os::raw::c_ushort,
    pub c_cflag: ::std::os::raw::c_ushort,
    pub c_lflag: ::std::os::raw::c_ushort,
    pub c_line: ::std::os::raw::c_uchar,
    pub c_cc: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of termio"][::std::mem::size_of::<termio>() - 18usize];
    ["Alignment of termio"][::std::mem::align_of::<termio>() - 2usize];
    ["Offset of field: termio::c_iflag"][::std::mem::offset_of!(termio, c_iflag) - 0usize];
    ["Offset of field: termio::c_oflag"][::std::mem::offset_of!(termio, c_oflag) - 2usize];
    ["Offset of field: termio::c_cflag"][::std::mem::offset_of!(termio, c_cflag) - 4usize];
    ["Offset of field: termio::c_lflag"][::std::mem::offset_of!(termio, c_lflag) - 6usize];
    ["Offset of field: termio::c_line"][::std::mem::offset_of!(termio, c_line) - 8usize];
    ["Offset of field: termio::c_cc"][::std::mem::offset_of!(termio, c_cc) - 9usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct input_event {
    pub time: timeval,
    pub type_: __u16,
    pub code: __u16,
    pub value: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of input_event"][::std::mem::size_of::<input_event>() - 16usize];
    ["Alignment of input_event"][::std::mem::align_of::<input_event>() - 4usize];
    ["Offset of field: input_event::time"][::std::mem::offset_of!(input_event, time) - 0usize];
    ["Offset of field: input_event::type_"][::std::mem::offset_of!(input_event, type_) - 8usize];
    ["Offset of field: input_event::code"][::std::mem::offset_of!(input_event, code) - 10usize];
    ["Offset of field: input_event::value"][::std::mem::offset_of!(input_event, value) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct input_id {
    pub bustype: __u16,
    pub vendor: __u16,
    pub product: __u16,
    pub version: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of input_id"][::std::mem::size_of::<input_id>() - 8usize];
    ["Alignment of input_id"][::std::mem::align_of::<input_id>() - 2usize];
    ["Offset of field: input_id::bustype"][::std::mem::offset_of!(input_id, bustype) - 0usize];
    ["Offset of field: input_id::vendor"][::std::mem::offset_of!(input_id, vendor) - 2usize];
    ["Offset of field: input_id::product"][::std::mem::offset_of!(input_id, product) - 4usize];
    ["Offset of field: input_id::version"][::std::mem::offset_of!(input_id, version) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct input_absinfo {
    pub value: __s32,
    pub minimum: __s32,
    pub maximum: __s32,
    pub fuzz: __s32,
    pub flat: __s32,
    pub resolution: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of input_absinfo"][::std::mem::size_of::<input_absinfo>() - 24usize];
    ["Alignment of input_absinfo"][::std::mem::align_of::<input_absinfo>() - 4usize];
    ["Offset of field: input_absinfo::value"]
        [::std::mem::offset_of!(input_absinfo, value) - 0usize];
    ["Offset of field: input_absinfo::minimum"]
        [::std::mem::offset_of!(input_absinfo, minimum) - 4usize];
    ["Offset of field: input_absinfo::maximum"]
        [::std::mem::offset_of!(input_absinfo, maximum) - 8usize];
    ["Offset of field: input_absinfo::fuzz"][::std::mem::offset_of!(input_absinfo, fuzz) - 12usize];
    ["Offset of field: input_absinfo::flat"][::std::mem::offset_of!(input_absinfo, flat) - 16usize];
    ["Offset of field: input_absinfo::resolution"]
        [::std::mem::offset_of!(input_absinfo, resolution) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct input_keymap_entry {
    pub flags: __u8,
    pub len: __u8,
    pub index: __u16,
    pub keycode: __u32,
    pub scancode: [__u8; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of input_keymap_entry"][::std::mem::size_of::<input_keymap_entry>() - 40usize];
    ["Alignment of input_keymap_entry"][::std::mem::align_of::<input_keymap_entry>() - 4usize];
    ["Offset of field: input_keymap_entry::flags"]
        [::std::mem::offset_of!(input_keymap_entry, flags) - 0usize];
    ["Offset of field: input_keymap_entry::len"]
        [::std::mem::offset_of!(input_keymap_entry, len) - 1usize];
    ["Offset of field: input_keymap_entry::index"]
        [::std::mem::offset_of!(input_keymap_entry, index) - 2usize];
    ["Offset of field: input_keymap_entry::keycode"]
        [::std::mem::offset_of!(input_keymap_entry, keycode) - 4usize];
    ["Offset of field: input_keymap_entry::scancode"]
        [::std::mem::offset_of!(input_keymap_entry, scancode) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct input_mask {
    pub type_: __u32,
    pub codes_size: __u32,
    pub codes_ptr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of input_mask"][::std::mem::size_of::<input_mask>() - 16usize];
    ["Alignment of input_mask"][::std::mem::align_of::<input_mask>() - 8usize];
    ["Offset of field: input_mask::type_"][::std::mem::offset_of!(input_mask, type_) - 0usize];
    ["Offset of field: input_mask::codes_size"]
        [::std::mem::offset_of!(input_mask, codes_size) - 4usize];
    ["Offset of field: input_mask::codes_ptr"]
        [::std::mem::offset_of!(input_mask, codes_ptr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ff_replay {
    pub length: __u16,
    pub delay: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ff_replay"][::std::mem::size_of::<ff_replay>() - 4usize];
    ["Alignment of ff_replay"][::std::mem::align_of::<ff_replay>() - 2usize];
    ["Offset of field: ff_replay::length"][::std::mem::offset_of!(ff_replay, length) - 0usize];
    ["Offset of field: ff_replay::delay"][::std::mem::offset_of!(ff_replay, delay) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ff_trigger {
    pub button: __u16,
    pub interval: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ff_trigger"][::std::mem::size_of::<ff_trigger>() - 4usize];
    ["Alignment of ff_trigger"][::std::mem::align_of::<ff_trigger>() - 2usize];
    ["Offset of field: ff_trigger::button"][::std::mem::offset_of!(ff_trigger, button) - 0usize];
    ["Offset of field: ff_trigger::interval"]
        [::std::mem::offset_of!(ff_trigger, interval) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ff_envelope {
    pub attack_length: __u16,
    pub attack_level: __u16,
    pub fade_length: __u16,
    pub fade_level: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ff_envelope"][::std::mem::size_of::<ff_envelope>() - 8usize];
    ["Alignment of ff_envelope"][::std::mem::align_of::<ff_envelope>() - 2usize];
    ["Offset of field: ff_envelope::attack_length"]
        [::std::mem::offset_of!(ff_envelope, attack_length) - 0usize];
    ["Offset of field: ff_envelope::attack_level"]
        [::std::mem::offset_of!(ff_envelope, attack_level) - 2usize];
    ["Offset of field: ff_envelope::fade_length"]
        [::std::mem::offset_of!(ff_envelope, fade_length) - 4usize];
    ["Offset of field: ff_envelope::fade_level"]
        [::std::mem::offset_of!(ff_envelope, fade_level) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ff_constant_effect {
    pub level: __s16,
    pub envelope: ff_envelope,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ff_constant_effect"][::std::mem::size_of::<ff_constant_effect>() - 10usize];
    ["Alignment of ff_constant_effect"][::std::mem::align_of::<ff_constant_effect>() - 2usize];
    ["Offset of field: ff_constant_effect::level"]
        [::std::mem::offset_of!(ff_constant_effect, level) - 0usize];
    ["Offset of field: ff_constant_effect::envelope"]
        [::std::mem::offset_of!(ff_constant_effect, envelope) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ff_ramp_effect {
    pub start_level: __s16,
    pub end_level: __s16,
    pub envelope: ff_envelope,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ff_ramp_effect"][::std::mem::size_of::<ff_ramp_effect>() - 12usize];
    ["Alignment of ff_ramp_effect"][::std::mem::align_of::<ff_ramp_effect>() - 2usize];
    ["Offset of field: ff_ramp_effect::start_level"]
        [::std::mem::offset_of!(ff_ramp_effect, start_level) - 0usize];
    ["Offset of field: ff_ramp_effect::end_level"]
        [::std::mem::offset_of!(ff_ramp_effect, end_level) - 2usize];
    ["Offset of field: ff_ramp_effect::envelope"]
        [::std::mem::offset_of!(ff_ramp_effect, envelope) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ff_condition_effect {
    pub right_saturation: __u16,
    pub left_saturation: __u16,
    pub right_coeff: __s16,
    pub left_coeff: __s16,
    pub deadband: __u16,
    pub center: __s16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ff_condition_effect"][::std::mem::size_of::<ff_condition_effect>() - 12usize];
    ["Alignment of ff_condition_effect"][::std::mem::align_of::<ff_condition_effect>() - 2usize];
    ["Offset of field: ff_condition_effect::right_saturation"]
        [::std::mem::offset_of!(ff_condition_effect, right_saturation) - 0usize];
    ["Offset of field: ff_condition_effect::left_saturation"]
        [::std::mem::offset_of!(ff_condition_effect, left_saturation) - 2usize];
    ["Offset of field: ff_condition_effect::right_coeff"]
        [::std::mem::offset_of!(ff_condition_effect, right_coeff) - 4usize];
    ["Offset of field: ff_condition_effect::left_coeff"]
        [::std::mem::offset_of!(ff_condition_effect, left_coeff) - 6usize];
    ["Offset of field: ff_condition_effect::deadband"]
        [::std::mem::offset_of!(ff_condition_effect, deadband) - 8usize];
    ["Offset of field: ff_condition_effect::center"]
        [::std::mem::offset_of!(ff_condition_effect, center) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ff_periodic_effect {
    pub waveform: __u16,
    pub period: __u16,
    pub magnitude: __s16,
    pub offset: __s16,
    pub phase: __u16,
    pub envelope: ff_envelope,
    pub custom_len: __u32,
    pub custom_data: *mut __s16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ff_periodic_effect"][::std::mem::size_of::<ff_periodic_effect>() - 28usize];
    ["Alignment of ff_periodic_effect"][::std::mem::align_of::<ff_periodic_effect>() - 4usize];
    ["Offset of field: ff_periodic_effect::waveform"]
        [::std::mem::offset_of!(ff_periodic_effect, waveform) - 0usize];
    ["Offset of field: ff_periodic_effect::period"]
        [::std::mem::offset_of!(ff_periodic_effect, period) - 2usize];
    ["Offset of field: ff_periodic_effect::magnitude"]
        [::std::mem::offset_of!(ff_periodic_effect, magnitude) - 4usize];
    ["Offset of field: ff_periodic_effect::offset"]
        [::std::mem::offset_of!(ff_periodic_effect, offset) - 6usize];
    ["Offset of field: ff_periodic_effect::phase"]
        [::std::mem::offset_of!(ff_periodic_effect, phase) - 8usize];
    ["Offset of field: ff_periodic_effect::envelope"]
        [::std::mem::offset_of!(ff_periodic_effect, envelope) - 10usize];
    ["Offset of field: ff_periodic_effect::custom_len"]
        [::std::mem::offset_of!(ff_periodic_effect, custom_len) - 20usize];
    ["Offset of field: ff_periodic_effect::custom_data"]
        [::std::mem::offset_of!(ff_periodic_effect, custom_data) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ff_rumble_effect {
    pub strong_magnitude: __u16,
    pub weak_magnitude: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ff_rumble_effect"][::std::mem::size_of::<ff_rumble_effect>() - 4usize];
    ["Alignment of ff_rumble_effect"][::std::mem::align_of::<ff_rumble_effect>() - 2usize];
    ["Offset of field: ff_rumble_effect::strong_magnitude"]
        [::std::mem::offset_of!(ff_rumble_effect, strong_magnitude) - 0usize];
    ["Offset of field: ff_rumble_effect::weak_magnitude"]
        [::std::mem::offset_of!(ff_rumble_effect, weak_magnitude) - 2usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ff_effect {
    pub type_: __u16,
    pub id: __s16,
    pub direction: __u16,
    pub trigger: ff_trigger,
    pub replay: ff_replay,
    pub u: ff_effect__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ff_effect__bindgen_ty_1 {
    pub constant: ff_constant_effect,
    pub ramp: ff_ramp_effect,
    pub periodic: ff_periodic_effect,
    pub condition: [ff_condition_effect; 2usize],
    pub rumble: ff_rumble_effect,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ff_effect__bindgen_ty_1"][::std::mem::size_of::<ff_effect__bindgen_ty_1>() - 28usize];
    ["Alignment of ff_effect__bindgen_ty_1"]
        [::std::mem::align_of::<ff_effect__bindgen_ty_1>() - 4usize];
    ["Offset of field: ff_effect__bindgen_ty_1::constant"]
        [::std::mem::offset_of!(ff_effect__bindgen_ty_1, constant) - 0usize];
    ["Offset of field: ff_effect__bindgen_ty_1::ramp"]
        [::std::mem::offset_of!(ff_effect__bindgen_ty_1, ramp) - 0usize];
    ["Offset of field: ff_effect__bindgen_ty_1::periodic"]
        [::std::mem::offset_of!(ff_effect__bindgen_ty_1, periodic) - 0usize];
    ["Offset of field: ff_effect__bindgen_ty_1::condition"]
        [::std::mem::offset_of!(ff_effect__bindgen_ty_1, condition) - 0usize];
    ["Offset of field: ff_effect__bindgen_ty_1::rumble"]
        [::std::mem::offset_of!(ff_effect__bindgen_ty_1, rumble) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ff_effect"][::std::mem::size_of::<ff_effect>() - 44usize];
    ["Alignment of ff_effect"][::std::mem::align_of::<ff_effect>() - 4usize];
    ["Offset of field: ff_effect::type_"][::std::mem::offset_of!(ff_effect, type_) - 0usize];
    ["Offset of field: ff_effect::id"][::std::mem::offset_of!(ff_effect, id) - 2usize];
    ["Offset of field: ff_effect::direction"]
        [::std::mem::offset_of!(ff_effect, direction) - 4usize];
    ["Offset of field: ff_effect::trigger"][::std::mem::offset_of!(ff_effect, trigger) - 6usize];
    ["Offset of field: ff_effect::replay"][::std::mem::offset_of!(ff_effect, replay) - 10usize];
    ["Offset of field: ff_effect::u"][::std::mem::offset_of!(ff_effect, u) - 16usize];
};
pub const platform_id_t_PLATFORM_WRONG: platform_id_t = 0;
pub const platform_id_t_PLATFORM_MX6SL: platform_id_t = 5;
pub const platform_id_t_PLATFORM_A13: platform_id_t = 14;
pub const platform_id_t_PLATFORM_B288: platform_id_t = 16;
pub const platform_id_t_PLATFORM_B300: platform_id_t = 17;
pub type platform_id_t = ::std::os::raw::c_uint;
pub const device_id_t_DEVICE_WRONG: device_id_t = 0;
pub const device_id_t_DEVICE_631: device_id_t = 5;
pub const device_id_t_DEVICE_641: device_id_t = 17;
pub const device_id_t_DEVICE_627: device_id_t = 18;
pub const device_id_t_DEVICE_614: device_id_t = 19;
pub const device_id_t_DEVICE_615: device_id_t = 20;
pub const device_id_t_DEVICE_740: device_id_t = 21;
pub const device_id_t_DEVICE_616: device_id_t = 22;
pub const device_id_t_DEVICE_632: device_id_t = 23;
pub const device_id_t_DEVICE_626: device_id_t = 24;
pub const device_id_t_DEVICE_840: device_id_t = 25;
pub const device_id_t_DEVICE_840_2: device_id_t = 26;
pub const device_id_t_DEVICE_740_2: device_id_t = 27;
pub const device_id_t_DEVICE_1040: device_id_t = 28;
pub const device_id_t_DEVICE_606: device_id_t = 29;
pub const device_id_t_DEVICE_633: device_id_t = 30;
pub const device_id_t_DEVICE_628: device_id_t = 31;
pub const device_id_t_DEVICE_741: device_id_t = 32;
pub const device_id_t_DEVICE_617: device_id_t = 33;
pub const device_id_t_DEVICE_970: device_id_t = 34;
pub const device_id_t_DEVICE_700: device_id_t = 35;
pub const device_id_t_DEVICE_743c: device_id_t = 36;
pub const device_id_t_DEVICE_743g: device_id_t = 37;
pub const device_id_t_DEVICE_802: device_id_t = 38;
pub const device_id_t_DEVICE_618: device_id_t = 39;
pub const device_id_t_DEVICE_634: device_id_t = 40;
pub const device_id_t_DEVICE_629: device_id_t = 41;
pub type device_id_t = ::std::os::raw::c_uint;
pub const display_id_t_DISPLAY_6INCH: display_id_t = 0;
pub const display_id_t_DISPLAY_5INCH: display_id_t = 1;
pub const display_id_t_DISPLAY_8INCH: display_id_t = 2;
pub const display_id_t_DISPLAY_9INCH: display_id_t = 3;
pub const display_id_t_DISPLAY_6INCH_758: display_id_t = 4;
pub const display_id_t_DISPLAY_8TRITON: display_id_t = 5;
pub const display_id_t_DISPLAY_8INCH_1200: display_id_t = 6;
pub const display_id_t_DISPLAY_4INCH_480_800: display_id_t = 8;
pub const display_id_t_DISPLAY_6INCH_1072_1448: display_id_t = 9;
pub const display_id_t_DISPLAY_7INCH_1872_1404: display_id_t = 10;
pub const display_id_t_DISPLAY_10INCH_1872_1404: display_id_t = 11;
pub const display_id_t_DISPLAY_9INCH_1200_825: display_id_t = 12;
pub const display_id_t_DISPLAY_7INCH_1264_1680: display_id_t = 13;
pub const display_id_t_DISPLAY_8INCH_1920_1440: display_id_t = 14;
pub type display_id_t = ::std::os::raw::c_uint;
pub const epdc_id_t_EPDC_NONE: epdc_id_t = 0;
pub const epdc_id_t_EPDC_IMX: epdc_id_t = 3;
pub const epdc_id_t_EPDC_ALLWINNER_A13: epdc_id_t = 5;
pub const epdc_id_t_EPDC_ALLWINNER_B288: epdc_id_t = 6;
pub const epdc_id_t_EPDC_ALLWINNER_B300: epdc_id_t = 7;
pub const epdc_id_t_EPDC_T1000: epdc_id_t = 8;
pub type epdc_id_t = ::std::os::raw::c_uint;
pub const colormask_t_COLORMASK_NONE: colormask_t = 0;
pub const colormask_t_COLORMASK_CFA: colormask_t = 1;
pub const colormask_t_COLORMASK_CFA2: colormask_t = 2;
pub const colormask_t_COLORMASK_ACEP: colormask_t = 3;
pub type colormask_t = ::std::os::raw::c_uint;
pub const native_orientation_t_NATIVE_LANDSCAPE: native_orientation_t = 0;
pub const native_orientation_t_NATIVE_PORTRAIT: native_orientation_t = 1;
pub type native_orientation_t = ::std::os::raw::c_uint;
pub const keyboard_id_t_KEYBOARD_NTX600: keyboard_id_t = 0;
pub const keyboard_id_t_KEYBOARD_POCKET360: keyboard_id_t = 1;
pub const keyboard_id_t_KEYBOARD_COOKIE: keyboard_id_t = 2;
pub const keyboard_id_t_KEYBOARD_DIGITEKA: keyboard_id_t = 3;
pub const keyboard_id_t_KEYBOARD_EP1234: keyboard_id_t = 4;
pub const keyboard_id_t_KEYBOARD_EP7: keyboard_id_t = 5;
pub const keyboard_id_t_KEYBOARD_POCKET650: keyboard_id_t = 6;
pub const keyboard_id_t_KEYBOARD_POCKET840: keyboard_id_t = 7;
pub const keyboard_id_t_KEYBOARD_POCKET630: keyboard_id_t = 8;
pub const keyboard_id_t_KEYBOARD_POCKET420: keyboard_id_t = 9;
pub const keyboard_id_t_KEYBOARD_POCKET620: keyboard_id_t = 10;
pub const keyboard_id_t_KEYBOARD_POCKET641: keyboard_id_t = 11;
pub const keyboard_id_t_KEYBOARD_POCKET627: keyboard_id_t = 12;
pub const keyboard_id_t_KEYBOARD_POCKET611: keyboard_id_t = 14;
pub const keyboard_id_t_KEYBOARD_POCKET613: keyboard_id_t = 15;
pub const keyboard_id_t_KEYBOARD_POCKET515: keyboard_id_t = 16;
pub const keyboard_id_t_KEYBOARD_POCKET624: keyboard_id_t = 17;
pub const keyboard_id_t_KEYBOARD_POCKET631: keyboard_id_t = 18;
pub const keyboard_id_t_KEYBOARD_POCKET740: keyboard_id_t = 19;
pub const keyboard_id_t_KEYBOARD_POCKET616: keyboard_id_t = 20;
pub const keyboard_id_t_KEYBOARD_POCKET632: keyboard_id_t = 21;
pub const keyboard_id_t_KEYBOARD_POCKET1040: keyboard_id_t = 22;
pub const keyboard_id_t_KEYBOARD_POCKET970: keyboard_id_t = 23;
pub const keyboard_id_t_KEYBOARD_POCKET617: keyboard_id_t = 24;
pub const keyboard_id_t_KEYBOARD_POCKET700: keyboard_id_t = 25;
pub const keyboard_id_t_KEYBOARD_POCKET743: keyboard_id_t = 26;
pub const keyboard_id_t_KEYBOARD_POCKET618: keyboard_id_t = 27;
pub const keyboard_id_t_KEYBOARD_POCKET634: keyboard_id_t = 28;
pub const keyboard_id_t_KEYBOARD_POCKET629: keyboard_id_t = 29;
pub type keyboard_id_t = ::std::os::raw::c_uint;
pub const touchpanel_id_t_TOUCHPANEL_NONE: touchpanel_id_t = 0;
pub const touchpanel_id_t_TOUCHPANEL_IR_zFORCE: touchpanel_id_t = 4;
pub const touchpanel_id_t_TOUCHPANEL_ELAN_eKTF2227: touchpanel_id_t = 8;
pub const touchpanel_id_t_TOUCHPANEL_FT5X_840: touchpanel_id_t = 9;
pub const touchpanel_id_t_TOUCHPANEL_ELAN_eKTF2232: touchpanel_id_t = 16;
pub const touchpanel_id_t_TOUCHPANEL_TT21XXX: touchpanel_id_t = 17;
pub const touchpanel_id_t_TOUCHPANEL_FT5X: touchpanel_id_t = 18;
pub const touchpanel_id_t_TOUCHPANEL_CYTTSP4: touchpanel_id_t = 19;
pub const touchpanel_id_t_TOUCHPANEL_TMA448: touchpanel_id_t = 20;
pub const touchpanel_id_t_TOUCHPANEL_TT41701: touchpanel_id_t = 21;
pub const touchpanel_id_t_TOUCHPANEL_ELAN_eKTF2232ALW: touchpanel_id_t = 22;
pub const touchpanel_id_t_TOUCHPANEL_FT6336U: touchpanel_id_t = 23;
pub const touchpanel_id_t_TOUCHPANEL_FT5726: touchpanel_id_t = 24;
pub const touchpanel_id_t_TOUCHPANEL_FT5426: touchpanel_id_t = 25;
pub const touchpanel_id_t_TOUCHPANEL_eKTH3908F: touchpanel_id_t = 26;
pub const touchpanel_id_t_TOUCHPANEL_FT5436: touchpanel_id_t = 27;
pub const touchpanel_id_t_TOUCHPANEL_FT5536: touchpanel_id_t = 28;
pub type touchpanel_id_t = ::std::os::raw::c_uint;
pub const slider_id_t_SLIDER_NONE: slider_id_t = 0;
pub const slider_id_t_SLIDER_HWEVT: slider_id_t = 1;
pub type slider_id_t = ::std::os::raw::c_uint;
pub const gyroscop_id_t_GYROSCOPE_NONE: gyroscop_id_t = 0;
pub const gyroscop_id_t_GYROSCOPE_HWEVT: gyroscop_id_t = 10;
pub type gyroscop_id_t = ::std::os::raw::c_uint;
pub const audio_e_AUDIO_NONE: audio_e = 0;
pub const audio_e_AUDIO_OSS: audio_e = 1;
pub const audio_e_AUDIO_ALSA_NO_HP_DETECTION: audio_e = 3;
pub const audio_e_AUDIO_ALSA: audio_e = 4;
pub const audio_e_AUDIO_ALOOP: audio_e = 5;
pub const audio_e_AUDIO_ALOOP_WITH_SPEAKER: audio_e = 6;
pub type audio_e = ::std::os::raw::c_uint;
pub use self::audio_e as audio_id_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hp_detect_cfg_s {
    pub path: *const ::std::os::raw::c_char,
    pub attach_phrase: *const ::std::os::raw::c_char,
    pub inverted: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hp_detect_cfg_s"][::std::mem::size_of::<hp_detect_cfg_s>() - 12usize];
    ["Alignment of hp_detect_cfg_s"][::std::mem::align_of::<hp_detect_cfg_s>() - 4usize];
    ["Offset of field: hp_detect_cfg_s::path"]
        [::std::mem::offset_of!(hp_detect_cfg_s, path) - 0usize];
    ["Offset of field: hp_detect_cfg_s::attach_phrase"]
        [::std::mem::offset_of!(hp_detect_cfg_s, attach_phrase) - 4usize];
    ["Offset of field: hp_detect_cfg_s::inverted"]
        [::std::mem::offset_of!(hp_detect_cfg_s, inverted) - 8usize];
};
pub type hp_detect_cfg_t = hp_detect_cfg_s;
pub const usb_id_t_USB_NONE: usb_id_t = 0;
pub const usb_id_t_USB_INTERNAL: usb_id_t = 3;
pub type usb_id_t = ::std::os::raw::c_uint;
pub const frontlight_id_t_FRONTLIGHT_NONE: frontlight_id_t = 0;
pub const frontlight_id_t_FRONTLIGHT_PWM: frontlight_id_t = 1;
pub const frontlight_id_t_FRONTLIGHT_DUAL: frontlight_id_t = 2;
pub const frontlight_id_t_FRONTLIGHT_SINGLE: frontlight_id_t = 3;
pub const frontlight_id_t_FRONTLIGHT_DUAL_HW_DIMMING: frontlight_id_t = 4;
pub const frontlight_id_t_FRONTLIGHT_SINGLE_HW_DIMMING: frontlight_id_t = 5;
pub type frontlight_id_t = ::std::os::raw::c_uint;
pub const lightsensor_id_t_LIGHTSENSOR_NONE: lightsensor_id_t = 0;
pub type lightsensor_id_t = ::std::os::raw::c_uint;
pub const bluetooth_id_t_BLUETOOTH_NONE: bluetooth_id_t = 0;
pub const bluetooth_id_t_BLUETOOTH_RTL8761: bluetooth_id_t = 6;
pub const bluetooth_id_t_BLUETOOTH_AW869A: bluetooth_id_t = 7;
pub type bluetooth_id_t = ::std::os::raw::c_uint;
pub const wifi_id_t_WIFI_NONE: wifi_id_t = 0;
pub const wifi_id_t_WIFI_RTL8188EU: wifi_id_t = 8;
pub const wifi_id_t_WIFI_RTL8189FS: wifi_id_t = 11;
pub const wifi_id_t_WIFI_XRADIO: wifi_id_t = 12;
pub const wifi_id_t_WIFI_AW869A: wifi_id_t = 13;
pub type wifi_id_t = ::std::os::raw::c_uint;
pub const gsm_id_t_GSM_NONE: gsm_id_t = 0;
pub type gsm_id_t = ::std::os::raw::c_uint;
pub const waveform_type_t_WAVEFORM_INIT: waveform_type_t = 0;
pub const waveform_type_t_WAVEFORM_DU: waveform_type_t = 1;
pub const waveform_type_t_WAVEFORM_GC16: waveform_type_t = 2;
pub const waveform_type_t_WAVEFORM_GC4: waveform_type_t = 3;
pub const waveform_type_t_WAVEFORM_A2: waveform_type_t = 4;
pub const waveform_type_t_WAVEFORM_GL16: waveform_type_t = 5;
pub const waveform_type_t_WAVEFORM_A2IN: waveform_type_t = 6;
pub const waveform_type_t_WAVEFORM_A2OUT: waveform_type_t = 7;
pub const waveform_type_t_WAVEFORM_DU4: waveform_type_t = 8;
pub const waveform_type_t_WAVEFORM_GCC16: waveform_type_t = 9;
pub type waveform_type_t = ::std::os::raw::c_uint;
pub const conv_flags_t_CONVERT_SATURATE: conv_flags_t = 1;
pub const conv_flags_t_CONVERT_DITHER: conv_flags_t = 256;
pub const conv_flags_t_CONVERT_PURE: conv_flags_t = 512;
pub const conv_flags_t_CONVERT_INVERSION: conv_flags_t = 1024;
pub type conv_flags_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct epdc_img_t {
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub scanline: ::std::os::raw::c_int,
    pub depth: ::std::os::raw::c_int,
    pub orientation: ::std::os::raw::c_int,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of epdc_img_t"][::std::mem::size_of::<epdc_img_t>() - 24usize];
    ["Alignment of epdc_img_t"][::std::mem::align_of::<epdc_img_t>() - 4usize];
    ["Offset of field: epdc_img_t::width"][::std::mem::offset_of!(epdc_img_t, width) - 0usize];
    ["Offset of field: epdc_img_t::height"][::std::mem::offset_of!(epdc_img_t, height) - 4usize];
    ["Offset of field: epdc_img_t::scanline"]
        [::std::mem::offset_of!(epdc_img_t, scanline) - 8usize];
    ["Offset of field: epdc_img_t::depth"][::std::mem::offset_of!(epdc_img_t, depth) - 12usize];
    ["Offset of field: epdc_img_t::orientation"]
        [::std::mem::offset_of!(epdc_img_t, orientation) - 16usize];
    ["Offset of field: epdc_img_t::data"][::std::mem::offset_of!(epdc_img_t, data) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct epdc_instance_t {
    pub version: ::std::os::raw::c_int,
    pub type_: ::std::os::raw::c_int,
    pub alignment: ::std::os::raw::c_int,
    pub fd: ::std::os::raw::c_int,
    pub framebuffer: *mut u8,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub scanline: ::std::os::raw::c_int,
    pub orientation: ::std::os::raw::c_int,
    pub memsize: u32,
    pub rotate: ::std::option::Option<unsafe extern "C" fn(value: ::std::os::raw::c_int)>,
    pub update: ::std::option::Option<
        unsafe extern "C" fn(
            x: ::std::os::raw::c_int,
            y: ::std::os::raw::c_int,
            w: ::std::os::raw::c_int,
            h: ::std::os::raw::c_int,
            wf: ::std::os::raw::c_int,
            mode: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub busy: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub getwftimes: ::std::option::Option<unsafe extern "C" fn(result: *mut u16)>,
    pub sync: ::std::option::Option<unsafe extern "C" fn()>,
    pub lock: ::std::option::Option<unsafe extern "C" fn()>,
    pub unlock: ::std::option::Option<unsafe extern "C" fn()>,
    pub copy: ::std::option::Option<
        unsafe extern "C" fn(
            img: *mut epdc_img_t,
            x: ::std::os::raw::c_int,
            y: ::std::os::raw::c_int,
            w: ::std::os::raw::c_int,
            h: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub convert: ::std::option::Option<
        unsafe extern "C" fn(
            src: *mut epdc_img_t,
            srcx: ::std::os::raw::c_int,
            srcy: ::std::os::raw::c_int,
            w: ::std::os::raw::c_int,
            h: ::std::os::raw::c_int,
            dest: *mut epdc_img_t,
            dstx: ::std::os::raw::c_int,
            dsty: ::std::os::raw::c_int,
            flags: u32,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of epdc_instance_t"][::std::mem::size_of::<epdc_instance_t>() - 76usize];
    ["Alignment of epdc_instance_t"][::std::mem::align_of::<epdc_instance_t>() - 4usize];
    ["Offset of field: epdc_instance_t::version"]
        [::std::mem::offset_of!(epdc_instance_t, version) - 0usize];
    ["Offset of field: epdc_instance_t::type_"]
        [::std::mem::offset_of!(epdc_instance_t, type_) - 4usize];
    ["Offset of field: epdc_instance_t::alignment"]
        [::std::mem::offset_of!(epdc_instance_t, alignment) - 8usize];
    ["Offset of field: epdc_instance_t::fd"][::std::mem::offset_of!(epdc_instance_t, fd) - 12usize];
    ["Offset of field: epdc_instance_t::framebuffer"]
        [::std::mem::offset_of!(epdc_instance_t, framebuffer) - 16usize];
    ["Offset of field: epdc_instance_t::width"]
        [::std::mem::offset_of!(epdc_instance_t, width) - 20usize];
    ["Offset of field: epdc_instance_t::height"]
        [::std::mem::offset_of!(epdc_instance_t, height) - 24usize];
    ["Offset of field: epdc_instance_t::scanline"]
        [::std::mem::offset_of!(epdc_instance_t, scanline) - 28usize];
    ["Offset of field: epdc_instance_t::orientation"]
        [::std::mem::offset_of!(epdc_instance_t, orientation) - 32usize];
    ["Offset of field: epdc_instance_t::memsize"]
        [::std::mem::offset_of!(epdc_instance_t, memsize) - 36usize];
    ["Offset of field: epdc_instance_t::rotate"]
        [::std::mem::offset_of!(epdc_instance_t, rotate) - 40usize];
    ["Offset of field: epdc_instance_t::update"]
        [::std::mem::offset_of!(epdc_instance_t, update) - 44usize];
    ["Offset of field: epdc_instance_t::busy"]
        [::std::mem::offset_of!(epdc_instance_t, busy) - 48usize];
    ["Offset of field: epdc_instance_t::getwftimes"]
        [::std::mem::offset_of!(epdc_instance_t, getwftimes) - 52usize];
    ["Offset of field: epdc_instance_t::sync"]
        [::std::mem::offset_of!(epdc_instance_t, sync) - 56usize];
    ["Offset of field: epdc_instance_t::lock"]
        [::std::mem::offset_of!(epdc_instance_t, lock) - 60usize];
    ["Offset of field: epdc_instance_t::unlock"]
        [::std::mem::offset_of!(epdc_instance_t, unlock) - 64usize];
    ["Offset of field: epdc_instance_t::copy"]
        [::std::mem::offset_of!(epdc_instance_t, copy) - 68usize];
    ["Offset of field: epdc_instance_t::convert"]
        [::std::mem::offset_of!(epdc_instance_t, convert) - 72usize];
};
pub const hwkey_t_HWKEY_BACK: hwkey_t = 1;
pub const hwkey_t_HWKEY_DELETE: hwkey_t = 2;
pub const hwkey_t_HWKEY_LEFT: hwkey_t = 4;
pub const hwkey_t_HWKEY_MENU: hwkey_t = 8;
pub const hwkey_t_HWKEY_MUSIC: hwkey_t = 16;
pub const hwkey_t_HWKEY_OK: hwkey_t = 32;
pub const hwkey_t_HWKEY_RIGHT: hwkey_t = 64;
pub const hwkey_t_HWKEY_PLUS: hwkey_t = 128;
pub const hwkey_t_HWKEY_MINUS: hwkey_t = 256;
pub const hwkey_t_HWKEY_DOWN: hwkey_t = 512;
pub const hwkey_t_HWKEY_UP: hwkey_t = 1024;
pub const hwkey_t_HWKEY_PREV: hwkey_t = 2048;
pub const hwkey_t_HWKEY_NEXT: hwkey_t = 4096;
pub const hwkey_t_HWKEY_NEXT2: hwkey_t = 8192;
pub const hwkey_t_HWKEY_POWER: hwkey_t = 16384;
pub const hwkey_t_HWKEY_PREV2: hwkey_t = 32768;
pub const hwkey_t_HWKEY_HOME: hwkey_t = 65536;
pub const hwkey_t_HWKEY_RESERVED1: hwkey_t = 131072;
pub const hwkey_t_HWKEY_RESERVED2: hwkey_t = 262144;
pub const hwkey_t_HWKEY_RESERVED3: hwkey_t = 524288;
pub const hwkey_t_HWKEY_RESERVED4: hwkey_t = 1048576;
pub const hwkey_t_HWKEY_ZOOMIN: hwkey_t = 2097152;
pub const hwkey_t_HWKEY_ZOOMOUT: hwkey_t = 4194304;
pub const hwkey_t_HWKEY_POWEROFF: hwkey_t = 8388608;
pub const hwkey_t_HWKEY_COVEROPEN: hwkey_t = 16777216;
pub const hwkey_t_HWKEY_COVERCLOSE: hwkey_t = 33554432;
pub type hwkey_t = ::std::os::raw::c_uint;
pub const input_dev_e_DEV_UNKNOWN: input_dev_e = 0;
pub const input_dev_e_TP_CAPACITIVE: input_dev_e = 1;
pub const input_dev_e_TP_DIGITIZER: input_dev_e = 2;
pub const input_dev_e_MAX_INPUT_TOUCH_DEV: input_dev_e = 3;
pub const input_dev_e_INPUT_DEV_KEYBOARD_HW: input_dev_e = 4;
pub const input_dev_e_INPUT_DEV_KEYBOARD_BT: input_dev_e = 5;
pub const input_dev_e_INPUT_DEV_KEYBOARD_USB: input_dev_e = 6;
pub type input_dev_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slider_cfg_s {
    pub resolution: ::std::os::raw::c_int,
    pub reverse_axis: bool,
    pub relative: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slider_cfg_s"][::std::mem::size_of::<slider_cfg_s>() - 8usize];
    ["Alignment of slider_cfg_s"][::std::mem::align_of::<slider_cfg_s>() - 4usize];
    ["Offset of field: slider_cfg_s::resolution"]
        [::std::mem::offset_of!(slider_cfg_s, resolution) - 0usize];
    ["Offset of field: slider_cfg_s::reverse_axis"]
        [::std::mem::offset_of!(slider_cfg_s, reverse_axis) - 4usize];
    ["Offset of field: slider_cfg_s::relative"]
        [::std::mem::offset_of!(slider_cfg_s, relative) - 5usize];
};
pub type slider_cfg_t = slider_cfg_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct frontlight_ctrl_s {
    pub vesion: ::std::os::raw::c_int,
    pub set_brightness: ::std::option::Option<
        unsafe extern "C" fn(value: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
    >,
    pub get_brightness: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub get_max_brightness: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub set_color: ::std::option::Option<
        unsafe extern "C" fn(value: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
    >,
    pub get_color: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub get_max_color: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of frontlight_ctrl_s"][::std::mem::size_of::<frontlight_ctrl_s>() - 32usize];
    ["Alignment of frontlight_ctrl_s"][::std::mem::align_of::<frontlight_ctrl_s>() - 4usize];
    ["Offset of field: frontlight_ctrl_s::vesion"]
        [::std::mem::offset_of!(frontlight_ctrl_s, vesion) - 0usize];
    ["Offset of field: frontlight_ctrl_s::set_brightness"]
        [::std::mem::offset_of!(frontlight_ctrl_s, set_brightness) - 4usize];
    ["Offset of field: frontlight_ctrl_s::get_brightness"]
        [::std::mem::offset_of!(frontlight_ctrl_s, get_brightness) - 8usize];
    ["Offset of field: frontlight_ctrl_s::get_max_brightness"]
        [::std::mem::offset_of!(frontlight_ctrl_s, get_max_brightness) - 12usize];
    ["Offset of field: frontlight_ctrl_s::set_color"]
        [::std::mem::offset_of!(frontlight_ctrl_s, set_color) - 16usize];
    ["Offset of field: frontlight_ctrl_s::get_color"]
        [::std::mem::offset_of!(frontlight_ctrl_s, get_color) - 20usize];
    ["Offset of field: frontlight_ctrl_s::get_max_color"]
        [::std::mem::offset_of!(frontlight_ctrl_s, get_max_color) - 24usize];
    ["Offset of field: frontlight_ctrl_s::data"]
        [::std::mem::offset_of!(frontlight_ctrl_s, data) - 28usize];
};
pub type frontlight_ctrl = frontlight_ctrl_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct power_led_cfg_t {
    pub switch_path: *const ::std::os::raw::c_char,
    pub trigger_path: *const ::std::os::raw::c_char,
    pub charging_trigger: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of power_led_cfg_t"][::std::mem::size_of::<power_led_cfg_t>() - 12usize];
    ["Alignment of power_led_cfg_t"][::std::mem::align_of::<power_led_cfg_t>() - 4usize];
    ["Offset of field: power_led_cfg_t::switch_path"]
        [::std::mem::offset_of!(power_led_cfg_t, switch_path) - 0usize];
    ["Offset of field: power_led_cfg_t::trigger_path"]
        [::std::mem::offset_of!(power_led_cfg_t, trigger_path) - 4usize];
    ["Offset of field: power_led_cfg_t::charging_trigger"]
        [::std::mem::offset_of!(power_led_cfg_t, charging_trigger) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct storage_device {
    pub path: *const ::std::os::raw::c_char,
    pub type_: *const ::std::os::raw::c_char,
    pub bus: *const ::std::os::raw::c_char,
    pub size: u64,
    pub wearout: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of storage_device"][::std::mem::size_of::<storage_device>() - 32usize];
    ["Alignment of storage_device"][::std::mem::align_of::<storage_device>() - 8usize];
    ["Offset of field: storage_device::path"]
        [::std::mem::offset_of!(storage_device, path) - 0usize];
    ["Offset of field: storage_device::type_"]
        [::std::mem::offset_of!(storage_device, type_) - 4usize];
    ["Offset of field: storage_device::bus"][::std::mem::offset_of!(storage_device, bus) - 8usize];
    ["Offset of field: storage_device::size"]
        [::std::mem::offset_of!(storage_device, size) - 16usize];
    ["Offset of field: storage_device::wearout"]
        [::std::mem::offset_of!(storage_device, wearout) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct storage_partition {
    pub path: *const ::std::os::raw::c_char,
    pub offset: u64,
    pub size: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of storage_partition"][::std::mem::size_of::<storage_partition>() - 24usize];
    ["Alignment of storage_partition"][::std::mem::align_of::<storage_partition>() - 8usize];
    ["Offset of field: storage_partition::path"]
        [::std::mem::offset_of!(storage_partition, path) - 0usize];
    ["Offset of field: storage_partition::offset"]
        [::std::mem::offset_of!(storage_partition, offset) - 8usize];
    ["Offset of field: storage_partition::size"]
        [::std::mem::offset_of!(storage_partition, size) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct storage_cfg_t {
    pub internal: storage_device,
    pub external: storage_device,
    pub usb: storage_device,
    pub partition: storage_cfg_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct storage_cfg_t__bindgen_ty_1 {
    pub uboot: storage_partition,
    pub uboot_backup: storage_partition,
    pub logo: storage_partition,
    pub logo_backup: storage_partition,
    pub kernel: storage_partition,
    pub root: storage_partition,
    pub cramfs: storage_partition,
    pub ebrmain: storage_partition,
    pub secure: storage_partition,
    pub user: storage_partition,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of storage_cfg_t__bindgen_ty_1"]
        [::std::mem::size_of::<storage_cfg_t__bindgen_ty_1>() - 240usize];
    ["Alignment of storage_cfg_t__bindgen_ty_1"]
        [::std::mem::align_of::<storage_cfg_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: storage_cfg_t__bindgen_ty_1::uboot"]
        [::std::mem::offset_of!(storage_cfg_t__bindgen_ty_1, uboot) - 0usize];
    ["Offset of field: storage_cfg_t__bindgen_ty_1::uboot_backup"]
        [::std::mem::offset_of!(storage_cfg_t__bindgen_ty_1, uboot_backup) - 24usize];
    ["Offset of field: storage_cfg_t__bindgen_ty_1::logo"]
        [::std::mem::offset_of!(storage_cfg_t__bindgen_ty_1, logo) - 48usize];
    ["Offset of field: storage_cfg_t__bindgen_ty_1::logo_backup"]
        [::std::mem::offset_of!(storage_cfg_t__bindgen_ty_1, logo_backup) - 72usize];
    ["Offset of field: storage_cfg_t__bindgen_ty_1::kernel"]
        [::std::mem::offset_of!(storage_cfg_t__bindgen_ty_1, kernel) - 96usize];
    ["Offset of field: storage_cfg_t__bindgen_ty_1::root"]
        [::std::mem::offset_of!(storage_cfg_t__bindgen_ty_1, root) - 120usize];
    ["Offset of field: storage_cfg_t__bindgen_ty_1::cramfs"]
        [::std::mem::offset_of!(storage_cfg_t__bindgen_ty_1, cramfs) - 144usize];
    ["Offset of field: storage_cfg_t__bindgen_ty_1::ebrmain"]
        [::std::mem::offset_of!(storage_cfg_t__bindgen_ty_1, ebrmain) - 168usize];
    ["Offset of field: storage_cfg_t__bindgen_ty_1::secure"]
        [::std::mem::offset_of!(storage_cfg_t__bindgen_ty_1, secure) - 192usize];
    ["Offset of field: storage_cfg_t__bindgen_ty_1::user"]
        [::std::mem::offset_of!(storage_cfg_t__bindgen_ty_1, user) - 216usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of storage_cfg_t"][::std::mem::size_of::<storage_cfg_t>() - 336usize];
    ["Alignment of storage_cfg_t"][::std::mem::align_of::<storage_cfg_t>() - 8usize];
    ["Offset of field: storage_cfg_t::internal"]
        [::std::mem::offset_of!(storage_cfg_t, internal) - 0usize];
    ["Offset of field: storage_cfg_t::external"]
        [::std::mem::offset_of!(storage_cfg_t, external) - 32usize];
    ["Offset of field: storage_cfg_t::usb"][::std::mem::offset_of!(storage_cfg_t, usb) - 64usize];
    ["Offset of field: storage_cfg_t::partition"]
        [::std::mem::offset_of!(storage_cfg_t, partition) - 96usize];
};
pub const globalaction_on_event_e_GLOBALACTION_ON_KEYPRESS: globalaction_on_event_e = 0;
pub const globalaction_on_event_e_GLOBALACTION_ON_KEYHOLD: globalaction_on_event_e = 1;
pub const globalaction_on_event_e_GLOBALACTION_ON_DOUBLECLICK: globalaction_on_event_e = 2;
pub type globalaction_on_event_e = ::std::os::raw::c_uint;
pub const AvrcpCommands_AVRCP_NEXT: AvrcpCommands = 0;
pub const AvrcpCommands_AVRCP_PREVIOUS: AvrcpCommands = 1;
pub const AvrcpCommands_AVRCP_PAUSE: AvrcpCommands = 2;
pub const AvrcpCommands_AVRCP_PLAY_PAUSE: AvrcpCommands = 3;
pub const AvrcpCommands_AVRCP_STOP: AvrcpCommands = 4;
pub const AvrcpCommands_AVRCP_PLAY: AvrcpCommands = 5;
pub const AvrcpCommands_AVRCP_SET_VOLUME: AvrcpCommands = 6;
pub type AvrcpCommands = ::std::os::raw::c_uint;
pub const PackageType_PT_UNKNOWN: PackageType = 0;
pub const PackageType_PT_TTS: PackageType = 1;
pub type PackageType = ::std::os::raw::c_uint;
pub const PackageJobActions_PJA_JOBS_STARTED: PackageJobActions = 0;
pub const PackageJobActions_PJA_PACKAGE_DOWNLOAD_STARTED: PackageJobActions = 1;
pub const PackageJobActions_PJA_PACKAGE_DOWNLOAD_FINISHED: PackageJobActions = 2;
pub const PackageJobActions_PJA_PACKAGE_INSTALL_STARTED: PackageJobActions = 3;
pub const PackageJobActions_PJA_PACKAGE_INSTALL_FINISHED: PackageJobActions = 4;
pub const PackageJobActions_PJA_PACKAGE_UNINSTALL_STARTED: PackageJobActions = 5;
pub const PackageJobActions_PJA_PACKAGE_UNINSTALL_FINISHED: PackageJobActions = 6;
pub const PackageJobActions_PJA_JOBS_FINISHED: PackageJobActions = 7;
pub const PackageJobActions_PJA_JOBS_ABORTED: PackageJobActions = 8;
pub type PackageJobActions = ::std::os::raw::c_uint;
pub const keymap_e_KEYMAP_GLOBAL: keymap_e = 0;
pub const keymap_e_KEYMAP_TXT: keymap_e = 1;
pub const keymap_e_KEYMAP_PDF: keymap_e = 2;
pub type keymap_e = ::std::os::raw::c_uint;
pub use self::keymap_e as keymap_t;
pub const PB_STATE_e_MP_STOPPED: PB_STATE_e = 0;
pub const PB_STATE_e_MP_REQUEST_FOR_PLAY: PB_STATE_e = 1;
pub const PB_STATE_e_MP_PLAYING: PB_STATE_e = 2;
pub const PB_STATE_e_MP_PAUSED: PB_STATE_e = 3;
pub const PB_STATE_e_MP_PREVTRACK: PB_STATE_e = 4;
pub const PB_STATE_e_MP_NEXTTRACK: PB_STATE_e = 5;
pub const PB_STATE_e_MP_TRACK_FINISHED: PB_STATE_e = 6;
pub const PB_STATE_e_MP_LOAD_FILE_AND_PAUSE: PB_STATE_e = 7;
pub type PB_STATE_e = ::std::os::raw::c_uint;
pub use self::PB_STATE_e as PB_STATE;
pub const PB_TTS_STATE_e_TTS_STOPPED: PB_TTS_STATE_e = 0;
pub const PB_TTS_STATE_e_TTS_PLAYING: PB_TTS_STATE_e = 1;
pub const PB_TTS_STATE_e_TTS_PAUSED: PB_TTS_STATE_e = 2;
pub type PB_TTS_STATE_e = ::std::os::raw::c_uint;
pub use self::PB_TTS_STATE_e as PB_TTS_STATE;
pub const WIFI_SECURITY_NO: WIFI_SECURITY = 0;
pub const WIFI_SECURITY_WEP: WIFI_SECURITY = 1;
pub const WIFI_SECURITY_WPAEAP: WIFI_SECURITY = 2;
pub const WIFI_SECURITY_WPAPSK: WIFI_SECURITY = 3;
pub type WIFI_SECURITY = ::std::os::raw::c_uint;
pub const NET_STATE_NET_STATE_UNKNOWN: NET_STATE = -1;
pub const NET_STATE_DISCONNECTED: NET_STATE = 0;
pub const NET_STATE_CONNECTING: NET_STATE = 1;
pub const NET_STATE_CONNECTED: NET_STATE = 2;
pub type NET_STATE = ::std::os::raw::c_int;
pub const FONT_TYPE_FONT_STD: FONT_TYPE = 0;
pub const FONT_TYPE_FONT_BOLD: FONT_TYPE = 1;
pub const FONT_TYPE_FONT_ITALIC: FONT_TYPE = 2;
pub const FONT_TYPE_FONT_BOLDITALIC: FONT_TYPE = 3;
pub const FONT_TYPE_FONT_MONO: FONT_TYPE = 4;
pub const FONT_TYPE_FONT_FAMILY: FONT_TYPE = 5;
pub type FONT_TYPE = ::std::os::raw::c_uint;
pub const SideFlags_SFLAGS_NONE: SideFlags = 0;
pub const SideFlags_SFLAGS_LEFT: SideFlags = 1;
pub const SideFlags_SFLAGS_RIGHT: SideFlags = 2;
pub const SideFlags_SFLAGS_RIGHT_LEFT: SideFlags = 3;
pub const SideFlags_SFLAGS_UP: SideFlags = 4;
pub const SideFlags_SFLAGS_UP_LEFT: SideFlags = 5;
pub const SideFlags_SFLAGS_UP_RIGHT: SideFlags = 6;
pub const SideFlags_SFLAGS_UP_RIGHT_LEFT: SideFlags = 7;
pub const SideFlags_SFLAGS_DOWN: SideFlags = 8;
pub const SideFlags_SFLAGS_DOWN_LEFT: SideFlags = 9;
pub const SideFlags_SFLAGS_DOWN_RIGHT: SideFlags = 10;
pub const SideFlags_SFLAGS_DOWN_RIGHT_LEFT: SideFlags = 11;
pub const SideFlags_SFLAGS_DOWN_UP: SideFlags = 12;
pub const SideFlags_SFLAGS_DOWN_UP_LEFT: SideFlags = 13;
pub const SideFlags_SFLAGS_DOWN_UP_RIGHT: SideFlags = 14;
pub const SideFlags_SFLAGS_ALL: SideFlags = 15;
pub type SideFlags = ::std::os::raw::c_uint;
pub type iv_handler_descriptor = usize;
#[doc = "< PANEL is completely off"]
pub const PANEL_FLAGS_PANEL_DISABLED: PANEL_FLAGS = 0;
#[doc = "< PANEL is on, if any other flag is set panel is treated as active"]
pub const PANEL_FLAGS_PANEL_ENABLED: PANEL_FLAGS = 2;
#[doc = "< PANEL is on and could be drawn but it does not handle pointer events,\n it is good to use in pair with SetManualPanelUpdates(int enable, iv_panelupdateshandler handler)\n @see SetManualPanelUpdates(int enable, iv_panelupdateshandler handler)"]
pub const PANEL_FLAGS_PANEL_EVENT_NO_HANDLING: PANEL_FLAGS = 4;
pub const PANEL_FLAGS_PANEL_NO_FB_OFFSET: PANEL_FLAGS = 8;
pub const PANEL_FLAGS_PANEL_NO_SELF_UPDATE: PANEL_FLAGS = 16;
#[doc = " Enum wich can be used for SetPanelType function\n @see SetPanelType(int)"]
pub type PANEL_FLAGS = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_vector2i_s {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_vector2i_s"][::std::mem::size_of::<iv_vector2i_s>() - 8usize];
    ["Alignment of iv_vector2i_s"][::std::mem::align_of::<iv_vector2i_s>() - 4usize];
    ["Offset of field: iv_vector2i_s::x"][::std::mem::offset_of!(iv_vector2i_s, x) - 0usize];
    ["Offset of field: iv_vector2i_s::y"][::std::mem::offset_of!(iv_vector2i_s, y) - 4usize];
};
pub type iv_vector2i = iv_vector2i_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_vector2f_s {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_vector2f_s"][::std::mem::size_of::<iv_vector2f_s>() - 8usize];
    ["Alignment of iv_vector2f_s"][::std::mem::align_of::<iv_vector2f_s>() - 4usize];
    ["Offset of field: iv_vector2f_s::x"][::std::mem::offset_of!(iv_vector2f_s, x) - 0usize];
    ["Offset of field: iv_vector2f_s::y"][::std::mem::offset_of!(iv_vector2f_s, y) - 4usize];
};
pub type iv_vector2f = iv_vector2f_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_vector2d_s {
    pub x: f64,
    pub y: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_vector2d_s"][::std::mem::size_of::<iv_vector2d_s>() - 16usize];
    ["Alignment of iv_vector2d_s"][::std::mem::align_of::<iv_vector2d_s>() - 8usize];
    ["Offset of field: iv_vector2d_s::x"][::std::mem::offset_of!(iv_vector2d_s, x) - 0usize];
    ["Offset of field: iv_vector2d_s::y"][::std::mem::offset_of!(iv_vector2d_s, y) - 8usize];
};
pub type iv_vector2d = iv_vector2d_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_matrix2i_s {
    pub a00: ::std::os::raw::c_int,
    pub a01: ::std::os::raw::c_int,
    pub a10: ::std::os::raw::c_int,
    pub a11: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_matrix2i_s"][::std::mem::size_of::<iv_matrix2i_s>() - 16usize];
    ["Alignment of iv_matrix2i_s"][::std::mem::align_of::<iv_matrix2i_s>() - 4usize];
    ["Offset of field: iv_matrix2i_s::a00"][::std::mem::offset_of!(iv_matrix2i_s, a00) - 0usize];
    ["Offset of field: iv_matrix2i_s::a01"][::std::mem::offset_of!(iv_matrix2i_s, a01) - 4usize];
    ["Offset of field: iv_matrix2i_s::a10"][::std::mem::offset_of!(iv_matrix2i_s, a10) - 8usize];
    ["Offset of field: iv_matrix2i_s::a11"][::std::mem::offset_of!(iv_matrix2i_s, a11) - 12usize];
};
pub type iv_matrix2i = iv_matrix2i_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_matrix2f_s {
    pub a00: f32,
    pub a01: f32,
    pub a10: f32,
    pub a11: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_matrix2f_s"][::std::mem::size_of::<iv_matrix2f_s>() - 16usize];
    ["Alignment of iv_matrix2f_s"][::std::mem::align_of::<iv_matrix2f_s>() - 4usize];
    ["Offset of field: iv_matrix2f_s::a00"][::std::mem::offset_of!(iv_matrix2f_s, a00) - 0usize];
    ["Offset of field: iv_matrix2f_s::a01"][::std::mem::offset_of!(iv_matrix2f_s, a01) - 4usize];
    ["Offset of field: iv_matrix2f_s::a10"][::std::mem::offset_of!(iv_matrix2f_s, a10) - 8usize];
    ["Offset of field: iv_matrix2f_s::a11"][::std::mem::offset_of!(iv_matrix2f_s, a11) - 12usize];
};
pub type iv_matrix2f = iv_matrix2f_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_matrix2d_s {
    pub a00: f64,
    pub a01: f64,
    pub a10: f64,
    pub a11: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_matrix2d_s"][::std::mem::size_of::<iv_matrix2d_s>() - 32usize];
    ["Alignment of iv_matrix2d_s"][::std::mem::align_of::<iv_matrix2d_s>() - 8usize];
    ["Offset of field: iv_matrix2d_s::a00"][::std::mem::offset_of!(iv_matrix2d_s, a00) - 0usize];
    ["Offset of field: iv_matrix2d_s::a01"][::std::mem::offset_of!(iv_matrix2d_s, a01) - 8usize];
    ["Offset of field: iv_matrix2d_s::a10"][::std::mem::offset_of!(iv_matrix2d_s, a10) - 16usize];
    ["Offset of field: iv_matrix2d_s::a11"][::std::mem::offset_of!(iv_matrix2d_s, a11) - 24usize];
};
pub type iv_matrix2d = iv_matrix2d_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_complex2f_s {
    pub r: f32,
    pub i: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_complex2f_s"][::std::mem::size_of::<iv_complex2f_s>() - 8usize];
    ["Alignment of iv_complex2f_s"][::std::mem::align_of::<iv_complex2f_s>() - 4usize];
    ["Offset of field: iv_complex2f_s::r"][::std::mem::offset_of!(iv_complex2f_s, r) - 0usize];
    ["Offset of field: iv_complex2f_s::i"][::std::mem::offset_of!(iv_complex2f_s, i) - 4usize];
};
pub type iv_complex2f = iv_complex2f_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_complex2d_s {
    pub r: f64,
    pub i: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_complex2d_s"][::std::mem::size_of::<iv_complex2d_s>() - 16usize];
    ["Alignment of iv_complex2d_s"][::std::mem::align_of::<iv_complex2d_s>() - 8usize];
    ["Offset of field: iv_complex2d_s::r"][::std::mem::offset_of!(iv_complex2d_s, r) - 0usize];
    ["Offset of field: iv_complex2d_s::i"][::std::mem::offset_of!(iv_complex2d_s, i) - 8usize];
};
pub type iv_complex2d = iv_complex2d_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct irect_s {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub w: ::std::os::raw::c_int,
    pub h: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of irect_s"][::std::mem::size_of::<irect_s>() - 20usize];
    ["Alignment of irect_s"][::std::mem::align_of::<irect_s>() - 4usize];
    ["Offset of field: irect_s::x"][::std::mem::offset_of!(irect_s, x) - 0usize];
    ["Offset of field: irect_s::y"][::std::mem::offset_of!(irect_s, y) - 4usize];
    ["Offset of field: irect_s::w"][::std::mem::offset_of!(irect_s, w) - 8usize];
    ["Offset of field: irect_s::h"][::std::mem::offset_of!(irect_s, h) - 12usize];
    ["Offset of field: irect_s::flags"][::std::mem::offset_of!(irect_s, flags) - 16usize];
};
pub type irect = irect_s;
pub type iv_rect = irect;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_update_area_s {
    pub rect: irect,
    pub prev_rect: irect,
    pub need_update: bool,
    pub need_update_ptr: *mut bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_update_area_s"][::std::mem::size_of::<iv_update_area_s>() - 48usize];
    ["Alignment of iv_update_area_s"][::std::mem::align_of::<iv_update_area_s>() - 4usize];
    ["Offset of field: iv_update_area_s::rect"]
        [::std::mem::offset_of!(iv_update_area_s, rect) - 0usize];
    ["Offset of field: iv_update_area_s::prev_rect"]
        [::std::mem::offset_of!(iv_update_area_s, prev_rect) - 20usize];
    ["Offset of field: iv_update_area_s::need_update"]
        [::std::mem::offset_of!(iv_update_area_s, need_update) - 40usize];
    ["Offset of field: iv_update_area_s::need_update_ptr"]
        [::std::mem::offset_of!(iv_update_area_s, need_update_ptr) - 44usize];
};
pub type iv_update_area = iv_update_area_s;
#[repr(C)]
#[derive(Debug)]
pub struct ibitmap_s {
    pub width: ::std::os::raw::c_ushort,
    pub height: ::std::os::raw::c_ushort,
    pub depth: ::std::os::raw::c_ushort,
    pub scanline: ::std::os::raw::c_ushort,
    pub data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibitmap_s"][::std::mem::size_of::<ibitmap_s>() - 8usize];
    ["Alignment of ibitmap_s"][::std::mem::align_of::<ibitmap_s>() - 2usize];
    ["Offset of field: ibitmap_s::width"][::std::mem::offset_of!(ibitmap_s, width) - 0usize];
    ["Offset of field: ibitmap_s::height"][::std::mem::offset_of!(ibitmap_s, height) - 2usize];
    ["Offset of field: ibitmap_s::depth"][::std::mem::offset_of!(ibitmap_s, depth) - 4usize];
    ["Offset of field: ibitmap_s::scanline"][::std::mem::offset_of!(ibitmap_s, scanline) - 6usize];
    ["Offset of field: ibitmap_s::data"][::std::mem::offset_of!(ibitmap_s, data) - 8usize];
};
pub type ibitmap = ibitmap_s;
pub type iv_bitmap = ibitmap;
#[doc = " Struct wich can be used for function OpenControlPanel\n currently is a stub,\n @see OpenControlPanel(control_panel*)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct control_panel_s {
    #[doc = "< is a SET of flags, currently not used"]
    pub flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of control_panel_s"][::std::mem::size_of::<control_panel_s>() - 4usize];
    ["Alignment of control_panel_s"][::std::mem::align_of::<control_panel_s>() - 4usize];
    ["Offset of field: control_panel_s::flags"]
        [::std::mem::offset_of!(control_panel_s, flags) - 0usize];
};
#[doc = " Struct wich can be used for function OpenControlPanel\n currently is a stub,\n @see OpenControlPanel(control_panel*)"]
pub type control_panel = control_panel_s;
pub type iv_voidfunc = ::std::option::Option<unsafe extern "C" fn()>;
pub type iv_handler = ::std::option::Option<
    unsafe extern "C" fn(
        type_: ::std::os::raw::c_int,
        par1: ::std::os::raw::c_int,
        par2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_ctx_handler = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        type_: ::std::os::raw::c_int,
        par1: ::std::os::raw::c_int,
        par2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_timerproc = ::std::option::Option<unsafe extern "C" fn()>;
pub type iv_timerprocEx =
    ::std::option::Option<unsafe extern "C" fn(context: *mut ::std::os::raw::c_void)>;
pub type iv_menuhandler = ::std::option::Option<unsafe extern "C" fn(index: ::std::os::raw::c_int)>;
pub type iv_keyboardhandler =
    ::std::option::Option<unsafe extern "C" fn(text: *mut ::std::os::raw::c_char)>;
pub type iv_keyboardhandlerex = ::std::option::Option<
    unsafe extern "C" fn(text: *mut ::std::os::raw::c_char, data: *mut ::std::os::raw::c_void),
>;
pub type iv_dialoghandler =
    ::std::option::Option<unsafe extern "C" fn(button: ::std::os::raw::c_int)>;
pub type iv_timeedithandler =
    ::std::option::Option<unsafe extern "C" fn(newtime: ::std::os::raw::c_long)>;
pub type iv_fontselecthandler = ::std::option::Option<
    unsafe extern "C" fn(
        fontr: *mut ::std::os::raw::c_char,
        fontb: *mut ::std::os::raw::c_char,
        fonti: *mut ::std::os::raw::c_char,
        fontbi: *mut ::std::os::raw::c_char,
    ),
>;
pub type iv_dirselecthandler =
    ::std::option::Option<unsafe extern "C" fn(path: *mut ::std::os::raw::c_char)>;
pub type iv_confighandler = ::std::option::Option<unsafe extern "C" fn()>;
pub type iv_itemchangehandler =
    ::std::option::Option<unsafe extern "C" fn(name: *mut ::std::os::raw::c_char)>;
pub type iv_pageselecthandler =
    ::std::option::Option<unsafe extern "C" fn(page: ::std::os::raw::c_int)>;
pub type iv_bmkhandler = ::std::option::Option<
    unsafe extern "C" fn(
        action: ::std::os::raw::c_int,
        page: ::std::os::raw::c_int,
        position: ::std::os::raw::c_longlong,
    ),
>;
pub type iv_tochandler =
    ::std::option::Option<unsafe extern "C" fn(position: ::std::os::raw::c_longlong)>;
pub type iv_itempaint = ::std::option::Option<
    unsafe extern "C" fn(
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        index: ::std::os::raw::c_int,
        selected: ::std::os::raw::c_int,
    ),
>;
pub type iv_listhandler = ::std::option::Option<
    unsafe extern "C" fn(
        action: ::std::os::raw::c_int,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        idx: ::std::os::raw::c_int,
        state: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_rotatehandler =
    ::std::option::Option<unsafe extern "C" fn(direction: ::std::os::raw::c_int)>;
pub type iv_turnproc = ::std::option::Option<
    unsafe extern "C" fn(direction: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
>;
pub type iv_recurser = ::std::option::Option<
    unsafe extern "C" fn(
        path: *mut ::std::os::raw::c_char,
        type_: ::std::os::raw::c_int,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_msghandler = ::std::option::Option<
    unsafe extern "C" fn(
        task: ::std::os::raw::c_int,
        message: *mut ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_requestlistener = ::std::option::Option<
    unsafe extern "C" fn(
        request: ::std::os::raw::c_int,
        data: *mut ::std::os::raw::c_void,
        inlen: ::std::os::raw::c_int,
        outlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_requestlistener_ex = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        request: ::std::os::raw::c_int,
        data: *mut ::std::os::raw::c_void,
        inlen: ::std::os::raw::c_int,
        outlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_hashenumproc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *mut ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_void,
        userdata: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_hashcmpproc = ::std::option::Option<
    unsafe extern "C" fn(
        name1: *mut ::std::os::raw::c_char,
        value1: *mut ::std::os::raw::c_void,
        name2: *mut ::std::os::raw::c_char,
        value2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_hashaddproc = ::std::option::Option<
    unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type iv_hashdelproc =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>;
pub type iv_panelupdateshandler = ::std::option::Option<
    unsafe extern "C" fn(
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
        h: ::std::os::raw::c_int,
    ),
>;
pub type iv_eventsnotifierfunc = iv_voidfunc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TransparentDefinition {
    pub m_TRANSPARENT_MATRIX: [::std::os::raw::c_char; 256usize],
    pub m_isInitTransparentMatrix: ::std::os::raw::c_int,
    pub m_PercentOfTransparent: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TransparentDefinition"][::std::mem::size_of::<TransparentDefinition>() - 264usize];
    ["Alignment of TransparentDefinition"]
        [::std::mem::align_of::<TransparentDefinition>() - 4usize];
    ["Offset of field: TransparentDefinition::m_TRANSPARENT_MATRIX"]
        [::std::mem::offset_of!(TransparentDefinition, m_TRANSPARENT_MATRIX) - 0usize];
    ["Offset of field: TransparentDefinition::m_isInitTransparentMatrix"]
        [::std::mem::offset_of!(TransparentDefinition, m_isInitTransparentMatrix) - 256usize];
    ["Offset of field: TransparentDefinition::m_PercentOfTransparent"]
        [::std::mem::offset_of!(TransparentDefinition, m_PercentOfTransparent) - 260usize];
};
pub type TransparentHandle = TransparentDefinition;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ihash_item_s {
    pub name: *mut ::std::os::raw::c_char,
    pub value: *mut ::std::os::raw::c_void,
    pub next: *mut ihash_item_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ihash_item_s"][::std::mem::size_of::<ihash_item_s>() - 12usize];
    ["Alignment of ihash_item_s"][::std::mem::align_of::<ihash_item_s>() - 4usize];
    ["Offset of field: ihash_item_s::name"][::std::mem::offset_of!(ihash_item_s, name) - 0usize];
    ["Offset of field: ihash_item_s::value"][::std::mem::offset_of!(ihash_item_s, value) - 4usize];
    ["Offset of field: ihash_item_s::next"][::std::mem::offset_of!(ihash_item_s, next) - 8usize];
};
pub type ihash_item = ihash_item_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ihash_s {
    pub prime: ::std::os::raw::c_int,
    pub count: ::std::os::raw::c_int,
    pub addproc: iv_hashaddproc,
    pub delproc: iv_hashdelproc,
    pub items: *mut *mut ihash_item_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ihash_s"][::std::mem::size_of::<ihash_s>() - 20usize];
    ["Alignment of ihash_s"][::std::mem::align_of::<ihash_s>() - 4usize];
    ["Offset of field: ihash_s::prime"][::std::mem::offset_of!(ihash_s, prime) - 0usize];
    ["Offset of field: ihash_s::count"][::std::mem::offset_of!(ihash_s, count) - 4usize];
    ["Offset of field: ihash_s::addproc"][::std::mem::offset_of!(ihash_s, addproc) - 8usize];
    ["Offset of field: ihash_s::delproc"][::std::mem::offset_of!(ihash_s, delproc) - 12usize];
    ["Offset of field: ihash_s::items"][::std::mem::offset_of!(ihash_s, items) - 16usize];
};
pub type ihash = ihash_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifont_s {
    pub name: *mut ::std::os::raw::c_char,
    pub family: *mut ::std::os::raw::c_char,
    pub size: ::std::os::raw::c_int,
    pub aa: ::std::os::raw::c_uchar,
    pub isbold: ::std::os::raw::c_uchar,
    pub isitalic: ::std::os::raw::c_uchar,
    pub _r1: ::std::os::raw::c_uchar,
    pub charset: ::std::os::raw::c_ushort,
    pub _r2: ::std::os::raw::c_ushort,
    pub color: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub linespacing: ::std::os::raw::c_int,
    pub baseline: ::std::os::raw::c_int,
    pub fdata: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ifont_s"][::std::mem::size_of::<ifont_s>() - 40usize];
    ["Alignment of ifont_s"][::std::mem::align_of::<ifont_s>() - 4usize];
    ["Offset of field: ifont_s::name"][::std::mem::offset_of!(ifont_s, name) - 0usize];
    ["Offset of field: ifont_s::family"][::std::mem::offset_of!(ifont_s, family) - 4usize];
    ["Offset of field: ifont_s::size"][::std::mem::offset_of!(ifont_s, size) - 8usize];
    ["Offset of field: ifont_s::aa"][::std::mem::offset_of!(ifont_s, aa) - 12usize];
    ["Offset of field: ifont_s::isbold"][::std::mem::offset_of!(ifont_s, isbold) - 13usize];
    ["Offset of field: ifont_s::isitalic"][::std::mem::offset_of!(ifont_s, isitalic) - 14usize];
    ["Offset of field: ifont_s::_r1"][::std::mem::offset_of!(ifont_s, _r1) - 15usize];
    ["Offset of field: ifont_s::charset"][::std::mem::offset_of!(ifont_s, charset) - 16usize];
    ["Offset of field: ifont_s::_r2"][::std::mem::offset_of!(ifont_s, _r2) - 18usize];
    ["Offset of field: ifont_s::color"][::std::mem::offset_of!(ifont_s, color) - 20usize];
    ["Offset of field: ifont_s::height"][::std::mem::offset_of!(ifont_s, height) - 24usize];
    ["Offset of field: ifont_s::linespacing"]
        [::std::mem::offset_of!(ifont_s, linespacing) - 28usize];
    ["Offset of field: ifont_s::baseline"][::std::mem::offset_of!(ifont_s, baseline) - 32usize];
    ["Offset of field: ifont_s::fdata"][::std::mem::offset_of!(ifont_s, fdata) - 36usize];
};
pub type ifont = ifont_s;
pub const FONT_MENU_FLAGS_FM_SHOW_SIZE: FONT_MENU_FLAGS = 1;
pub type FONT_MENU_FLAGS = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iuser_font_s {
    pub show_font_name: *mut ::std::os::raw::c_char,
    pub real_font_name: *mut ::std::os::raw::c_char,
    pub font: *mut ifont,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iuser_font_s"][::std::mem::size_of::<iuser_font_s>() - 12usize];
    ["Alignment of iuser_font_s"][::std::mem::align_of::<iuser_font_s>() - 4usize];
    ["Offset of field: iuser_font_s::show_font_name"]
        [::std::mem::offset_of!(iuser_font_s, show_font_name) - 0usize];
    ["Offset of field: iuser_font_s::real_font_name"]
        [::std::mem::offset_of!(iuser_font_s, real_font_name) - 4usize];
    ["Offset of field: iuser_font_s::font"][::std::mem::offset_of!(iuser_font_s, font) - 8usize];
};
pub type iuser_font = iuser_font_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifont_list_s {
    pub list: *mut iuser_font,
    pub count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ifont_list_s"][::std::mem::size_of::<ifont_list_s>() - 8usize];
    ["Alignment of ifont_list_s"][::std::mem::align_of::<ifont_list_s>() - 4usize];
    ["Offset of field: ifont_list_s::list"][::std::mem::offset_of!(ifont_list_s, list) - 0usize];
    ["Offset of field: ifont_list_s::count"][::std::mem::offset_of!(ifont_list_s, count) - 4usize];
};
pub type ifont_list = ifont_list_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifont_menu_s {
    pub menu_title: *mut ::std::os::raw::c_char,
    pub current_font: *mut ::std::os::raw::c_char,
    pub flags: FONT_MENU_FLAGS,
    pub hproc: iv_fontselecthandler,
    pub user_fonts: *mut ifont_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ifont_menu_s"][::std::mem::size_of::<ifont_menu_s>() - 20usize];
    ["Alignment of ifont_menu_s"][::std::mem::align_of::<ifont_menu_s>() - 4usize];
    ["Offset of field: ifont_menu_s::menu_title"]
        [::std::mem::offset_of!(ifont_menu_s, menu_title) - 0usize];
    ["Offset of field: ifont_menu_s::current_font"]
        [::std::mem::offset_of!(ifont_menu_s, current_font) - 4usize];
    ["Offset of field: ifont_menu_s::flags"][::std::mem::offset_of!(ifont_menu_s, flags) - 8usize];
    ["Offset of field: ifont_menu_s::hproc"][::std::mem::offset_of!(ifont_menu_s, hproc) - 12usize];
    ["Offset of field: ifont_menu_s::user_fonts"]
        [::std::mem::offset_of!(ifont_menu_s, user_fonts) - 16usize];
};
pub type ifont_menu = ifont_menu_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imenu_s {
    pub type_: ::std::os::raw::c_short,
    pub index: ::std::os::raw::c_short,
    pub text: *mut ::std::os::raw::c_char,
    pub submenu: *mut imenu_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imenu_s"][::std::mem::size_of::<imenu_s>() - 12usize];
    ["Alignment of imenu_s"][::std::mem::align_of::<imenu_s>() - 4usize];
    ["Offset of field: imenu_s::type_"][::std::mem::offset_of!(imenu_s, type_) - 0usize];
    ["Offset of field: imenu_s::index"][::std::mem::offset_of!(imenu_s, index) - 2usize];
    ["Offset of field: imenu_s::text"][::std::mem::offset_of!(imenu_s, text) - 4usize];
    ["Offset of field: imenu_s::submenu"][::std::mem::offset_of!(imenu_s, submenu) - 8usize];
};
pub type imenu = imenu_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imenuex_s {
    pub type_: ::std::os::raw::c_short,
    pub index: ::std::os::raw::c_short,
    pub text: *mut ::std::os::raw::c_char,
    pub submenu: *mut imenuex_s,
    pub icon: *mut ibitmap,
    pub reserved: *mut ::std::os::raw::c_void,
    pub font: *const ifont,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imenuex_s"][::std::mem::size_of::<imenuex_s>() - 24usize];
    ["Alignment of imenuex_s"][::std::mem::align_of::<imenuex_s>() - 4usize];
    ["Offset of field: imenuex_s::type_"][::std::mem::offset_of!(imenuex_s, type_) - 0usize];
    ["Offset of field: imenuex_s::index"][::std::mem::offset_of!(imenuex_s, index) - 2usize];
    ["Offset of field: imenuex_s::text"][::std::mem::offset_of!(imenuex_s, text) - 4usize];
    ["Offset of field: imenuex_s::submenu"][::std::mem::offset_of!(imenuex_s, submenu) - 8usize];
    ["Offset of field: imenuex_s::icon"][::std::mem::offset_of!(imenuex_s, icon) - 12usize];
    ["Offset of field: imenuex_s::reserved"][::std::mem::offset_of!(imenuex_s, reserved) - 16usize];
    ["Offset of field: imenuex_s::font"][::std::mem::offset_of!(imenuex_s, font) - 20usize];
};
pub type imenuex = imenuex_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct icanvas_s {
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    #[doc = " @brief scanline number of bytes in one line"]
    pub scanline: ::std::os::raw::c_int,
    #[doc = " @brief depth is number of bits ber pixel (to get bytes do `depth >> 3`)"]
    pub depth: ::std::os::raw::c_int,
    pub clipx1: ::std::os::raw::c_int,
    pub clipx2: ::std::os::raw::c_int,
    pub clipy1: ::std::os::raw::c_int,
    pub clipy2: ::std::os::raw::c_int,
    pub addr: *mut u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of icanvas_s"][::std::mem::size_of::<icanvas_s>() - 36usize];
    ["Alignment of icanvas_s"][::std::mem::align_of::<icanvas_s>() - 4usize];
    ["Offset of field: icanvas_s::width"][::std::mem::offset_of!(icanvas_s, width) - 0usize];
    ["Offset of field: icanvas_s::height"][::std::mem::offset_of!(icanvas_s, height) - 4usize];
    ["Offset of field: icanvas_s::scanline"][::std::mem::offset_of!(icanvas_s, scanline) - 8usize];
    ["Offset of field: icanvas_s::depth"][::std::mem::offset_of!(icanvas_s, depth) - 12usize];
    ["Offset of field: icanvas_s::clipx1"][::std::mem::offset_of!(icanvas_s, clipx1) - 16usize];
    ["Offset of field: icanvas_s::clipx2"][::std::mem::offset_of!(icanvas_s, clipx2) - 20usize];
    ["Offset of field: icanvas_s::clipy1"][::std::mem::offset_of!(icanvas_s, clipy1) - 24usize];
    ["Offset of field: icanvas_s::clipy2"][::std::mem::offset_of!(icanvas_s, clipy2) - 28usize];
    ["Offset of field: icanvas_s::addr"][::std::mem::offset_of!(icanvas_s, addr) - 32usize];
};
pub type icanvas = icanvas_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_bitmap_ref_s {
    pub width: usize,
    pub height: usize,
    #[doc = " @brief scanline number of bytes in one line"]
    pub scanline: usize,
    #[doc = " @brief depth is number of bits ber pixel (to get bytes do `depth >> 3`)"]
    pub depth: u8,
    pub data: *mut u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_bitmap_ref_s"][::std::mem::size_of::<iv_bitmap_ref_s>() - 20usize];
    ["Alignment of iv_bitmap_ref_s"][::std::mem::align_of::<iv_bitmap_ref_s>() - 4usize];
    ["Offset of field: iv_bitmap_ref_s::width"]
        [::std::mem::offset_of!(iv_bitmap_ref_s, width) - 0usize];
    ["Offset of field: iv_bitmap_ref_s::height"]
        [::std::mem::offset_of!(iv_bitmap_ref_s, height) - 4usize];
    ["Offset of field: iv_bitmap_ref_s::scanline"]
        [::std::mem::offset_of!(iv_bitmap_ref_s, scanline) - 8usize];
    ["Offset of field: iv_bitmap_ref_s::depth"]
        [::std::mem::offset_of!(iv_bitmap_ref_s, depth) - 12usize];
    ["Offset of field: iv_bitmap_ref_s::data"]
        [::std::mem::offset_of!(iv_bitmap_ref_s, data) - 16usize];
};
pub type iv_bitmap_ref = iv_bitmap_ref_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct icontext_menu_properties_s {
    pub font_normal: *mut ifont,
    pub font_selected: *mut ifont,
    pub font_disabled: *mut ifont,
    pub background_color_normal: ::std::os::raw::c_int,
    pub background_color_disabled: ::std::os::raw::c_int,
    pub blackout: ::std::os::raw::c_int,
    pub item_height: ::std::os::raw::c_int,
    pub item_border_indent_horizontal: ::std::os::raw::c_int,
    pub separator_indent_horizontal: ::std::os::raw::c_int,
    pub separator_indent_vertical: ::std::os::raw::c_int,
    pub separator_height: ::std::os::raw::c_int,
    pub separator_style: ::std::os::raw::c_int,
    pub separator_color: ::std::os::raw::c_int,
    pub separator_frequency: ::std::os::raw::c_int,
    pub marker_height: ::std::os::raw::c_int,
    pub marker_indent_horizontal: ::std::os::raw::c_int,
    pub marker_style: ::std::os::raw::c_int,
    pub marker_color: ::std::os::raw::c_int,
    pub border_size: ::std::os::raw::c_int,
    pub border_color: ::std::os::raw::c_int,
    pub border_radius: ::std::os::raw::c_int,
    pub title_height: ::std::os::raw::c_int,
    pub enable_pointer: ::std::os::raw::c_int,
    pub font_normal_color: ::std::os::raw::c_int,
    pub font_selected_color: ::std::os::raw::c_int,
    pub font_disabled_color: ::std::os::raw::c_int,
    pub bullet_show: ::std::os::raw::c_int,
    #[doc = " @brief bullet_style - style of bullet element.\n Values:\n 0 - default\n 1 - draw bitmap at all elements\n By default it has been set to zero and it mean that we draw a bullet as a symbol only at one element."]
    pub bullet_style: ::std::os::raw::c_int,
    pub item_border_indent_vertical: ::std::os::raw::c_int,
    pub background_style: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of icontext_menu_properties_s"]
        [::std::mem::size_of::<icontext_menu_properties_s>() - 120usize];
    ["Alignment of icontext_menu_properties_s"]
        [::std::mem::align_of::<icontext_menu_properties_s>() - 4usize];
    ["Offset of field: icontext_menu_properties_s::font_normal"]
        [::std::mem::offset_of!(icontext_menu_properties_s, font_normal) - 0usize];
    ["Offset of field: icontext_menu_properties_s::font_selected"]
        [::std::mem::offset_of!(icontext_menu_properties_s, font_selected) - 4usize];
    ["Offset of field: icontext_menu_properties_s::font_disabled"]
        [::std::mem::offset_of!(icontext_menu_properties_s, font_disabled) - 8usize];
    ["Offset of field: icontext_menu_properties_s::background_color_normal"]
        [::std::mem::offset_of!(icontext_menu_properties_s, background_color_normal) - 12usize];
    ["Offset of field: icontext_menu_properties_s::background_color_disabled"]
        [::std::mem::offset_of!(icontext_menu_properties_s, background_color_disabled) - 16usize];
    ["Offset of field: icontext_menu_properties_s::blackout"]
        [::std::mem::offset_of!(icontext_menu_properties_s, blackout) - 20usize];
    ["Offset of field: icontext_menu_properties_s::item_height"]
        [::std::mem::offset_of!(icontext_menu_properties_s, item_height) - 24usize];
    ["Offset of field: icontext_menu_properties_s::item_border_indent_horizontal"][::std::mem::offset_of!(
        icontext_menu_properties_s,
        item_border_indent_horizontal
    ) - 28usize];
    ["Offset of field: icontext_menu_properties_s::separator_indent_horizontal"]
        [::std::mem::offset_of!(icontext_menu_properties_s, separator_indent_horizontal) - 32usize];
    ["Offset of field: icontext_menu_properties_s::separator_indent_vertical"]
        [::std::mem::offset_of!(icontext_menu_properties_s, separator_indent_vertical) - 36usize];
    ["Offset of field: icontext_menu_properties_s::separator_height"]
        [::std::mem::offset_of!(icontext_menu_properties_s, separator_height) - 40usize];
    ["Offset of field: icontext_menu_properties_s::separator_style"]
        [::std::mem::offset_of!(icontext_menu_properties_s, separator_style) - 44usize];
    ["Offset of field: icontext_menu_properties_s::separator_color"]
        [::std::mem::offset_of!(icontext_menu_properties_s, separator_color) - 48usize];
    ["Offset of field: icontext_menu_properties_s::separator_frequency"]
        [::std::mem::offset_of!(icontext_menu_properties_s, separator_frequency) - 52usize];
    ["Offset of field: icontext_menu_properties_s::marker_height"]
        [::std::mem::offset_of!(icontext_menu_properties_s, marker_height) - 56usize];
    ["Offset of field: icontext_menu_properties_s::marker_indent_horizontal"]
        [::std::mem::offset_of!(icontext_menu_properties_s, marker_indent_horizontal) - 60usize];
    ["Offset of field: icontext_menu_properties_s::marker_style"]
        [::std::mem::offset_of!(icontext_menu_properties_s, marker_style) - 64usize];
    ["Offset of field: icontext_menu_properties_s::marker_color"]
        [::std::mem::offset_of!(icontext_menu_properties_s, marker_color) - 68usize];
    ["Offset of field: icontext_menu_properties_s::border_size"]
        [::std::mem::offset_of!(icontext_menu_properties_s, border_size) - 72usize];
    ["Offset of field: icontext_menu_properties_s::border_color"]
        [::std::mem::offset_of!(icontext_menu_properties_s, border_color) - 76usize];
    ["Offset of field: icontext_menu_properties_s::border_radius"]
        [::std::mem::offset_of!(icontext_menu_properties_s, border_radius) - 80usize];
    ["Offset of field: icontext_menu_properties_s::title_height"]
        [::std::mem::offset_of!(icontext_menu_properties_s, title_height) - 84usize];
    ["Offset of field: icontext_menu_properties_s::enable_pointer"]
        [::std::mem::offset_of!(icontext_menu_properties_s, enable_pointer) - 88usize];
    ["Offset of field: icontext_menu_properties_s::font_normal_color"]
        [::std::mem::offset_of!(icontext_menu_properties_s, font_normal_color) - 92usize];
    ["Offset of field: icontext_menu_properties_s::font_selected_color"]
        [::std::mem::offset_of!(icontext_menu_properties_s, font_selected_color) - 96usize];
    ["Offset of field: icontext_menu_properties_s::font_disabled_color"]
        [::std::mem::offset_of!(icontext_menu_properties_s, font_disabled_color) - 100usize];
    ["Offset of field: icontext_menu_properties_s::bullet_show"]
        [::std::mem::offset_of!(icontext_menu_properties_s, bullet_show) - 104usize];
    ["Offset of field: icontext_menu_properties_s::bullet_style"]
        [::std::mem::offset_of!(icontext_menu_properties_s, bullet_style) - 108usize];
    ["Offset of field: icontext_menu_properties_s::item_border_indent_vertical"][::std::mem::offset_of!(
        icontext_menu_properties_s,
        item_border_indent_vertical
    ) - 112usize];
    ["Offset of field: icontext_menu_properties_s::background_style"]
        [::std::mem::offset_of!(icontext_menu_properties_s, background_style) - 116usize];
};
pub type icontext_menu_properties = icontext_menu_properties_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifont_selector_properties {
    pub custom_font_enable: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ifont_selector_properties"]
        [::std::mem::size_of::<ifont_selector_properties>() - 2usize];
    ["Alignment of ifont_selector_properties"]
        [::std::mem::align_of::<ifont_selector_properties>() - 2usize];
    ["Offset of field: ifont_selector_properties::custom_font_enable"]
        [::std::mem::offset_of!(ifont_selector_properties, custom_font_enable) - 0usize];
};
pub type font_selector_properties = ifont_selector_properties;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct icontext_menu_s {
    pub id: *const ::std::os::raw::c_char,
    pub hproc: iv_menuhandler,
    pub menuex: *const imenuex,
    pub menu: *const imenu,
    pub pos_selected_item: irect,
    pub pos_menu: irect,
    pub properties: *mut icontext_menu_properties,
    pub active_element: ::std::os::raw::c_int,
    pub enable_pointer: ::std::os::raw::c_short,
    pub enable_aura: ::std::os::raw::c_short,
    pub use_own_font: ::std::os::raw::c_short,
    pub update_after_close: ::std::os::raw::c_short,
    pub only_choise: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of icontext_menu_s"][::std::mem::size_of::<icontext_menu_s>() - 76usize];
    ["Alignment of icontext_menu_s"][::std::mem::align_of::<icontext_menu_s>() - 4usize];
    ["Offset of field: icontext_menu_s::id"][::std::mem::offset_of!(icontext_menu_s, id) - 0usize];
    ["Offset of field: icontext_menu_s::hproc"]
        [::std::mem::offset_of!(icontext_menu_s, hproc) - 4usize];
    ["Offset of field: icontext_menu_s::menuex"]
        [::std::mem::offset_of!(icontext_menu_s, menuex) - 8usize];
    ["Offset of field: icontext_menu_s::menu"]
        [::std::mem::offset_of!(icontext_menu_s, menu) - 12usize];
    ["Offset of field: icontext_menu_s::pos_selected_item"]
        [::std::mem::offset_of!(icontext_menu_s, pos_selected_item) - 16usize];
    ["Offset of field: icontext_menu_s::pos_menu"]
        [::std::mem::offset_of!(icontext_menu_s, pos_menu) - 36usize];
    ["Offset of field: icontext_menu_s::properties"]
        [::std::mem::offset_of!(icontext_menu_s, properties) - 56usize];
    ["Offset of field: icontext_menu_s::active_element"]
        [::std::mem::offset_of!(icontext_menu_s, active_element) - 60usize];
    ["Offset of field: icontext_menu_s::enable_pointer"]
        [::std::mem::offset_of!(icontext_menu_s, enable_pointer) - 64usize];
    ["Offset of field: icontext_menu_s::enable_aura"]
        [::std::mem::offset_of!(icontext_menu_s, enable_aura) - 66usize];
    ["Offset of field: icontext_menu_s::use_own_font"]
        [::std::mem::offset_of!(icontext_menu_s, use_own_font) - 68usize];
    ["Offset of field: icontext_menu_s::update_after_close"]
        [::std::mem::offset_of!(icontext_menu_s, update_after_close) - 70usize];
    ["Offset of field: icontext_menu_s::only_choise"]
        [::std::mem::offset_of!(icontext_menu_s, only_choise) - 72usize];
};
pub type icontext_menu = icontext_menu_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iapp_caption_s {
    pub rect_portrait: irect,
    pub rect_landscape: irect,
    pub font: *mut ifont,
    pub title_height: ::std::os::raw::c_int,
    pub background_color: ::std::os::raw::c_int,
    pub is_active: ::std::os::raw::c_short,
    pub is_uppercase: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iapp_caption_s"][::std::mem::size_of::<iapp_caption_s>() - 56usize];
    ["Alignment of iapp_caption_s"][::std::mem::align_of::<iapp_caption_s>() - 4usize];
    ["Offset of field: iapp_caption_s::rect_portrait"]
        [::std::mem::offset_of!(iapp_caption_s, rect_portrait) - 0usize];
    ["Offset of field: iapp_caption_s::rect_landscape"]
        [::std::mem::offset_of!(iapp_caption_s, rect_landscape) - 20usize];
    ["Offset of field: iapp_caption_s::font"]
        [::std::mem::offset_of!(iapp_caption_s, font) - 40usize];
    ["Offset of field: iapp_caption_s::title_height"]
        [::std::mem::offset_of!(iapp_caption_s, title_height) - 44usize];
    ["Offset of field: iapp_caption_s::background_color"]
        [::std::mem::offset_of!(iapp_caption_s, background_color) - 48usize];
    ["Offset of field: iapp_caption_s::is_active"]
        [::std::mem::offset_of!(iapp_caption_s, is_active) - 52usize];
    ["Offset of field: iapp_caption_s::is_uppercase"]
        [::std::mem::offset_of!(iapp_caption_s, is_uppercase) - 54usize];
};
pub type iapp_caption = iapp_caption_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itaskmgr_s {
    pub title_height: ::std::os::raw::c_int,
    pub title_font: *mut ifont,
    pub task_font: *mut ifont,
    pub task_title_font: *mut ifont,
    pub style: ::std::os::raw::c_int,
    pub profile_present: ::std::os::raw::c_int,
    pub profile_height: ::std::os::raw::c_int,
    pub profile_font: *mut ifont,
    pub shortcut_height: ::std::os::raw::c_int,
    pub shortcut_width: ::std::os::raw::c_int,
    pub shortcut_font: *mut ifont,
    pub task_height: ::std::os::raw::c_int,
    pub full_height: ::std::os::raw::c_int,
    pub full_width: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub border_size: ::std::os::raw::c_int,
    pub indent_from_border: ::std::os::raw::c_int,
    pub bitmap: *mut *mut ibitmap,
    pub bitmap_count: ::std::os::raw::c_int,
    pub separator_size: ::std::os::raw::c_int,
    pub exit_button_indent: ::std::os::raw::c_int,
    pub background_style: ::std::os::raw::c_int,
    pub separator_color: ::std::os::raw::c_int,
    pub border_color: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itaskmgr_s"][::std::mem::size_of::<itaskmgr_s>() - 108usize];
    ["Alignment of itaskmgr_s"][::std::mem::align_of::<itaskmgr_s>() - 4usize];
    ["Offset of field: itaskmgr_s::title_height"]
        [::std::mem::offset_of!(itaskmgr_s, title_height) - 0usize];
    ["Offset of field: itaskmgr_s::title_font"]
        [::std::mem::offset_of!(itaskmgr_s, title_font) - 4usize];
    ["Offset of field: itaskmgr_s::task_font"]
        [::std::mem::offset_of!(itaskmgr_s, task_font) - 8usize];
    ["Offset of field: itaskmgr_s::task_title_font"]
        [::std::mem::offset_of!(itaskmgr_s, task_title_font) - 12usize];
    ["Offset of field: itaskmgr_s::style"][::std::mem::offset_of!(itaskmgr_s, style) - 16usize];
    ["Offset of field: itaskmgr_s::profile_present"]
        [::std::mem::offset_of!(itaskmgr_s, profile_present) - 20usize];
    ["Offset of field: itaskmgr_s::profile_height"]
        [::std::mem::offset_of!(itaskmgr_s, profile_height) - 24usize];
    ["Offset of field: itaskmgr_s::profile_font"]
        [::std::mem::offset_of!(itaskmgr_s, profile_font) - 28usize];
    ["Offset of field: itaskmgr_s::shortcut_height"]
        [::std::mem::offset_of!(itaskmgr_s, shortcut_height) - 32usize];
    ["Offset of field: itaskmgr_s::shortcut_width"]
        [::std::mem::offset_of!(itaskmgr_s, shortcut_width) - 36usize];
    ["Offset of field: itaskmgr_s::shortcut_font"]
        [::std::mem::offset_of!(itaskmgr_s, shortcut_font) - 40usize];
    ["Offset of field: itaskmgr_s::task_height"]
        [::std::mem::offset_of!(itaskmgr_s, task_height) - 44usize];
    ["Offset of field: itaskmgr_s::full_height"]
        [::std::mem::offset_of!(itaskmgr_s, full_height) - 48usize];
    ["Offset of field: itaskmgr_s::full_width"]
        [::std::mem::offset_of!(itaskmgr_s, full_width) - 52usize];
    ["Offset of field: itaskmgr_s::width"][::std::mem::offset_of!(itaskmgr_s, width) - 56usize];
    ["Offset of field: itaskmgr_s::height"][::std::mem::offset_of!(itaskmgr_s, height) - 60usize];
    ["Offset of field: itaskmgr_s::x"][::std::mem::offset_of!(itaskmgr_s, x) - 64usize];
    ["Offset of field: itaskmgr_s::y"][::std::mem::offset_of!(itaskmgr_s, y) - 68usize];
    ["Offset of field: itaskmgr_s::border_size"]
        [::std::mem::offset_of!(itaskmgr_s, border_size) - 72usize];
    ["Offset of field: itaskmgr_s::indent_from_border"]
        [::std::mem::offset_of!(itaskmgr_s, indent_from_border) - 76usize];
    ["Offset of field: itaskmgr_s::bitmap"][::std::mem::offset_of!(itaskmgr_s, bitmap) - 80usize];
    ["Offset of field: itaskmgr_s::bitmap_count"]
        [::std::mem::offset_of!(itaskmgr_s, bitmap_count) - 84usize];
    ["Offset of field: itaskmgr_s::separator_size"]
        [::std::mem::offset_of!(itaskmgr_s, separator_size) - 88usize];
    ["Offset of field: itaskmgr_s::exit_button_indent"]
        [::std::mem::offset_of!(itaskmgr_s, exit_button_indent) - 92usize];
    ["Offset of field: itaskmgr_s::background_style"]
        [::std::mem::offset_of!(itaskmgr_s, background_style) - 96usize];
    ["Offset of field: itaskmgr_s::separator_color"]
        [::std::mem::offset_of!(itaskmgr_s, separator_color) - 100usize];
    ["Offset of field: itaskmgr_s::border_color"]
        [::std::mem::offset_of!(itaskmgr_s, border_color) - 104usize];
};
pub type itaskmgr = itaskmgr_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipager_s {
    pub page_font: *mut ifont,
    pub height: ::std::os::raw::c_int,
    pub indent_horizontal: ::std::os::raw::c_int,
    pub left_width: ::std::os::raw::c_int,
    pub page_width: ::std::os::raw::c_int,
    pub rigth_width: ::std::os::raw::c_int,
    pub separator_size: ::std::os::raw::c_int,
    pub separator_color: ::std::os::raw::c_int,
    pub icon_left: *const ibitmap,
    pub icon_right: *const ibitmap,
    pub current_page: ::std::os::raw::c_int,
    pub total_pages: ::std::os::raw::c_int,
    pub position: irect,
    pub orientation: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipager_s"][::std::mem::size_of::<ipager_s>() - 72usize];
    ["Alignment of ipager_s"][::std::mem::align_of::<ipager_s>() - 4usize];
    ["Offset of field: ipager_s::page_font"][::std::mem::offset_of!(ipager_s, page_font) - 0usize];
    ["Offset of field: ipager_s::height"][::std::mem::offset_of!(ipager_s, height) - 4usize];
    ["Offset of field: ipager_s::indent_horizontal"]
        [::std::mem::offset_of!(ipager_s, indent_horizontal) - 8usize];
    ["Offset of field: ipager_s::left_width"]
        [::std::mem::offset_of!(ipager_s, left_width) - 12usize];
    ["Offset of field: ipager_s::page_width"]
        [::std::mem::offset_of!(ipager_s, page_width) - 16usize];
    ["Offset of field: ipager_s::rigth_width"]
        [::std::mem::offset_of!(ipager_s, rigth_width) - 20usize];
    ["Offset of field: ipager_s::separator_size"]
        [::std::mem::offset_of!(ipager_s, separator_size) - 24usize];
    ["Offset of field: ipager_s::separator_color"]
        [::std::mem::offset_of!(ipager_s, separator_color) - 28usize];
    ["Offset of field: ipager_s::icon_left"][::std::mem::offset_of!(ipager_s, icon_left) - 32usize];
    ["Offset of field: ipager_s::icon_right"]
        [::std::mem::offset_of!(ipager_s, icon_right) - 36usize];
    ["Offset of field: ipager_s::current_page"]
        [::std::mem::offset_of!(ipager_s, current_page) - 40usize];
    ["Offset of field: ipager_s::total_pages"]
        [::std::mem::offset_of!(ipager_s, total_pages) - 44usize];
    ["Offset of field: ipager_s::position"][::std::mem::offset_of!(ipager_s, position) - 48usize];
    ["Offset of field: ipager_s::orientation"]
        [::std::mem::offset_of!(ipager_s, orientation) - 68usize];
};
pub type ipager = ipager_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iselection_s {
    pub selection_style: ::std::os::raw::c_int,
    pub background_color: ::std::os::raw::c_int,
    pub background_style: ::std::os::raw::c_int,
    pub border_size: ::std::os::raw::c_int,
    pub border_radius: ::std::os::raw::c_int,
    pub indent_horizontal: ::std::os::raw::c_int,
    pub indent_left: ::std::os::raw::c_int,
    pub indent_right: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iselection_s"][::std::mem::size_of::<iselection_s>() - 32usize];
    ["Alignment of iselection_s"][::std::mem::align_of::<iselection_s>() - 4usize];
    ["Offset of field: iselection_s::selection_style"]
        [::std::mem::offset_of!(iselection_s, selection_style) - 0usize];
    ["Offset of field: iselection_s::background_color"]
        [::std::mem::offset_of!(iselection_s, background_color) - 4usize];
    ["Offset of field: iselection_s::background_style"]
        [::std::mem::offset_of!(iselection_s, background_style) - 8usize];
    ["Offset of field: iselection_s::border_size"]
        [::std::mem::offset_of!(iselection_s, border_size) - 12usize];
    ["Offset of field: iselection_s::border_radius"]
        [::std::mem::offset_of!(iselection_s, border_radius) - 16usize];
    ["Offset of field: iselection_s::indent_horizontal"]
        [::std::mem::offset_of!(iselection_s, indent_horizontal) - 20usize];
    ["Offset of field: iselection_s::indent_left"]
        [::std::mem::offset_of!(iselection_s, indent_left) - 24usize];
    ["Offset of field: iselection_s::indent_right"]
        [::std::mem::offset_of!(iselection_s, indent_right) - 28usize];
};
pub type iselection = iselection_s;
pub const AppStyles_STYLE_UNKNOWN: AppStyles = 0;
pub const AppStyles_STYLE_KEYBOARD: AppStyles = 1;
pub const AppStyles_STYLE_TOUCHPANEL: AppStyles = 2;
pub const AppStyles_STYLE_TOUCHPANEL_KEYBORAD: AppStyles = 3;
pub const AppStyles_STYLE_MAX_NOT_USED: AppStyles = 4;
pub type AppStyles = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iappstyle_s {
    pub app_style: AppStyles,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iappstyle_s"][::std::mem::size_of::<iappstyle_s>() - 4usize];
    ["Alignment of iappstyle_s"][::std::mem::align_of::<iappstyle_s>() - 4usize];
    ["Offset of field: iappstyle_s::app_style"]
        [::std::mem::offset_of!(iappstyle_s, app_style) - 0usize];
};
pub type iappstyle = iappstyle_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ievent_s {
    pub hproc: iv_handler,
    pub type_: ::std::os::raw::c_ushort,
    pub mod_: ::std::os::raw::c_ushort,
    pub par1: ::std::os::raw::c_ushort,
    pub par2: ::std::os::raw::c_ushort,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ievent_s"][::std::mem::size_of::<ievent_s>() - 16usize];
    ["Alignment of ievent_s"][::std::mem::align_of::<ievent_s>() - 4usize];
    ["Offset of field: ievent_s::hproc"][::std::mem::offset_of!(ievent_s, hproc) - 0usize];
    ["Offset of field: ievent_s::type_"][::std::mem::offset_of!(ievent_s, type_) - 4usize];
    ["Offset of field: ievent_s::mod_"][::std::mem::offset_of!(ievent_s, mod_) - 6usize];
    ["Offset of field: ievent_s::par1"][::std::mem::offset_of!(ievent_s, par1) - 8usize];
    ["Offset of field: ievent_s::par2"][::std::mem::offset_of!(ievent_s, par2) - 10usize];
    ["Offset of field: ievent_s::data"][::std::mem::offset_of!(ievent_s, data) - 12usize];
};
pub type ievent = ievent_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iconfig_s {
    pub filename: *mut ::std::os::raw::c_char,
    pub hash: *mut ihash,
    pub vhash: *mut ihash,
    pub modified_hash: *mut ihash,
    pub deleted_keys: *mut *mut ::std::os::raw::c_char,
    pub changed: ::std::os::raw::c_int,
    pub deleted_keys_size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iconfig_s"][::std::mem::size_of::<iconfig_s>() - 28usize];
    ["Alignment of iconfig_s"][::std::mem::align_of::<iconfig_s>() - 4usize];
    ["Offset of field: iconfig_s::filename"][::std::mem::offset_of!(iconfig_s, filename) - 0usize];
    ["Offset of field: iconfig_s::hash"][::std::mem::offset_of!(iconfig_s, hash) - 4usize];
    ["Offset of field: iconfig_s::vhash"][::std::mem::offset_of!(iconfig_s, vhash) - 8usize];
    ["Offset of field: iconfig_s::modified_hash"]
        [::std::mem::offset_of!(iconfig_s, modified_hash) - 12usize];
    ["Offset of field: iconfig_s::deleted_keys"]
        [::std::mem::offset_of!(iconfig_s, deleted_keys) - 16usize];
    ["Offset of field: iconfig_s::changed"][::std::mem::offset_of!(iconfig_s, changed) - 20usize];
    ["Offset of field: iconfig_s::deleted_keys_size"]
        [::std::mem::offset_of!(iconfig_s, deleted_keys_size) - 24usize];
};
pub type iconfig = iconfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iconfigedit_s {
    pub type_: ::std::os::raw::c_int,
    pub icon: *const ibitmap,
    pub text: *mut ::std::os::raw::c_char,
    pub hint: *mut ::std::os::raw::c_char,
    pub name: *mut ::std::os::raw::c_char,
    pub deflt: *mut ::std::os::raw::c_char,
    pub variants: *mut *mut ::std::os::raw::c_char,
    pub submenu: *mut iconfigedit_s,
    pub icon_theme: *mut *mut ibitmap,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iconfigedit_s"][::std::mem::size_of::<iconfigedit_s>() - 36usize];
    ["Alignment of iconfigedit_s"][::std::mem::align_of::<iconfigedit_s>() - 4usize];
    ["Offset of field: iconfigedit_s::type_"]
        [::std::mem::offset_of!(iconfigedit_s, type_) - 0usize];
    ["Offset of field: iconfigedit_s::icon"][::std::mem::offset_of!(iconfigedit_s, icon) - 4usize];
    ["Offset of field: iconfigedit_s::text"][::std::mem::offset_of!(iconfigedit_s, text) - 8usize];
    ["Offset of field: iconfigedit_s::hint"][::std::mem::offset_of!(iconfigedit_s, hint) - 12usize];
    ["Offset of field: iconfigedit_s::name"][::std::mem::offset_of!(iconfigedit_s, name) - 16usize];
    ["Offset of field: iconfigedit_s::deflt"]
        [::std::mem::offset_of!(iconfigedit_s, deflt) - 20usize];
    ["Offset of field: iconfigedit_s::variants"]
        [::std::mem::offset_of!(iconfigedit_s, variants) - 24usize];
    ["Offset of field: iconfigedit_s::submenu"]
        [::std::mem::offset_of!(iconfigedit_s, submenu) - 28usize];
    ["Offset of field: iconfigedit_s::icon_theme"]
        [::std::mem::offset_of!(iconfigedit_s, icon_theme) - 32usize];
};
pub type iconfigedit = iconfigedit_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct oldconfigedit_s {
    pub text: *mut ::std::os::raw::c_char,
    pub name: *mut ::std::os::raw::c_char,
    pub type_: ::std::os::raw::c_int,
    pub deflt: *mut ::std::os::raw::c_char,
    pub variants: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of oldconfigedit_s"][::std::mem::size_of::<oldconfigedit_s>() - 20usize];
    ["Alignment of oldconfigedit_s"][::std::mem::align_of::<oldconfigedit_s>() - 4usize];
    ["Offset of field: oldconfigedit_s::text"]
        [::std::mem::offset_of!(oldconfigedit_s, text) - 0usize];
    ["Offset of field: oldconfigedit_s::name"]
        [::std::mem::offset_of!(oldconfigedit_s, name) - 4usize];
    ["Offset of field: oldconfigedit_s::type_"]
        [::std::mem::offset_of!(oldconfigedit_s, type_) - 8usize];
    ["Offset of field: oldconfigedit_s::deflt"]
        [::std::mem::offset_of!(oldconfigedit_s, deflt) - 12usize];
    ["Offset of field: oldconfigedit_s::variants"]
        [::std::mem::offset_of!(oldconfigedit_s, variants) - 16usize];
};
pub type oldconfigedit = oldconfigedit_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tocentry_s {
    pub level: ::std::os::raw::c_int,
    pub page: ::std::os::raw::c_int,
    pub position: ::std::os::raw::c_longlong,
    pub text: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tocentry_s"][::std::mem::size_of::<tocentry_s>() - 24usize];
    ["Alignment of tocentry_s"][::std::mem::align_of::<tocentry_s>() - 8usize];
    ["Offset of field: tocentry_s::level"][::std::mem::offset_of!(tocentry_s, level) - 0usize];
    ["Offset of field: tocentry_s::page"][::std::mem::offset_of!(tocentry_s, page) - 4usize];
    ["Offset of field: tocentry_s::position"]
        [::std::mem::offset_of!(tocentry_s, position) - 8usize];
    ["Offset of field: tocentry_s::text"][::std::mem::offset_of!(tocentry_s, text) - 16usize];
};
pub type tocentry = tocentry_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimer_s {
    pub tp: iv_timerproc,
    pub weak: ::std::os::raw::c_int,
    pub extime: ::std::os::raw::c_longlong,
    pub name: [::std::os::raw::c_char; 32usize],
    pub context: *mut ::std::os::raw::c_void,
    pub lastchecktime: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimer_s"][::std::mem::size_of::<itimer_s>() - 64usize];
    ["Alignment of itimer_s"][::std::mem::align_of::<itimer_s>() - 8usize];
    ["Offset of field: itimer_s::tp"][::std::mem::offset_of!(itimer_s, tp) - 0usize];
    ["Offset of field: itimer_s::weak"][::std::mem::offset_of!(itimer_s, weak) - 4usize];
    ["Offset of field: itimer_s::extime"][::std::mem::offset_of!(itimer_s, extime) - 8usize];
    ["Offset of field: itimer_s::name"][::std::mem::offset_of!(itimer_s, name) - 16usize];
    ["Offset of field: itimer_s::context"][::std::mem::offset_of!(itimer_s, context) - 48usize];
    ["Offset of field: itimer_s::lastchecktime"]
        [::std::mem::offset_of!(itimer_s, lastchecktime) - 56usize];
};
pub type itimer = itimer_s;
pub const iepub3data_type_s_kEPUB3DataTypeNone: iepub3data_type_s = 0;
pub const iepub3data_type_s_kEPUB3TitleTypeMain: iepub3data_type_s = 1;
pub const iepub3data_type_s_kEPUB3TitleTypeSubtitle: iepub3data_type_s = 2;
pub const iepub3data_type_s_kEPUB3TitleTypeShort: iepub3data_type_s = 3;
pub const iepub3data_type_s_kEPUB3TitleTypeCollection: iepub3data_type_s = 4;
pub const iepub3data_type_s_kEPUB3TitleTypeEdition: iepub3data_type_s = 5;
pub const iepub3data_type_s_kEPUB3TitleTypeExpanded: iepub3data_type_s = 6;
pub const iepub3data_type_s_kEPUB3TitleTypeUnknown: iepub3data_type_s = 7;
pub const iepub3data_type_s_kEPUB3TitleTypeMAX: iepub3data_type_s = 8;
pub const iepub3data_type_s_kEPUB3AuthorType: iepub3data_type_s = 101;
pub const iepub3data_type_s_kEPUB3SeriesType: iepub3data_type_s = 201;
pub type iepub3data_type_s = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iepub3title_s {
    pub title: *mut ::std::os::raw::c_char,
    pub display_seq: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iepub3title_s"][::std::mem::size_of::<iepub3title_s>() - 8usize];
    ["Alignment of iepub3title_s"][::std::mem::align_of::<iepub3title_s>() - 4usize];
    ["Offset of field: iepub3title_s::title"]
        [::std::mem::offset_of!(iepub3title_s, title) - 0usize];
    ["Offset of field: iepub3title_s::display_seq"]
        [::std::mem::offset_of!(iepub3title_s, display_seq) - 4usize];
    ["Offset of field: iepub3title_s::type_"]
        [::std::mem::offset_of!(iepub3title_s, type_) - 6usize];
};
pub type iepub3title = iepub3title_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bookinfo_s {
    pub type_: ::std::os::raw::c_int,
    pub typedesc: *mut ::std::os::raw::c_char,
    pub path: *mut ::std::os::raw::c_char,
    pub filename: *mut ::std::os::raw::c_char,
    pub title: *mut ::std::os::raw::c_char,
    pub author: *mut ::std::os::raw::c_char,
    pub series: *mut ::std::os::raw::c_char,
    pub numinseries: ::std::os::raw::c_int,
    pub genre: [*mut ::std::os::raw::c_char; 10usize],
    pub icon: *mut ibitmap,
    pub year: ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_long,
    pub ctime: time_t,
    pub isbn: *mut ::std::os::raw::c_char,
    pub meta_id: *mut ::std::os::raw::c_char,
    pub first_author: *mut ::std::os::raw::c_char,
    pub drm: ::std::os::raw::c_int,
    pub annotation: *mut ::std::os::raw::c_char,
    pub lang: *mut ::std::os::raw::c_char,
    pub publisher: *mut ::std::os::raw::c_char,
    pub identifiers: *mut ::std::os::raw::c_char,
    pub contains_notes_export: ::std::os::raw::c_int,
    pub epub3titles: *mut *mut iepub3title,
    pub title_sort: *mut ::std::os::raw::c_char,
    pub author_sort: *mut ::std::os::raw::c_char,
    pub version: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bookinfo_s"][::std::mem::size_of::<bookinfo_s>() - 140usize];
    ["Alignment of bookinfo_s"][::std::mem::align_of::<bookinfo_s>() - 4usize];
    ["Offset of field: bookinfo_s::type_"][::std::mem::offset_of!(bookinfo_s, type_) - 0usize];
    ["Offset of field: bookinfo_s::typedesc"]
        [::std::mem::offset_of!(bookinfo_s, typedesc) - 4usize];
    ["Offset of field: bookinfo_s::path"][::std::mem::offset_of!(bookinfo_s, path) - 8usize];
    ["Offset of field: bookinfo_s::filename"]
        [::std::mem::offset_of!(bookinfo_s, filename) - 12usize];
    ["Offset of field: bookinfo_s::title"][::std::mem::offset_of!(bookinfo_s, title) - 16usize];
    ["Offset of field: bookinfo_s::author"][::std::mem::offset_of!(bookinfo_s, author) - 20usize];
    ["Offset of field: bookinfo_s::series"][::std::mem::offset_of!(bookinfo_s, series) - 24usize];
    ["Offset of field: bookinfo_s::numinseries"]
        [::std::mem::offset_of!(bookinfo_s, numinseries) - 28usize];
    ["Offset of field: bookinfo_s::genre"][::std::mem::offset_of!(bookinfo_s, genre) - 32usize];
    ["Offset of field: bookinfo_s::icon"][::std::mem::offset_of!(bookinfo_s, icon) - 72usize];
    ["Offset of field: bookinfo_s::year"][::std::mem::offset_of!(bookinfo_s, year) - 76usize];
    ["Offset of field: bookinfo_s::size"][::std::mem::offset_of!(bookinfo_s, size) - 80usize];
    ["Offset of field: bookinfo_s::ctime"][::std::mem::offset_of!(bookinfo_s, ctime) - 84usize];
    ["Offset of field: bookinfo_s::isbn"][::std::mem::offset_of!(bookinfo_s, isbn) - 88usize];
    ["Offset of field: bookinfo_s::meta_id"][::std::mem::offset_of!(bookinfo_s, meta_id) - 92usize];
    ["Offset of field: bookinfo_s::first_author"]
        [::std::mem::offset_of!(bookinfo_s, first_author) - 96usize];
    ["Offset of field: bookinfo_s::drm"][::std::mem::offset_of!(bookinfo_s, drm) - 100usize];
    ["Offset of field: bookinfo_s::annotation"]
        [::std::mem::offset_of!(bookinfo_s, annotation) - 104usize];
    ["Offset of field: bookinfo_s::lang"][::std::mem::offset_of!(bookinfo_s, lang) - 108usize];
    ["Offset of field: bookinfo_s::publisher"]
        [::std::mem::offset_of!(bookinfo_s, publisher) - 112usize];
    ["Offset of field: bookinfo_s::identifiers"]
        [::std::mem::offset_of!(bookinfo_s, identifiers) - 116usize];
    ["Offset of field: bookinfo_s::contains_notes_export"]
        [::std::mem::offset_of!(bookinfo_s, contains_notes_export) - 120usize];
    ["Offset of field: bookinfo_s::epub3titles"]
        [::std::mem::offset_of!(bookinfo_s, epub3titles) - 124usize];
    ["Offset of field: bookinfo_s::title_sort"]
        [::std::mem::offset_of!(bookinfo_s, title_sort) - 128usize];
    ["Offset of field: bookinfo_s::author_sort"]
        [::std::mem::offset_of!(bookinfo_s, author_sort) - 132usize];
    ["Offset of field: bookinfo_s::version"]
        [::std::mem::offset_of!(bookinfo_s, version) - 136usize];
};
pub type bookinfo = bookinfo_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_filetype_s {
    pub extension: *mut ::std::os::raw::c_char,
    pub description: *mut ::std::os::raw::c_char,
    pub type_: ::std::os::raw::c_int,
    pub program: *mut ::std::os::raw::c_char,
    pub icon: *mut ibitmap,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_filetype_s"][::std::mem::size_of::<iv_filetype_s>() - 20usize];
    ["Alignment of iv_filetype_s"][::std::mem::align_of::<iv_filetype_s>() - 4usize];
    ["Offset of field: iv_filetype_s::extension"]
        [::std::mem::offset_of!(iv_filetype_s, extension) - 0usize];
    ["Offset of field: iv_filetype_s::description"]
        [::std::mem::offset_of!(iv_filetype_s, description) - 4usize];
    ["Offset of field: iv_filetype_s::type_"]
        [::std::mem::offset_of!(iv_filetype_s, type_) - 8usize];
    ["Offset of field: iv_filetype_s::program"]
        [::std::mem::offset_of!(iv_filetype_s, program) - 12usize];
    ["Offset of field: iv_filetype_s::icon"][::std::mem::offset_of!(iv_filetype_s, icon) - 16usize];
};
pub type iv_filetype = iv_filetype_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_template_s {
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub background: *mut ibitmap,
    pub bg_folder: *mut ibitmap,
    pub bg_folder_a: *mut ibitmap,
    pub bg_file: *mut ibitmap,
    pub bg_file_a: *mut ibitmap,
    pub iconpos: irect,
    pub mediaiconpos: irect,
    pub line1pos: irect,
    pub line2pos: irect,
    pub line3pos: irect,
    pub line1font: *mut ifont,
    pub line2font: *mut ifont,
    pub line3font: *mut ifont,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_template_s"][::std::mem::size_of::<iv_template_s>() - 140usize];
    ["Alignment of iv_template_s"][::std::mem::align_of::<iv_template_s>() - 4usize];
    ["Offset of field: iv_template_s::width"]
        [::std::mem::offset_of!(iv_template_s, width) - 0usize];
    ["Offset of field: iv_template_s::height"]
        [::std::mem::offset_of!(iv_template_s, height) - 4usize];
    ["Offset of field: iv_template_s::background"]
        [::std::mem::offset_of!(iv_template_s, background) - 8usize];
    ["Offset of field: iv_template_s::bg_folder"]
        [::std::mem::offset_of!(iv_template_s, bg_folder) - 12usize];
    ["Offset of field: iv_template_s::bg_folder_a"]
        [::std::mem::offset_of!(iv_template_s, bg_folder_a) - 16usize];
    ["Offset of field: iv_template_s::bg_file"]
        [::std::mem::offset_of!(iv_template_s, bg_file) - 20usize];
    ["Offset of field: iv_template_s::bg_file_a"]
        [::std::mem::offset_of!(iv_template_s, bg_file_a) - 24usize];
    ["Offset of field: iv_template_s::iconpos"]
        [::std::mem::offset_of!(iv_template_s, iconpos) - 28usize];
    ["Offset of field: iv_template_s::mediaiconpos"]
        [::std::mem::offset_of!(iv_template_s, mediaiconpos) - 48usize];
    ["Offset of field: iv_template_s::line1pos"]
        [::std::mem::offset_of!(iv_template_s, line1pos) - 68usize];
    ["Offset of field: iv_template_s::line2pos"]
        [::std::mem::offset_of!(iv_template_s, line2pos) - 88usize];
    ["Offset of field: iv_template_s::line3pos"]
        [::std::mem::offset_of!(iv_template_s, line3pos) - 108usize];
    ["Offset of field: iv_template_s::line1font"]
        [::std::mem::offset_of!(iv_template_s, line1font) - 128usize];
    ["Offset of field: iv_template_s::line2font"]
        [::std::mem::offset_of!(iv_template_s, line2font) - 132usize];
    ["Offset of field: iv_template_s::line3font"]
        [::std::mem::offset_of!(iv_template_s, line3font) - 136usize];
};
pub type iv_template = iv_template_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_wlist_s {
    pub word: *mut ::std::os::raw::c_char,
    pub x1: ::std::os::raw::c_short,
    pub y1: ::std::os::raw::c_short,
    pub x2: ::std::os::raw::c_short,
    pub y2: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_wlist_s"][::std::mem::size_of::<iv_wlist_s>() - 12usize];
    ["Alignment of iv_wlist_s"][::std::mem::align_of::<iv_wlist_s>() - 4usize];
    ["Offset of field: iv_wlist_s::word"][::std::mem::offset_of!(iv_wlist_s, word) - 0usize];
    ["Offset of field: iv_wlist_s::x1"][::std::mem::offset_of!(iv_wlist_s, x1) - 4usize];
    ["Offset of field: iv_wlist_s::y1"][::std::mem::offset_of!(iv_wlist_s, y1) - 6usize];
    ["Offset of field: iv_wlist_s::x2"][::std::mem::offset_of!(iv_wlist_s, x2) - 8usize];
    ["Offset of field: iv_wlist_s::y2"][::std::mem::offset_of!(iv_wlist_s, y2) - 10usize];
};
pub type iv_wlist = iv_wlist_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_netinfo_s {
    pub connected: ::std::os::raw::c_int,
    pub name: [::std::os::raw::c_char; 64usize],
    pub device: [::std::os::raw::c_char; 64usize],
    pub security: [::std::os::raw::c_char; 64usize],
    pub prefix: [::std::os::raw::c_char; 64usize],
    pub index: ::std::os::raw::c_int,
    pub atime: ::std::os::raw::c_int,
    pub speed: ::std::os::raw::c_int,
    pub reserved_0e: ::std::os::raw::c_int,
    pub bytes_in: ::std::os::raw::c_ulong,
    pub bytes_out: ::std::os::raw::c_ulong,
    pub packets_in: ::std::os::raw::c_ulong,
    pub packets_out: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_netinfo_s"][::std::mem::size_of::<iv_netinfo_s>() - 292usize];
    ["Alignment of iv_netinfo_s"][::std::mem::align_of::<iv_netinfo_s>() - 4usize];
    ["Offset of field: iv_netinfo_s::connected"]
        [::std::mem::offset_of!(iv_netinfo_s, connected) - 0usize];
    ["Offset of field: iv_netinfo_s::name"][::std::mem::offset_of!(iv_netinfo_s, name) - 4usize];
    ["Offset of field: iv_netinfo_s::device"]
        [::std::mem::offset_of!(iv_netinfo_s, device) - 68usize];
    ["Offset of field: iv_netinfo_s::security"]
        [::std::mem::offset_of!(iv_netinfo_s, security) - 132usize];
    ["Offset of field: iv_netinfo_s::prefix"]
        [::std::mem::offset_of!(iv_netinfo_s, prefix) - 196usize];
    ["Offset of field: iv_netinfo_s::index"]
        [::std::mem::offset_of!(iv_netinfo_s, index) - 260usize];
    ["Offset of field: iv_netinfo_s::atime"]
        [::std::mem::offset_of!(iv_netinfo_s, atime) - 264usize];
    ["Offset of field: iv_netinfo_s::speed"]
        [::std::mem::offset_of!(iv_netinfo_s, speed) - 268usize];
    ["Offset of field: iv_netinfo_s::reserved_0e"]
        [::std::mem::offset_of!(iv_netinfo_s, reserved_0e) - 272usize];
    ["Offset of field: iv_netinfo_s::bytes_in"]
        [::std::mem::offset_of!(iv_netinfo_s, bytes_in) - 276usize];
    ["Offset of field: iv_netinfo_s::bytes_out"]
        [::std::mem::offset_of!(iv_netinfo_s, bytes_out) - 280usize];
    ["Offset of field: iv_netinfo_s::packets_in"]
        [::std::mem::offset_of!(iv_netinfo_s, packets_in) - 284usize];
    ["Offset of field: iv_netinfo_s::packets_out"]
        [::std::mem::offset_of!(iv_netinfo_s, packets_out) - 288usize];
};
pub type iv_netinfo = iv_netinfo_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_sessioninfo_s {
    pub url: *mut ::std::os::raw::c_char,
    pub ctype: *mut ::std::os::raw::c_char,
    pub response: ::std::os::raw::c_long,
    pub length: ::std::os::raw::c_int,
    pub progress: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_sessioninfo_s"][::std::mem::size_of::<iv_sessioninfo_s>() - 20usize];
    ["Alignment of iv_sessioninfo_s"][::std::mem::align_of::<iv_sessioninfo_s>() - 4usize];
    ["Offset of field: iv_sessioninfo_s::url"]
        [::std::mem::offset_of!(iv_sessioninfo_s, url) - 0usize];
    ["Offset of field: iv_sessioninfo_s::ctype"]
        [::std::mem::offset_of!(iv_sessioninfo_s, ctype) - 4usize];
    ["Offset of field: iv_sessioninfo_s::response"]
        [::std::mem::offset_of!(iv_sessioninfo_s, response) - 8usize];
    ["Offset of field: iv_sessioninfo_s::length"]
        [::std::mem::offset_of!(iv_sessioninfo_s, length) - 12usize];
    ["Offset of field: iv_sessioninfo_s::progress"]
        [::std::mem::offset_of!(iv_sessioninfo_s, progress) - 16usize];
};
pub type iv_sessioninfo = iv_sessioninfo_s;
#[repr(C)]
#[derive(Debug)]
pub struct iv_fbinfo_s {
    pub version: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_uint,
    pub shmkey: ::std::os::raw::c_int,
    pub shmsize: ::std::os::raw::c_int,
    pub refkey: ::std::os::raw::c_int,
    pub refsize: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub vdepth: ::std::os::raw::c_int,
    pub orientation: ::std::os::raw::c_int,
    pub scanline_portrait: ::std::os::raw::c_int,
    pub scanline_landscape: ::std::os::raw::c_int,
    pub scanline: ::std::os::raw::c_int,
    pub fb_offset: ::std::os::raw::c_int,
    pub fb_size: ::std::os::raw::c_int,
    pub ev_offset: ::std::os::raw::c_int,
    pub ev_size: ::std::os::raw::c_int,
    pub evhead: ::std::os::raw::c_int,
    pub evtail: ::std::os::raw::c_int,
    pub einkversion: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 15usize],
    pub data: __IncompleteArrayField<::std::os::raw::c_uchar>,
    pub fb_y_offset: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_fbinfo_s"][::std::mem::size_of::<iv_fbinfo_s>() - 144usize];
    ["Alignment of iv_fbinfo_s"][::std::mem::align_of::<iv_fbinfo_s>() - 4usize];
    ["Offset of field: iv_fbinfo_s::version"]
        [::std::mem::offset_of!(iv_fbinfo_s, version) - 0usize];
    ["Offset of field: iv_fbinfo_s::flags"][::std::mem::offset_of!(iv_fbinfo_s, flags) - 4usize];
    ["Offset of field: iv_fbinfo_s::shmkey"][::std::mem::offset_of!(iv_fbinfo_s, shmkey) - 8usize];
    ["Offset of field: iv_fbinfo_s::shmsize"]
        [::std::mem::offset_of!(iv_fbinfo_s, shmsize) - 12usize];
    ["Offset of field: iv_fbinfo_s::refkey"][::std::mem::offset_of!(iv_fbinfo_s, refkey) - 16usize];
    ["Offset of field: iv_fbinfo_s::refsize"]
        [::std::mem::offset_of!(iv_fbinfo_s, refsize) - 20usize];
    ["Offset of field: iv_fbinfo_s::width"][::std::mem::offset_of!(iv_fbinfo_s, width) - 24usize];
    ["Offset of field: iv_fbinfo_s::height"][::std::mem::offset_of!(iv_fbinfo_s, height) - 28usize];
    ["Offset of field: iv_fbinfo_s::vdepth"][::std::mem::offset_of!(iv_fbinfo_s, vdepth) - 32usize];
    ["Offset of field: iv_fbinfo_s::orientation"]
        [::std::mem::offset_of!(iv_fbinfo_s, orientation) - 36usize];
    ["Offset of field: iv_fbinfo_s::scanline_portrait"]
        [::std::mem::offset_of!(iv_fbinfo_s, scanline_portrait) - 40usize];
    ["Offset of field: iv_fbinfo_s::scanline_landscape"]
        [::std::mem::offset_of!(iv_fbinfo_s, scanline_landscape) - 44usize];
    ["Offset of field: iv_fbinfo_s::scanline"]
        [::std::mem::offset_of!(iv_fbinfo_s, scanline) - 48usize];
    ["Offset of field: iv_fbinfo_s::fb_offset"]
        [::std::mem::offset_of!(iv_fbinfo_s, fb_offset) - 52usize];
    ["Offset of field: iv_fbinfo_s::fb_size"]
        [::std::mem::offset_of!(iv_fbinfo_s, fb_size) - 56usize];
    ["Offset of field: iv_fbinfo_s::ev_offset"]
        [::std::mem::offset_of!(iv_fbinfo_s, ev_offset) - 60usize];
    ["Offset of field: iv_fbinfo_s::ev_size"]
        [::std::mem::offset_of!(iv_fbinfo_s, ev_size) - 64usize];
    ["Offset of field: iv_fbinfo_s::evhead"][::std::mem::offset_of!(iv_fbinfo_s, evhead) - 68usize];
    ["Offset of field: iv_fbinfo_s::evtail"][::std::mem::offset_of!(iv_fbinfo_s, evtail) - 72usize];
    ["Offset of field: iv_fbinfo_s::einkversion"]
        [::std::mem::offset_of!(iv_fbinfo_s, einkversion) - 76usize];
    ["Offset of field: iv_fbinfo_s::reserved"]
        [::std::mem::offset_of!(iv_fbinfo_s, reserved) - 80usize];
    ["Offset of field: iv_fbinfo_s::data"][::std::mem::offset_of!(iv_fbinfo_s, data) - 140usize];
    ["Offset of field: iv_fbinfo_s::fb_y_offset"]
        [::std::mem::offset_of!(iv_fbinfo_s, fb_y_offset) - 140usize];
};
pub type iv_fbinfo = iv_fbinfo_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct subtaskinfo_s {
    pub id: ::std::os::raw::c_int,
    pub name: *mut ::std::os::raw::c_char,
    pub book: *mut ::std::os::raw::c_char,
    pub fgindex: ::std::os::raw::c_int,
    pub order: ::std::os::raw::c_int,
    pub rsv_1s: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of subtaskinfo_s"][::std::mem::size_of::<subtaskinfo_s>() - 24usize];
    ["Alignment of subtaskinfo_s"][::std::mem::align_of::<subtaskinfo_s>() - 4usize];
    ["Offset of field: subtaskinfo_s::id"][::std::mem::offset_of!(subtaskinfo_s, id) - 0usize];
    ["Offset of field: subtaskinfo_s::name"][::std::mem::offset_of!(subtaskinfo_s, name) - 4usize];
    ["Offset of field: subtaskinfo_s::book"][::std::mem::offset_of!(subtaskinfo_s, book) - 8usize];
    ["Offset of field: subtaskinfo_s::fgindex"]
        [::std::mem::offset_of!(subtaskinfo_s, fgindex) - 12usize];
    ["Offset of field: subtaskinfo_s::order"]
        [::std::mem::offset_of!(subtaskinfo_s, order) - 16usize];
    ["Offset of field: subtaskinfo_s::rsv_1s"]
        [::std::mem::offset_of!(subtaskinfo_s, rsv_1s) - 20usize];
};
pub type subtaskinfo = subtaskinfo_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct taskinfo_s {
    pub task: ::std::os::raw::c_int,
    pub nsubtasks: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_uint,
    pub fbshmkey: ::std::os::raw::c_int,
    pub fbshmsize: ::std::os::raw::c_int,
    pub mainpid: pid_t,
    pub appname: *mut ::std::os::raw::c_char,
    pub icon: *mut ibitmap,
    pub subtasks: *mut subtaskinfo,
    pub fbtempkey: ::std::os::raw::c_int,
    pub rsv_2: ::std::os::raw::c_int,
    pub rsv_3: ::std::os::raw::c_int,
    pub rsv_4: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of taskinfo_s"][::std::mem::size_of::<taskinfo_s>() - 52usize];
    ["Alignment of taskinfo_s"][::std::mem::align_of::<taskinfo_s>() - 4usize];
    ["Offset of field: taskinfo_s::task"][::std::mem::offset_of!(taskinfo_s, task) - 0usize];
    ["Offset of field: taskinfo_s::nsubtasks"]
        [::std::mem::offset_of!(taskinfo_s, nsubtasks) - 4usize];
    ["Offset of field: taskinfo_s::flags"][::std::mem::offset_of!(taskinfo_s, flags) - 8usize];
    ["Offset of field: taskinfo_s::fbshmkey"]
        [::std::mem::offset_of!(taskinfo_s, fbshmkey) - 12usize];
    ["Offset of field: taskinfo_s::fbshmsize"]
        [::std::mem::offset_of!(taskinfo_s, fbshmsize) - 16usize];
    ["Offset of field: taskinfo_s::mainpid"][::std::mem::offset_of!(taskinfo_s, mainpid) - 20usize];
    ["Offset of field: taskinfo_s::appname"][::std::mem::offset_of!(taskinfo_s, appname) - 24usize];
    ["Offset of field: taskinfo_s::icon"][::std::mem::offset_of!(taskinfo_s, icon) - 28usize];
    ["Offset of field: taskinfo_s::subtasks"]
        [::std::mem::offset_of!(taskinfo_s, subtasks) - 32usize];
    ["Offset of field: taskinfo_s::fbtempkey"]
        [::std::mem::offset_of!(taskinfo_s, fbtempkey) - 36usize];
    ["Offset of field: taskinfo_s::rsv_2"][::std::mem::offset_of!(taskinfo_s, rsv_2) - 40usize];
    ["Offset of field: taskinfo_s::rsv_3"][::std::mem::offset_of!(taskinfo_s, rsv_3) - 44usize];
    ["Offset of field: taskinfo_s::rsv_4"][::std::mem::offset_of!(taskinfo_s, rsv_4) - 48usize];
};
pub type taskinfo = taskinfo_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_mtinfo_s {
    pub active: bool,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub pressure: ::std::os::raw::c_int,
    pub devtype: input_dev_e,
    pub timems: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_mtinfo_s"][::std::mem::size_of::<iv_mtinfo_s>() - 32usize];
    ["Alignment of iv_mtinfo_s"][::std::mem::align_of::<iv_mtinfo_s>() - 8usize];
    ["Offset of field: iv_mtinfo_s::active"][::std::mem::offset_of!(iv_mtinfo_s, active) - 0usize];
    ["Offset of field: iv_mtinfo_s::x"][::std::mem::offset_of!(iv_mtinfo_s, x) - 4usize];
    ["Offset of field: iv_mtinfo_s::y"][::std::mem::offset_of!(iv_mtinfo_s, y) - 8usize];
    ["Offset of field: iv_mtinfo_s::pressure"]
        [::std::mem::offset_of!(iv_mtinfo_s, pressure) - 12usize];
    ["Offset of field: iv_mtinfo_s::devtype"]
        [::std::mem::offset_of!(iv_mtinfo_s, devtype) - 16usize];
    ["Offset of field: iv_mtinfo_s::timems"][::std::mem::offset_of!(iv_mtinfo_s, timems) - 24usize];
};
pub type iv_mtinfo = iv_mtinfo_s;
pub type iv_mtinfo_section = [iv_mtinfo; 2usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apinfo_s {
    pub ssid: [::std::os::raw::c_char; 64usize],
    pub mode: ::std::os::raw::c_int,
    pub channel: ::std::os::raw::c_int,
    pub security: WIFI_SECURITY,
    pub quality: ::std::os::raw::c_int,
    pub level: ::std::os::raw::c_int,
    pub noise: ::std::os::raw::c_int,
    pub mac: [::std::os::raw::c_uchar; 8usize],
    pub timestamp: time_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of apinfo_s"][::std::mem::size_of::<apinfo_s>() - 100usize];
    ["Alignment of apinfo_s"][::std::mem::align_of::<apinfo_s>() - 4usize];
    ["Offset of field: apinfo_s::ssid"][::std::mem::offset_of!(apinfo_s, ssid) - 0usize];
    ["Offset of field: apinfo_s::mode"][::std::mem::offset_of!(apinfo_s, mode) - 64usize];
    ["Offset of field: apinfo_s::channel"][::std::mem::offset_of!(apinfo_s, channel) - 68usize];
    ["Offset of field: apinfo_s::security"][::std::mem::offset_of!(apinfo_s, security) - 72usize];
    ["Offset of field: apinfo_s::quality"][::std::mem::offset_of!(apinfo_s, quality) - 76usize];
    ["Offset of field: apinfo_s::level"][::std::mem::offset_of!(apinfo_s, level) - 80usize];
    ["Offset of field: apinfo_s::noise"][::std::mem::offset_of!(apinfo_s, noise) - 84usize];
    ["Offset of field: apinfo_s::mac"][::std::mem::offset_of!(apinfo_s, mac) - 88usize];
    ["Offset of field: apinfo_s::timestamp"][::std::mem::offset_of!(apinfo_s, timestamp) - 96usize];
};
pub type wifiapinfo = apinfo_s;
#[repr(C)]
#[derive(Debug)]
pub struct wifi_ap_list_s {
    pub ap_quantity: ::std::os::raw::c_int,
    pub apinfo: __IncompleteArrayField<wifiapinfo>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wifi_ap_list_s"][::std::mem::size_of::<wifi_ap_list_s>() - 4usize];
    ["Alignment of wifi_ap_list_s"][::std::mem::align_of::<wifi_ap_list_s>() - 4usize];
    ["Offset of field: wifi_ap_list_s::ap_quantity"]
        [::std::mem::offset_of!(wifi_ap_list_s, ap_quantity) - 0usize];
    ["Offset of field: wifi_ap_list_s::apinfo"]
        [::std::mem::offset_of!(wifi_ap_list_s, apinfo) - 4usize];
};
pub type iv_wifi_ap_list = wifi_ap_list_s;
pub type pointer_to_word_hand_t = ::std::option::Option<
    unsafe extern "C" fn(
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        forward: ::std::os::raw::c_int,
    ) -> *mut iv_wlist,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub union network_interface {
    pub intr: [::std::os::raw::c_char; 8usize],
    pub addr: [::std::os::raw::c_char; 16usize],
    pub hw_addr: [::std::os::raw::c_char; 18usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of network_interface"][::std::mem::size_of::<network_interface>() - 18usize];
    ["Alignment of network_interface"][::std::mem::align_of::<network_interface>() - 1usize];
    ["Offset of field: network_interface::intr"]
        [::std::mem::offset_of!(network_interface, intr) - 0usize];
    ["Offset of field: network_interface::addr"]
        [::std::mem::offset_of!(network_interface, addr) - 0usize];
    ["Offset of field: network_interface::hw_addr"]
        [::std::mem::offset_of!(network_interface, hw_addr) - 0usize];
};
#[repr(C)]
pub struct network_interface_array_s {
    pub count: ::std::os::raw::c_uint,
    pub net_int: __IncompleteArrayField<network_interface>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of network_interface_array_s"]
        [::std::mem::size_of::<network_interface_array_s>() - 4usize];
    ["Alignment of network_interface_array_s"]
        [::std::mem::align_of::<network_interface_array_s>() - 4usize];
    ["Offset of field: network_interface_array_s::count"]
        [::std::mem::offset_of!(network_interface_array_s, count) - 0usize];
    ["Offset of field: network_interface_array_s::net_int"]
        [::std::mem::offset_of!(network_interface_array_s, net_int) - 4usize];
};
pub type network_interface_array = network_interface_array_s;
pub const bt_mode_e_BT_MODE_OFF: bt_mode_e = 0;
pub const bt_mode_e_BT_MODE_HIDDEN: bt_mode_e = 1;
pub const bt_mode_e_BT_MODE_VISIBLE: bt_mode_e = 2;
pub type bt_mode_e = ::std::os::raw::c_uint;
pub use self::bt_mode_e as bt_mode;
pub const bt_state_e_BT_STATE_OFF: bt_state_e = 0;
pub const bt_state_e_BT_STATE_SUSPENDED: bt_state_e = 1;
pub const bt_state_e_BT_STATE_READY: bt_state_e = 2;
pub const bt_state_e_BT_STATE_CONNECTED: bt_state_e = 3;
pub const bt_state_e_BT_STATE_TRANSFERRING: bt_state_e = 4;
pub const bt_state_e_BT_STATE_ERROR: bt_state_e = 5;
pub const bt_state_e_BT_STATE_MAX: bt_state_e = 6;
pub type bt_state_e = ::std::os::raw::c_uint;
pub use self::bt_state_e as bt_state;
pub const bt_flags_e_BT_FLAG_UPDATE_TIMEOUT: bt_flags_e = 1;
pub const bt_flags_e_BT_FLAG_LOW_POWER: bt_flags_e = 2;
pub type bt_flags_e = ::std::os::raw::c_uint;
pub use self::bt_flags_e as bt_flags;
pub const bt_service_e_BT_UNKNOWN: bt_service_e = 0;
pub const bt_service_e_BT_AUTH: bt_service_e = 1;
pub const bt_service_e_BT_OBEX: bt_service_e = 2;
pub const bt_service_e_BT_SECOND_SCREEN: bt_service_e = 3;
pub type bt_service_e = ::std::os::raw::c_uint;
pub const bt_service_state_e_BT_SERVICE_ACTIVE: bt_service_state_e = 0;
pub const bt_service_state_e_BT_SERVICE_CANCEL: bt_service_state_e = 1;
pub const bt_service_state_e_BT_SERVICE_ERROR: bt_service_state_e = 2;
pub type bt_service_state_e = ::std::os::raw::c_uint;
pub const obex_status_e_OBEX_UNKNOWN: obex_status_e = 0;
pub const obex_status_e_OBEX_ERROR: obex_status_e = 1;
pub const obex_status_e_OBEX_REQUEST_AUTH: obex_status_e = 2;
pub const obex_status_e_OBEX_REQUEST_AUTH_DONE: obex_status_e = 3;
pub const obex_status_e_OBEX_TRANSFERRING: obex_status_e = 4;
pub const obex_status_e_OBEX_DONE: obex_status_e = 5;
pub type obex_status_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct obex_service_s {
    pub status: obex_status_e,
    pub auth: ::std::os::raw::c_int,
    pub filesize: ::std::os::raw::c_long,
    pub transferred: ::std::os::raw::c_long,
    pub name: [::std::os::raw::c_char; 128usize],
    pub path: [::std::os::raw::c_char; 256usize],
    pub description: [::std::os::raw::c_char; 128usize],
    pub mimetype: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of obex_service_s"][::std::mem::size_of::<obex_service_s>() - 592usize];
    ["Alignment of obex_service_s"][::std::mem::align_of::<obex_service_s>() - 4usize];
    ["Offset of field: obex_service_s::status"]
        [::std::mem::offset_of!(obex_service_s, status) - 0usize];
    ["Offset of field: obex_service_s::auth"]
        [::std::mem::offset_of!(obex_service_s, auth) - 4usize];
    ["Offset of field: obex_service_s::filesize"]
        [::std::mem::offset_of!(obex_service_s, filesize) - 8usize];
    ["Offset of field: obex_service_s::transferred"]
        [::std::mem::offset_of!(obex_service_s, transferred) - 12usize];
    ["Offset of field: obex_service_s::name"]
        [::std::mem::offset_of!(obex_service_s, name) - 16usize];
    ["Offset of field: obex_service_s::path"]
        [::std::mem::offset_of!(obex_service_s, path) - 144usize];
    ["Offset of field: obex_service_s::description"]
        [::std::mem::offset_of!(obex_service_s, description) - 400usize];
    ["Offset of field: obex_service_s::mimetype"]
        [::std::mem::offset_of!(obex_service_s, mimetype) - 528usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct bt_service_obj_s {
    pub id: ::std::os::raw::c_int,
    pub service: bt_service_e,
    pub state: bt_service_state_e,
    pub lock: ::std::os::raw::c_int,
    pub users: [pid_t; 16usize],
    pub __bindgen_anon_1: bt_service_obj_s__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union bt_service_obj_s__bindgen_ty_1 {
    pub obex: obex_service_s,
    pub service_data: [::std::os::raw::c_char; 1024usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bt_service_obj_s__bindgen_ty_1"]
        [::std::mem::size_of::<bt_service_obj_s__bindgen_ty_1>() - 1024usize];
    ["Alignment of bt_service_obj_s__bindgen_ty_1"]
        [::std::mem::align_of::<bt_service_obj_s__bindgen_ty_1>() - 4usize];
    ["Offset of field: bt_service_obj_s__bindgen_ty_1::obex"]
        [::std::mem::offset_of!(bt_service_obj_s__bindgen_ty_1, obex) - 0usize];
    ["Offset of field: bt_service_obj_s__bindgen_ty_1::service_data"]
        [::std::mem::offset_of!(bt_service_obj_s__bindgen_ty_1, service_data) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bt_service_obj_s"][::std::mem::size_of::<bt_service_obj_s>() - 1104usize];
    ["Alignment of bt_service_obj_s"][::std::mem::align_of::<bt_service_obj_s>() - 4usize];
    ["Offset of field: bt_service_obj_s::id"]
        [::std::mem::offset_of!(bt_service_obj_s, id) - 0usize];
    ["Offset of field: bt_service_obj_s::service"]
        [::std::mem::offset_of!(bt_service_obj_s, service) - 4usize];
    ["Offset of field: bt_service_obj_s::state"]
        [::std::mem::offset_of!(bt_service_obj_s, state) - 8usize];
    ["Offset of field: bt_service_obj_s::lock"]
        [::std::mem::offset_of!(bt_service_obj_s, lock) - 12usize];
    ["Offset of field: bt_service_obj_s::users"]
        [::std::mem::offset_of!(bt_service_obj_s, users) - 16usize];
};
pub type bt_service_obj = bt_service_obj_s;
pub const audio_output_e_AUDIO_OUT_NONE: audio_output_e = 0;
pub const audio_output_e_AUDIO_OUT_HP: audio_output_e = 1;
pub const audio_output_e_AUDIO_OUT_BT: audio_output_e = 2;
pub const audio_output_e_AUDIO_OUT_SPEAKER: audio_output_e = 3;
pub type audio_output_e = ::std::os::raw::c_uint;
pub use self::audio_output_e as audio_output_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct audio_output_info {
    pub type_: audio_output_t,
    pub description: [::std::os::raw::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of audio_output_info"][::std::mem::size_of::<audio_output_info>() - 36usize];
    ["Alignment of audio_output_info"][::std::mem::align_of::<audio_output_info>() - 4usize];
    ["Offset of field: audio_output_info::type_"]
        [::std::mem::offset_of!(audio_output_info, type_) - 0usize];
    ["Offset of field: audio_output_info::description"]
        [::std::mem::offset_of!(audio_output_info, description) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct network_interface_info {
    pub ip_addr: network_interface,
    pub mask: network_interface,
    pub br_addr: network_interface,
    pub hw_addr: network_interface,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of network_interface_info"][::std::mem::size_of::<network_interface_info>() - 72usize];
    ["Alignment of network_interface_info"]
        [::std::mem::align_of::<network_interface_info>() - 1usize];
    ["Offset of field: network_interface_info::ip_addr"]
        [::std::mem::offset_of!(network_interface_info, ip_addr) - 0usize];
    ["Offset of field: network_interface_info::mask"]
        [::std::mem::offset_of!(network_interface_info, mask) - 18usize];
    ["Offset of field: network_interface_info::br_addr"]
        [::std::mem::offset_of!(network_interface_info, br_addr) - 36usize];
    ["Offset of field: network_interface_info::hw_addr"]
        [::std::mem::offset_of!(network_interface_info, hw_addr) - 54usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct icolor_map_s {
    pub from_color: *mut ::std::os::raw::c_int,
    pub to_color: *mut ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of icolor_map_s"][::std::mem::size_of::<icolor_map_s>() - 12usize];
    ["Alignment of icolor_map_s"][::std::mem::align_of::<icolor_map_s>() - 4usize];
    ["Offset of field: icolor_map_s::from_color"]
        [::std::mem::offset_of!(icolor_map_s, from_color) - 0usize];
    ["Offset of field: icolor_map_s::to_color"]
        [::std::mem::offset_of!(icolor_map_s, to_color) - 4usize];
    ["Offset of field: icolor_map_s::size"][::std::mem::offset_of!(icolor_map_s, size) - 8usize];
};
pub type icolor_map = icolor_map_s;
#[doc = "< application is a reader, affects behavior of panel\n for proper work, set this attribute before first acces to panel API"]
pub const APPLICATION_ATTRIBUTE_APPLICATION_READER: APPLICATION_ATTRIBUTE = 0;
#[doc = "< maximal value of the attribute"]
pub const APPLICATION_ATTRIBUTE_APPLICATION_ATTRIBUTE_MAX: APPLICATION_ATTRIBUTE = 31;
#[doc = " Enum APPLICATION_ATTRIBUTE wich can be used for setting current application attributes\n @see SetCurrentApplicationAttribute, TestCurrentApplicationAttribute"]
pub type APPLICATION_ATTRIBUTE = ::std::os::raw::c_uint;
pub const default_orientation_type_e_ORIENTATION_TYPE_AUTO: default_orientation_type_e = -1;
pub const default_orientation_type_e_ORIENTATION_TYPE_SELF: default_orientation_type_e = -2;
pub type default_orientation_type_e = ::std::os::raw::c_int;
pub use self::default_orientation_type_e as default_orientation_type;
pub const iv_orientation_UpOrientation: iv_orientation = 0;
pub const iv_orientation_RightOrientation: iv_orientation = 1;
pub const iv_orientation_LeftOrientation: iv_orientation = 2;
pub const iv_orientation_DownOrientation: iv_orientation = 3;
pub type iv_orientation = ::std::os::raw::c_uint;
pub const eside_SIDE_NONE: eside = 0;
pub const eside_SIDE_LEFT: eside = 1;
pub const eside_SIDE_RIGHT: eside = 2;
pub const eside_SIDE_TOP: eside = 4;
pub const eside_SIDE_BOTTOM: eside = 8;
pub const eside_SIDE_ALL: eside = 15;
pub type eside = ::std::os::raw::c_uint;
pub const edef_thickness_THICKNESS_DEF_NONE: edef_thickness = 0;
pub const edef_thickness_THICKNESS_DEF_SINGLE: edef_thickness = -1;
pub const edef_thickness_THICKNESS_DEF_FOCUSED_FRAME: edef_thickness = -2;
pub const edef_thickness_THICKNESS_DEF_DIALOG_FRAME: edef_thickness = -3;
pub const edef_thickness_THICKNESS_DEF_MENU_BORDER: edef_thickness = -4;
pub const edef_thickness_THICKNESS_DEF_DOUBLE: edef_thickness = -5;
pub const edef_thickness_THICKNESS_DEF_MAX: edef_thickness = -8;
pub const edef_thickness_RADIUS_DEPEND_ON_THICKNESS: edef_thickness = -100;
pub type edef_thickness = ::std::os::raw::c_int;
pub const estyle_ROUND_NONE: estyle = 0;
pub const estyle_ROUND_TOP_LEFT: estyle = 1;
pub const estyle_ROUND_TOP_RIGHT: estyle = 2;
pub const estyle_ROUND_BOTTOM_LEFT: estyle = 4;
pub const estyle_ROUND_BOTTOM_RIGHT: estyle = 8;
pub const estyle_ROUND_TOP: estyle = 3;
pub const estyle_ROUND_DOWN: estyle = 12;
pub const estyle_ROUND_LEFT: estyle = 5;
pub const estyle_ROUND_RIGHT: estyle = 10;
pub const estyle_ROUND_ALL: estyle = 15;
pub const estyle_ROUND_FILL_INSIDE: estyle = 16;
pub const estyle_ROUND_FILL_OUTSIDE_BG: estyle = 32;
pub const estyle_ROUND_BLEND_SRC_INSIDE: estyle = 64;
pub const estyle_ROUND_BLEND_SRC_OUTSIDE: estyle = 128;
pub const estyle_ROUND_DRAW_CIRCLE_BLACK_WHITE: estyle = 256;
pub const estyle_ROUND_DEFAULT: estyle = 15;
pub type estyle = ::std::os::raw::c_uint;
pub const egradient_GRADIENT_NONE: egradient = 0;
pub const egradient_GRADIENT_UP_DOWN: egradient = 1;
pub const egradient_GRADIENT_DOWN_UP: egradient = 2;
pub const egradient_GRADIENT_LEFT_RIGHT: egradient = 4;
pub const egradient_GRADIENT_RIGHT_LEFT: egradient = 8;
pub type egradient = ::std::os::raw::c_uint;
pub const HorizontalSeparatorType_HORIZONTAL_SEPARATOR_SOLID: HorizontalSeparatorType = 0;
pub const HorizontalSeparatorType_HORIZONTAL_SEPARATOR_DOTTED: HorizontalSeparatorType = 1;
pub type HorizontalSeparatorType = ::std::os::raw::c_uint;
pub const PixelFormat_e_kFmtGrayscale8: PixelFormat_e = 0;
pub const PixelFormat_e_kFmtRGB24: PixelFormat_e = 1;
pub type PixelFormat_e = ::std::os::raw::c_uint;
pub use self::PixelFormat_e as PixelFormat;
pub const ImageSignatureType_e_kImgTypeUnknown: ImageSignatureType_e = 0;
pub const ImageSignatureType_e_kImgTypeBMP: ImageSignatureType_e = 1;
pub const ImageSignatureType_e_kImgTypeGIF: ImageSignatureType_e = 2;
pub const ImageSignatureType_e_kImgTypeJPG: ImageSignatureType_e = 3;
pub const ImageSignatureType_e_kImgTypePNG: ImageSignatureType_e = 4;
pub const ImageSignatureType_e_kImgTypeTIFF: ImageSignatureType_e = 5;
pub type ImageSignatureType_e = ::std::os::raw::c_uint;
pub use self::ImageSignatureType_e as ImageSignatureType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AdjustmentParams_s {
    pub lab_saturation_koef: f64,
    pub vibrance: f64,
    pub saturation_table: [::std::os::raw::c_int; 256usize],
    pub value_table: [::std::os::raw::c_int; 256usize],
    pub brightness: f64,
    pub contrast: f64,
    pub gamma: f64,
    pub saturation: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AdjustmentParams_s"][::std::mem::size_of::<AdjustmentParams_s>() - 2096usize];
    ["Alignment of AdjustmentParams_s"][::std::mem::align_of::<AdjustmentParams_s>() - 8usize];
    ["Offset of field: AdjustmentParams_s::lab_saturation_koef"]
        [::std::mem::offset_of!(AdjustmentParams_s, lab_saturation_koef) - 0usize];
    ["Offset of field: AdjustmentParams_s::vibrance"]
        [::std::mem::offset_of!(AdjustmentParams_s, vibrance) - 8usize];
    ["Offset of field: AdjustmentParams_s::saturation_table"]
        [::std::mem::offset_of!(AdjustmentParams_s, saturation_table) - 16usize];
    ["Offset of field: AdjustmentParams_s::value_table"]
        [::std::mem::offset_of!(AdjustmentParams_s, value_table) - 1040usize];
    ["Offset of field: AdjustmentParams_s::brightness"]
        [::std::mem::offset_of!(AdjustmentParams_s, brightness) - 2064usize];
    ["Offset of field: AdjustmentParams_s::contrast"]
        [::std::mem::offset_of!(AdjustmentParams_s, contrast) - 2072usize];
    ["Offset of field: AdjustmentParams_s::gamma"]
        [::std::mem::offset_of!(AdjustmentParams_s, gamma) - 2080usize];
    ["Offset of field: AdjustmentParams_s::saturation"]
        [::std::mem::offset_of!(AdjustmentParams_s, saturation) - 2088usize];
};
pub type AdjustmentParams = AdjustmentParams_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FontForSort_s {
    pub name: *mut ::std::os::raw::c_char,
    pub flags: ::std::os::raw::c_int,
    pub font: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FontForSort_s"][::std::mem::size_of::<FontForSort_s>() - 12usize];
    ["Alignment of FontForSort_s"][::std::mem::align_of::<FontForSort_s>() - 4usize];
    ["Offset of field: FontForSort_s::name"][::std::mem::offset_of!(FontForSort_s, name) - 0usize];
    ["Offset of field: FontForSort_s::flags"]
        [::std::mem::offset_of!(FontForSort_s, flags) - 4usize];
    ["Offset of field: FontForSort_s::font"][::std::mem::offset_of!(FontForSort_s, font) - 8usize];
};
pub type FontForSort = FontForSort_s;
pub type keyboard_text_change_callback = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        commit_string: *const ::std::os::raw::c_char,
        text_before: *const ::std::os::raw::c_char,
        replace_from: ::std::os::raw::c_int,
        replace_length: ::std::os::raw::c_int,
    ),
>;
pub type iv_panel_type_change_handler = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: PANEL_FLAGS),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_set_request_listener_ex_result {
    pub status: ::std::os::raw::c_int,
    pub ctx: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_set_request_listener_ex_result"]
        [::std::mem::size_of::<iv_set_request_listener_ex_result>() - 8usize];
    ["Alignment of iv_set_request_listener_ex_result"]
        [::std::mem::align_of::<iv_set_request_listener_ex_result>() - 4usize];
    ["Offset of field: iv_set_request_listener_ex_result::status"]
        [::std::mem::offset_of!(iv_set_request_listener_ex_result, status) - 0usize];
    ["Offset of field: iv_set_request_listener_ex_result::ctx"]
        [::std::mem::offset_of!(iv_set_request_listener_ex_result, ctx) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iprofile_s {
    pub name: *mut ::std::os::raw::c_char,
    pub path: *mut ::std::os::raw::c_char,
    pub type_: ::std::os::raw::c_int,
    pub avatar: *mut ibitmap,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iprofile_s"][::std::mem::size_of::<iprofile_s>() - 16usize];
    ["Alignment of iprofile_s"][::std::mem::align_of::<iprofile_s>() - 4usize];
    ["Offset of field: iprofile_s::name"][::std::mem::offset_of!(iprofile_s, name) - 0usize];
    ["Offset of field: iprofile_s::path"][::std::mem::offset_of!(iprofile_s, path) - 4usize];
    ["Offset of field: iprofile_s::type_"][::std::mem::offset_of!(iprofile_s, type_) - 8usize];
    ["Offset of field: iprofile_s::avatar"][::std::mem::offset_of!(iprofile_s, avatar) - 12usize];
};
pub type iprofile = iprofile_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iprofiles_s {
    pub profile: *mut iprofile,
    pub count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iprofiles_s"][::std::mem::size_of::<iprofiles_s>() - 8usize];
    ["Alignment of iprofiles_s"][::std::mem::align_of::<iprofiles_s>() - 4usize];
    ["Offset of field: iprofiles_s::profile"]
        [::std::mem::offset_of!(iprofiles_s, profile) - 0usize];
    ["Offset of field: iprofiles_s::count"][::std::mem::offset_of!(iprofiles_s, count) - 4usize];
};
pub type iprofiles = iprofiles_s;
pub const MencaFileStatus_e_kMencaNoStatus: MencaFileStatus_e = 0;
pub const MencaFileStatus_e_kMencaInCloud: MencaFileStatus_e = 1;
pub const MencaFileStatus_e_kMencaSyncing: MencaFileStatus_e = 2;
pub const MencaFileStatus_e_kMencaDownloaded: MencaFileStatus_e = 3;
pub type MencaFileStatus_e = ::std::os::raw::c_uint;
pub use self::MencaFileStatus_e as MencaFileStatus;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BookSyncStatus_s {
    pub menca_status_: MencaFileStatus,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BookSyncStatus_s"][::std::mem::size_of::<BookSyncStatus_s>() - 4usize];
    ["Alignment of BookSyncStatus_s"][::std::mem::align_of::<BookSyncStatus_s>() - 4usize];
    ["Offset of field: BookSyncStatus_s::menca_status_"]
        [::std::mem::offset_of!(BookSyncStatus_s, menca_status_) - 0usize];
};
pub type BookSyncStatus = BookSyncStatus_s;
pub const AudioPlayerType_e_kAudioPlayer: AudioPlayerType_e = 1;
pub const AudioPlayerType_e_kAudioBooks: AudioPlayerType_e = 2;
pub const AudioPlayerType_e_kBrowser: AudioPlayerType_e = 4;
pub const AudioPlayerType_e_kReaderPlayer: AudioPlayerType_e = 8;
pub type AudioPlayerType_e = ::std::os::raw::c_uint;
pub use self::AudioPlayerType_e as AudioPlayerType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AudioPlayingInfo_s {
    pub type_: AudioPlayerType,
    pub pid: ::std::os::raw::c_int,
    pub title: [::std::os::raw::c_char; 512usize],
    pub author: [::std::os::raw::c_char; 512usize],
    pub duration: [::std::os::raw::c_char; 32usize],
    pub percent: ::std::os::raw::c_int,
    pub play_state: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AudioPlayingInfo_s"][::std::mem::size_of::<AudioPlayingInfo_s>() - 1072usize];
    ["Alignment of AudioPlayingInfo_s"][::std::mem::align_of::<AudioPlayingInfo_s>() - 4usize];
    ["Offset of field: AudioPlayingInfo_s::type_"]
        [::std::mem::offset_of!(AudioPlayingInfo_s, type_) - 0usize];
    ["Offset of field: AudioPlayingInfo_s::pid"]
        [::std::mem::offset_of!(AudioPlayingInfo_s, pid) - 4usize];
    ["Offset of field: AudioPlayingInfo_s::title"]
        [::std::mem::offset_of!(AudioPlayingInfo_s, title) - 8usize];
    ["Offset of field: AudioPlayingInfo_s::author"]
        [::std::mem::offset_of!(AudioPlayingInfo_s, author) - 520usize];
    ["Offset of field: AudioPlayingInfo_s::duration"]
        [::std::mem::offset_of!(AudioPlayingInfo_s, duration) - 1032usize];
    ["Offset of field: AudioPlayingInfo_s::percent"]
        [::std::mem::offset_of!(AudioPlayingInfo_s, percent) - 1064usize];
    ["Offset of field: AudioPlayingInfo_s::play_state"]
        [::std::mem::offset_of!(AudioPlayingInfo_s, play_state) - 1068usize];
};
pub type AudioPlayingInfo = AudioPlayingInfo_s;
pub const iv_start_software_update_result_e_SWU_NOT_ENOUGH_POWER:
    iv_start_software_update_result_e = 0;
pub const iv_start_software_update_result_e_SWU_TIMEOUT: iv_start_software_update_result_e = 1;
pub const iv_start_software_update_result_e_SWU_NOT_AVAILEBLE_ON_EMULATOR:
    iv_start_software_update_result_e = 2;
pub type iv_start_software_update_result_e = ::std::os::raw::c_uint;
pub use self::iv_start_software_update_result_e as iv_start_software_update_result;
pub const eBubbleTypes_kBTInfo: eBubbleTypes = 0;
pub const eBubbleTypes_kBTAttention: eBubbleTypes = 1;
pub const eBubbleTypes_kBTWarning: eBubbleTypes = 2;
pub const eBubbleTypes_kBTQuestion: eBubbleTypes = 3;
pub const eBubbleTypes_kBTButton: eBubbleTypes = 4;
pub type eBubbleTypes = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct icustombubble_s {
    pub type_: ::std::os::raw::c_int,
    pub bubble_pos: irect,
    pub arrow_pos: irect,
    pub arrow_bmp: *mut ibitmap,
    pub icon_bmp: *mut ibitmap,
    pub text_pos: irect,
    pub font: *mut ifont,
    pub text: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of icustombubble_s"][::std::mem::size_of::<icustombubble_s>() - 80usize];
    ["Alignment of icustombubble_s"][::std::mem::align_of::<icustombubble_s>() - 4usize];
    ["Offset of field: icustombubble_s::type_"]
        [::std::mem::offset_of!(icustombubble_s, type_) - 0usize];
    ["Offset of field: icustombubble_s::bubble_pos"]
        [::std::mem::offset_of!(icustombubble_s, bubble_pos) - 4usize];
    ["Offset of field: icustombubble_s::arrow_pos"]
        [::std::mem::offset_of!(icustombubble_s, arrow_pos) - 24usize];
    ["Offset of field: icustombubble_s::arrow_bmp"]
        [::std::mem::offset_of!(icustombubble_s, arrow_bmp) - 44usize];
    ["Offset of field: icustombubble_s::icon_bmp"]
        [::std::mem::offset_of!(icustombubble_s, icon_bmp) - 48usize];
    ["Offset of field: icustombubble_s::text_pos"]
        [::std::mem::offset_of!(icustombubble_s, text_pos) - 52usize];
    ["Offset of field: icustombubble_s::font"]
        [::std::mem::offset_of!(icustombubble_s, font) - 72usize];
    ["Offset of field: icustombubble_s::text"]
        [::std::mem::offset_of!(icustombubble_s, text) - 76usize];
};
pub type icustombubble = icustombubble_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct icustomhero_s {
    pub pos: irect,
    pub name: *mut ::std::os::raw::c_char,
    pub hero_bmp: *mut ibitmap,
    pub max_bubbles: ::std::os::raw::c_int,
    pub bubbles: *mut *mut irect,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of icustomhero_s"][::std::mem::size_of::<icustomhero_s>() - 36usize];
    ["Alignment of icustomhero_s"][::std::mem::align_of::<icustomhero_s>() - 4usize];
    ["Offset of field: icustomhero_s::pos"][::std::mem::offset_of!(icustomhero_s, pos) - 0usize];
    ["Offset of field: icustomhero_s::name"][::std::mem::offset_of!(icustomhero_s, name) - 20usize];
    ["Offset of field: icustomhero_s::hero_bmp"]
        [::std::mem::offset_of!(icustomhero_s, hero_bmp) - 24usize];
    ["Offset of field: icustomhero_s::max_bubbles"]
        [::std::mem::offset_of!(icustomhero_s, max_bubbles) - 28usize];
    ["Offset of field: icustomhero_s::bubbles"]
        [::std::mem::offset_of!(icustomhero_s, bubbles) - 32usize];
};
pub type icustomhero = icustomhero_s;
pub type iv_custombubbledraw =
    ::std::option::Option<unsafe extern "C" fn(bubble: *mut icustombubble)>;
pub type iv_customherodraw = ::std::option::Option<unsafe extern "C" fn(hero: *mut icustomhero)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct icustomdialog_s {
    pub timeout: ::std::os::raw::c_int,
    pub bubble_count: ::std::os::raw::c_int,
    pub bubbles: *mut *mut icustombubble,
    pub hero: *mut icustomhero,
    pub hero_draw: iv_customherodraw,
    pub bubble_draw: iv_custombubbledraw,
    pub cb_handler: iv_dialoghandler,
    pub cancel_enable_: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of icustomdialog_s"][::std::mem::size_of::<icustomdialog_s>() - 32usize];
    ["Alignment of icustomdialog_s"][::std::mem::align_of::<icustomdialog_s>() - 4usize];
    ["Offset of field: icustomdialog_s::timeout"]
        [::std::mem::offset_of!(icustomdialog_s, timeout) - 0usize];
    ["Offset of field: icustomdialog_s::bubble_count"]
        [::std::mem::offset_of!(icustomdialog_s, bubble_count) - 4usize];
    ["Offset of field: icustomdialog_s::bubbles"]
        [::std::mem::offset_of!(icustomdialog_s, bubbles) - 8usize];
    ["Offset of field: icustomdialog_s::hero"]
        [::std::mem::offset_of!(icustomdialog_s, hero) - 12usize];
    ["Offset of field: icustomdialog_s::hero_draw"]
        [::std::mem::offset_of!(icustomdialog_s, hero_draw) - 16usize];
    ["Offset of field: icustomdialog_s::bubble_draw"]
        [::std::mem::offset_of!(icustomdialog_s, bubble_draw) - 20usize];
    ["Offset of field: icustomdialog_s::cb_handler"]
        [::std::mem::offset_of!(icustomdialog_s, cb_handler) - 24usize];
    ["Offset of field: icustomdialog_s::cancel_enable_"]
        [::std::mem::offset_of!(icustomdialog_s, cancel_enable_) - 28usize];
};
pub type icustomdialog = icustomdialog_s;
pub const proxy_type_e_http: proxy_type_e = 0;
pub const proxy_type_e_socks4: proxy_type_e = 1;
pub const proxy_type_e_socks5: proxy_type_e = 2;
pub type proxy_type_e = ::std::os::raw::c_uint;
pub use self::proxy_type_e as proxy_type;
pub type proxy_settings = ::std::os::raw::c_char;
pub const COVERCACHE_STORAGES_e_CCS_NONE: COVERCACHE_STORAGES_e = 0;
pub const COVERCACHE_STORAGES_e_CCS_ADOBE: COVERCACHE_STORAGES_e = 1;
pub const COVERCACHE_STORAGES_e_CCS_FBREADER: COVERCACHE_STORAGES_e = 2;
pub const COVERCACHE_STORAGES_e_CCS_DJVIEWER: COVERCACHE_STORAGES_e = 3;
pub const COVERCACHE_STORAGES_e_CCS_MAXSTORAGE: COVERCACHE_STORAGES_e = 4;
pub type COVERCACHE_STORAGES_e = ::std::os::raw::c_uint;
pub use self::COVERCACHE_STORAGES_e as COVERCACHE_STORAGES;
pub type usleep_func_t =
    ::std::option::Option<unsafe extern "C" fn(__useconds: __useconds_t) -> ::std::os::raw::c_int>;
pub const eTaskOomPriority_kTaskOomPriorityLow: eTaskOomPriority = 0;
pub const eTaskOomPriority_kTaskOomPriorityNormal: eTaskOomPriority = 1;
pub const eTaskOomPriority_kTaskOomPriorityHigh: eTaskOomPriority = 2;
pub type eTaskOomPriority = ::std::os::raw::c_uint;
pub use self::eTaskOomPriority as TaskOomPriority;
pub const CustomGattSessionStatus_e_GattSessionStatus_uncknown: CustomGattSessionStatus_e = 0;
pub const CustomGattSessionStatus_e_GattSessionStatus_disconnected: CustomGattSessionStatus_e = 1;
pub const CustomGattSessionStatus_e_GattSessionStatus_errorCommon: CustomGattSessionStatus_e = 2;
pub const CustomGattSessionStatus_e_GattSessionStatus_errorConnection: CustomGattSessionStatus_e =
    3;
pub const CustomGattSessionStatus_e_GattSessionStatus_errorService: CustomGattSessionStatus_e = 4;
pub const CustomGattSessionStatus_e_GattSessionStatus_connecting: CustomGattSessionStatus_e = 5;
pub const CustomGattSessionStatus_e_GattSessionStatus_discoveringServices:
    CustomGattSessionStatus_e = 6;
pub const CustomGattSessionStatus_e_GattSessionStatus_connected: CustomGattSessionStatus_e = 7;
pub type CustomGattSessionStatus_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CustomGattSession_s {
    _unused: [u8; 0],
}
pub type CustomGattSession = CustomGattSession_s;
pub const ConfigStorageSlot_t_ConfigStorage_1: ConfigStorageSlot_t = 0;
pub const ConfigStorageSlot_t_ConfigStorage_2: ConfigStorageSlot_t = 1;
pub const ConfigStorageSlot_t_ConfigStorage_3: ConfigStorageSlot_t = 2;
pub const ConfigStorageSlot_t_ConfigStorage_4: ConfigStorageSlot_t = 3;
pub type ConfigStorageSlot_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConfigStorageSert {
    pub sign: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ConfigStorageSert"][::std::mem::size_of::<ConfigStorageSert>() - 64usize];
    ["Alignment of ConfigStorageSert"][::std::mem::align_of::<ConfigStorageSert>() - 1usize];
    ["Offset of field: ConfigStorageSert::sign"]
        [::std::mem::offset_of!(ConfigStorageSert, sign) - 0usize];
};
pub const IocConfigStorageResult_t_IOC_CONFIGSTORAGE_RESULT_FAIL: IocConfigStorageResult_t = 0;
pub const IocConfigStorageResult_t_IOC_CONFIGSTORAGE_RESULT_OK: IocConfigStorageResult_t = 1;
pub type IocConfigStorageResult_t = ::std::os::raw::c_uint;
pub const software_localization_type_e_SLT_UNKNOWN: software_localization_type_e = 0;
pub const software_localization_type_e_SLT_WW: software_localization_type_e = 1;
pub const software_localization_type_e_SLT_RU: software_localization_type_e = 2;
pub const software_localization_type_e_SLT_CIS: software_localization_type_e = 3;
pub const software_localization_type_e_SLT_CN: software_localization_type_e = 4;
pub type software_localization_type_e = ::std::os::raw::c_uint;
pub use self::software_localization_type_e as software_localization_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_sleep_preventor_s {
    pub name: *const ::std::os::raw::c_char,
    pub forbidden: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iv_sleep_preventor_s"][::std::mem::size_of::<iv_sleep_preventor_s>() - 8usize];
    ["Alignment of iv_sleep_preventor_s"][::std::mem::align_of::<iv_sleep_preventor_s>() - 4usize];
    ["Offset of field: iv_sleep_preventor_s::name"]
        [::std::mem::offset_of!(iv_sleep_preventor_s, name) - 0usize];
    ["Offset of field: iv_sleep_preventor_s::forbidden"]
        [::std::mem::offset_of!(iv_sleep_preventor_s, forbidden) - 4usize];
};
pub type iv_sleep_preventor_t = iv_sleep_preventor_s;
pub const iv_app_capability_e_APP_CAPABILITY_SUPPORT_SCREEN_INVERSION: iv_app_capability_e = 1;
pub const iv_app_capability_e_APP_CAPABILITY_USER: iv_app_capability_e = 2;
pub type iv_app_capability_e = ::std::os::raw::c_uint;
pub use self::iv_app_capability_e as iv_app_capability;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_data {
    pub _address: u8,
}
pub struct inkview {
    __library: ::libloading::Library,
    pub _IO_2_1_stdin_: Result<*mut _IO_FILE_plus, ::libloading::Error>,
    pub _IO_2_1_stdout_: Result<*mut _IO_FILE_plus, ::libloading::Error>,
    pub _IO_2_1_stderr_: Result<*mut _IO_FILE_plus, ::libloading::Error>,
    pub stdin: Result<*mut *mut _IO_FILE, ::libloading::Error>,
    pub stdout: Result<*mut *mut _IO_FILE, ::libloading::Error>,
