/* automatically generated by rust-bindgen 0.69.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const MSG_NOERROR: u32 = 4096;
pub const MSG_STAT: u32 = 11;
pub const MSG_INFO: u32 = 12;
pub const MSG_REQUEST: u32 = 2147483647;
pub const MSG_XREQUEST: u32 = 2080374784;
pub const MSG_LAUNCH_APP: u32 = 2113929216;
pub const MSG_OK: u32 = 1;
pub const MSG_ERROR: u32 = 0;
pub const MSG_FORMAT: u32 = 257;
pub const MSG_SETTIME: u32 = 258;
pub const MSG_SETPROFILE: u32 = 259;
pub const MSG_PWENCRYPT: u32 = 260;
pub const MSG_PWDECRYPT: u32 = 261;
pub const MSG_RESTART: u32 = 262;

pub const EVT_PANEL_TASKLIST: u32 = 129;
pub const EVT_PANEL_OBREEY_SYNC: u32 = 130;
pub const EVT_PANEL_SETREADINGMODE: u32 = 131;
pub const EVT_PANEL_SETREADINGMODE_INVERT: u32 = 132;
pub const EVT_PANEL_FRONT_LIGHT: u32 = 133;
pub const EVT_GLOBALREQUEST: u32 = 149;
pub const EVT_GLOBALACTION: u32 = 150;
pub const EVT_FOREGROUND: u32 = 151;
pub const EVT_BACKGROUND: u32 = 152;
pub const EVT_SUBTASKCLOSE: u32 = 153;
pub const EVT_CONFIGCHANGED: u32 = 154;
pub const EVT_SAVESTATE: u32 = 155;
pub const EVT_OBREEY_CONFIG_CHANGED: u32 = 156;
pub const EVT_SDIN: u32 = 161;
pub const EVT_SDOUT: u32 = 162;
pub const EVT_USBSTORE_IN: u32 = 163;
pub const EVT_USBSTORE_OUT: u32 = 164;
pub const EVT_BT_RXCOMPLETE: u32 = 171;
pub const EVT_BT_TXCOMPLETE: u32 = 172;
pub const EVT_SYNTH_ENDED: u32 = 200;
pub const EVT_DIC_CLOSED: u32 = 201;
pub const EVT_SHOW_KEYBOARD: u32 = 202;
pub const EVT_TEXTCLEAR: u32 = 209;
pub const EVT_EXT_KB: u32 = 210;
pub const EVT_LETTER: u32 = 211;
pub const EVT_CALLBACK: u32 = 212;
pub const EVT_SCANPROGRESS: u32 = 213;
pub const EVT_STOPSCAN: u32 = 214;
pub const EVT_STARTSCAN: u32 = 215;
pub const EVT_SCANSTOPPED: u32 = 216;
pub const EVT_POSTPONE_TIMED_POWEROFF: u32 = 217;
pub const EVT_FRAME_ACTIVATED: u32 = 218;
pub const EVT_FRAME_DEACTIVATED: u32 = 219;
pub const EVT_READ_PROGRESS_CHANGED: u32 = 220;
pub const EVT_DUMP_BITMAPS_DEBUG_INFO: u32 = 221;
pub const EVT_NET_CONNECTED: u32 = 256;
pub const EVT_NET_DISCONNECTED: u32 = 257;
pub const EVT_NET_FOUND_NEW_FW: u32 = 260;
pub const EVT_SYNTH_POSITION: u32 = 261;
pub const EVT_ASYNC_TASK_FINISHED: u32 = 262;
pub const EVT_STOP_PLAYING: u32 = 263;
pub const EVT_AVRCP_COMMAND: u32 = 264;
pub const EVT_AUDIO_CHANGED: u32 = 265;
pub const EVT_PACKAGE_JOB_CHANGED: u32 = 266;
pub const EVT_CUSTOM: u32 = 267;
pub type __quad_t = ::std::os::raw::c_longlong;
pub type __u_quad_t = ::std::os::raw::c_ulonglong;
pub type __dev_t = __u_quad_t;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = __quad_t;
pub type __pid_t = ::std::os::raw::c_int;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type FILE = _IO_FILE;
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_marker> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_marker>(),
        12usize,
        concat!("Size of: ", stringify!(_IO_marker))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_marker>(),
        4usize,
        concat!("Alignment of ", stringify!(_IO_marker))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._sbuf) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_sbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pos) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_pos)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        152usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        71usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type mode_t = __mode_t;
pub type pid_t = __pid_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        8usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        4usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        44usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        4usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: __dev_t,
    pub __pad1: ::std::os::raw::c_ushort,
    pub st_ino: __ino_t,
    pub st_mode: __mode_t,
    pub st_nlink: __nlink_t,
    pub st_uid: __uid_t,
    pub st_gid: __gid_t,
    pub st_rdev: __dev_t,
    pub __pad2: ::std::os::raw::c_ushort,
    pub st_size: __off_t,
    pub st_blksize: __blksize_t,
    pub st_blocks: __blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __glibc_reserved4: ::std::os::raw::c_ulong,
    pub __glibc_reserved5: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_stat() {
    const UNINIT: ::std::mem::MaybeUninit<stat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<stat>(),
        88usize,
        concat!("Size of: ", stringify!(stat))
    );
    assert_eq!(
        ::std::mem::align_of::<stat>(),
        8usize,
        concat!("Alignment of ", stringify!(stat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_dev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ino)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_nlink)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_uid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_gid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_rdev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blksize) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blksize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blocks) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_atim) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_atim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mtim) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mtim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ctim) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ctim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__glibc_reserved4) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__glibc_reserved4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__glibc_reserved5) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__glibc_reserved5)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dirent {
    pub d_ino: __ino_t,
    pub d_off: __off_t,
    pub d_reclen: ::std::os::raw::c_ushort,
    pub d_type: ::std::os::raw::c_uchar,
    pub d_name: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_dirent() {
    const UNINIT: ::std::mem::MaybeUninit<dirent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dirent>(),
        268usize,
        concat!("Size of: ", stringify!(dirent))
    );
    assert_eq!(
        ::std::mem::align_of::<dirent>(),
        4usize,
        concat!("Alignment of ", stringify!(dirent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_ino) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_ino)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_off) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_off)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_reclen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_reclen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_type) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_name) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __dirstream {
    _unused: [u8; 0],
}
pub type DIR = __dirstream;
pub type z_crc_t = ::std::os::raw::c_uint;
pub const input_dev_e_DEV_UNKNOWN: input_dev_e = 0;
pub const input_dev_e_TP_CAPACITIVE: input_dev_e = 1;
pub const input_dev_e_TP_DIGITIZER: input_dev_e = 2;
pub const input_dev_e_MAX_INPUT_TOUCH_DEV: input_dev_e = 3;
pub const input_dev_e_INPUT_DEV_KEYBOARD_HW: input_dev_e = 4;
pub const input_dev_e_INPUT_DEV_KEYBOARD_BT: input_dev_e = 5;
pub const input_dev_e_INPUT_DEV_KEYBOARD_USB: input_dev_e = 6;
pub type input_dev_e = ::std::os::raw::c_uint;
pub const keymap_e_KEYMAP_GLOBAL: keymap_e = 0;
pub const keymap_e_KEYMAP_TXT: keymap_e = 1;
pub const keymap_e_KEYMAP_PDF: keymap_e = 2;
pub type keymap_e = ::std::os::raw::c_uint;
pub use self::keymap_e as keymap_t;
pub const WIFI_SECURITY_NO: WIFI_SECURITY = 0;
pub const WIFI_SECURITY_WEP: WIFI_SECURITY = 1;
pub const WIFI_SECURITY_WPAEAP: WIFI_SECURITY = 2;
pub const WIFI_SECURITY_WPAPSK: WIFI_SECURITY = 3;
pub type WIFI_SECURITY = ::std::os::raw::c_uint;
pub const NET_STATE_NET_STATE_UNKNOWN: NET_STATE = -1;
pub const NET_STATE_DISCONNECTED: NET_STATE = 0;
pub const NET_STATE_CONNECTING: NET_STATE = 1;
pub const NET_STATE_CONNECTED: NET_STATE = 2;
pub type NET_STATE = ::std::os::raw::c_int;
pub const FONT_TYPE_FONT_STD: FONT_TYPE = 0;
pub const FONT_TYPE_FONT_BOLD: FONT_TYPE = 1;
pub const FONT_TYPE_FONT_ITALIC: FONT_TYPE = 2;
pub const FONT_TYPE_FONT_BOLDITALIC: FONT_TYPE = 3;
pub const FONT_TYPE_FONT_MONO: FONT_TYPE = 4;
pub const FONT_TYPE_FONT_FAMILY: FONT_TYPE = 5;
pub type FONT_TYPE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct irect_s {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub w: ::std::os::raw::c_int,
    pub h: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_irect_s() {
    const UNINIT: ::std::mem::MaybeUninit<irect_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<irect_s>(),
        20usize,
        concat!("Size of: ", stringify!(irect_s))
    );
    assert_eq!(
        ::std::mem::align_of::<irect_s>(),
        4usize,
        concat!("Alignment of ", stringify!(irect_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(irect_s),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(irect_s),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(irect_s),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(irect_s),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(irect_s),
            "::",
            stringify!(flags)
        )
    );
}
pub type irect = irect_s;
#[repr(C)]
#[derive(Debug)]
pub struct ibitmap_s {
    pub width: ::std::os::raw::c_ushort,
    pub height: ::std::os::raw::c_ushort,
    pub depth: ::std::os::raw::c_ushort,
    pub scanline: ::std::os::raw::c_ushort,
    pub data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[test]
fn bindgen_test_layout_ibitmap_s() {
    const UNINIT: ::std::mem::MaybeUninit<ibitmap_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ibitmap_s>(),
        8usize,
        concat!("Size of: ", stringify!(ibitmap_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ibitmap_s>(),
        2usize,
        concat!("Alignment of ", stringify!(ibitmap_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ibitmap_s),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ibitmap_s),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ibitmap_s),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scanline) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ibitmap_s),
            "::",
            stringify!(scanline)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ibitmap_s),
            "::",
            stringify!(data)
        )
    );
}
pub type ibitmap = ibitmap_s;
#[doc = " Struct wich can be used for function OpenControlPanel\n currently is a stub,\n @see OpenControlPanel(control_panel*)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct control_panel_s {
    #[doc = "< is a SET of flags, currently not used"]
    pub flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_control_panel_s() {
    const UNINIT: ::std::mem::MaybeUninit<control_panel_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<control_panel_s>(),
        4usize,
        concat!("Size of: ", stringify!(control_panel_s))
    );
    assert_eq!(
        ::std::mem::align_of::<control_panel_s>(),
        4usize,
        concat!("Alignment of ", stringify!(control_panel_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(control_panel_s),
            "::",
            stringify!(flags)
        )
    );
}
#[doc = " Struct wich can be used for function OpenControlPanel\n currently is a stub,\n @see OpenControlPanel(control_panel*)"]
pub type control_panel = control_panel_s;
pub type iv_handler = ::std::option::Option<
    unsafe extern "C" fn(
        type_: ::std::os::raw::c_int,
        par1: ::std::os::raw::c_int,
        par2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_menuhandler = ::std::option::Option<unsafe extern "C" fn(index: ::std::os::raw::c_int)>;
pub type iv_keyboardhandler =
    ::std::option::Option<unsafe extern "C" fn(text: *mut ::std::os::raw::c_char)>;
pub type iv_keyboardhandlerex = ::std::option::Option<
    unsafe extern "C" fn(text: *mut ::std::os::raw::c_char, data: *mut ::std::os::raw::c_void),
>;
pub type iv_dialoghandler =
    ::std::option::Option<unsafe extern "C" fn(button: ::std::os::raw::c_int)>;
pub type iv_timeedithandler =
    ::std::option::Option<unsafe extern "C" fn(newtime: ::std::os::raw::c_long)>;
pub type iv_fontselecthandler = ::std::option::Option<
    unsafe extern "C" fn(
        fontr: *mut ::std::os::raw::c_char,
        fontb: *mut ::std::os::raw::c_char,
        fonti: *mut ::std::os::raw::c_char,
        fontbi: *mut ::std::os::raw::c_char,
    ),
>;
pub type iv_dirselecthandler =
    ::std::option::Option<unsafe extern "C" fn(path: *mut ::std::os::raw::c_char)>;
pub type iv_confighandler = ::std::option::Option<unsafe extern "C" fn()>;
pub type iv_itemchangehandler =
    ::std::option::Option<unsafe extern "C" fn(name: *mut ::std::os::raw::c_char)>;
pub type iv_pageselecthandler =
    ::std::option::Option<unsafe extern "C" fn(page: ::std::os::raw::c_int)>;
pub type iv_bmkhandler = ::std::option::Option<
    unsafe extern "C" fn(
        action: ::std::os::raw::c_int,
        page: ::std::os::raw::c_int,
        position: ::std::os::raw::c_longlong,
    ),
>;
pub type iv_listhandler = ::std::option::Option<
    unsafe extern "C" fn(
        action: ::std::os::raw::c_int,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        idx: ::std::os::raw::c_int,
        state: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_rotatehandler =
    ::std::option::Option<unsafe extern "C" fn(direction: ::std::os::raw::c_int)>;
pub type iv_msghandler = ::std::option::Option<
    unsafe extern "C" fn(
        task: ::std::os::raw::c_int,
        message: *mut ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type iv_hashaddproc = ::std::option::Option<
    unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type iv_hashdelproc =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>;
pub type iv_panelupdateshandler = ::std::option::Option<
    unsafe extern "C" fn(
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
        h: ::std::os::raw::c_int,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ihash_item_s {
    pub name: *mut ::std::os::raw::c_char,
    pub value: *mut ::std::os::raw::c_void,
    pub next: *mut ihash_item_s,
}
#[test]
fn bindgen_test_layout_ihash_item_s() {
    const UNINIT: ::std::mem::MaybeUninit<ihash_item_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ihash_item_s>(),
        12usize,
        concat!("Size of: ", stringify!(ihash_item_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ihash_item_s>(),
        4usize,
        concat!("Alignment of ", stringify!(ihash_item_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ihash_item_s),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ihash_item_s),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ihash_item_s),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ihash_s {
    pub prime: ::std::os::raw::c_int,
    pub count: ::std::os::raw::c_int,
    pub addproc: iv_hashaddproc,
    pub delproc: iv_hashdelproc,
    pub items: *mut *mut ihash_item_s,
}
#[test]
fn bindgen_test_layout_ihash_s() {
    const UNINIT: ::std::mem::MaybeUninit<ihash_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ihash_s>(),
        20usize,
        concat!("Size of: ", stringify!(ihash_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ihash_s>(),
        4usize,
        concat!("Alignment of ", stringify!(ihash_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prime) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ihash_s),
            "::",
            stringify!(prime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ihash_s),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addproc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ihash_s),
            "::",
            stringify!(addproc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delproc) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ihash_s),
            "::",
            stringify!(delproc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).items) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ihash_s),
            "::",
            stringify!(items)
        )
    );
}
pub type ihash = ihash_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifont_s {
    pub name: *mut ::std::os::raw::c_char,
    pub family: *mut ::std::os::raw::c_char,
    pub size: ::std::os::raw::c_int,
    pub aa: ::std::os::raw::c_uchar,
    pub isbold: ::std::os::raw::c_uchar,
    pub isitalic: ::std::os::raw::c_uchar,
    pub _r1: ::std::os::raw::c_uchar,
    pub charset: ::std::os::raw::c_ushort,
    pub _r2: ::std::os::raw::c_ushort,
    pub color: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub linespacing: ::std::os::raw::c_int,
    pub baseline: ::std::os::raw::c_int,
    pub fdata: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ifont_s() {
    const UNINIT: ::std::mem::MaybeUninit<ifont_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifont_s>(),
        40usize,
        concat!("Size of: ", stringify!(ifont_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ifont_s>(),
        4usize,
        concat!("Alignment of ", stringify!(ifont_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).family) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aa) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(aa)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isbold) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(isbold)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isitalic) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(isitalic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._r1) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).charset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(charset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._r2) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linespacing) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(linespacing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseline) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(baseline)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fdata) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_s),
            "::",
            stringify!(fdata)
        )
    );
}
pub type ifont = ifont_s;
pub const FONT_MENU_FLAGS_FM_SHOW_SIZE: FONT_MENU_FLAGS = 1;
pub type FONT_MENU_FLAGS = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iuser_font_s {
    pub show_font_name: *mut ::std::os::raw::c_char,
    pub real_font_name: *mut ::std::os::raw::c_char,
    pub font: *mut ifont,
}
#[test]
fn bindgen_test_layout_iuser_font_s() {
    const UNINIT: ::std::mem::MaybeUninit<iuser_font_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iuser_font_s>(),
        12usize,
        concat!("Size of: ", stringify!(iuser_font_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iuser_font_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iuser_font_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).show_font_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iuser_font_s),
            "::",
            stringify!(show_font_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).real_font_name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iuser_font_s),
            "::",
            stringify!(real_font_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).font) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iuser_font_s),
            "::",
            stringify!(font)
        )
    );
}
pub type iuser_font = iuser_font_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifont_list_s {
    pub list: *mut iuser_font,
    pub count: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ifont_list_s() {
    const UNINIT: ::std::mem::MaybeUninit<ifont_list_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifont_list_s>(),
        8usize,
        concat!("Size of: ", stringify!(ifont_list_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ifont_list_s>(),
        4usize,
        concat!("Alignment of ", stringify!(ifont_list_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).list) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_list_s),
            "::",
            stringify!(list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_list_s),
            "::",
            stringify!(count)
        )
    );
}
pub type ifont_list = ifont_list_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifont_menu_s {
    pub menu_title: *mut ::std::os::raw::c_char,
    pub current_font: *mut ::std::os::raw::c_char,
    pub flags: FONT_MENU_FLAGS,
    pub hproc: iv_fontselecthandler,
    pub user_fonts: *mut ifont_list,
}
#[test]
fn bindgen_test_layout_ifont_menu_s() {
    const UNINIT: ::std::mem::MaybeUninit<ifont_menu_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifont_menu_s>(),
        20usize,
        concat!("Size of: ", stringify!(ifont_menu_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ifont_menu_s>(),
        4usize,
        concat!("Alignment of ", stringify!(ifont_menu_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).menu_title) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_menu_s),
            "::",
            stringify!(menu_title)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).current_font) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_menu_s),
            "::",
            stringify!(current_font)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_menu_s),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hproc) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_menu_s),
            "::",
            stringify!(hproc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user_fonts) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_menu_s),
            "::",
            stringify!(user_fonts)
        )
    );
}
pub type ifont_menu = ifont_menu_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imenu_s {
    pub type_: ::std::os::raw::c_short,
    pub index: ::std::os::raw::c_short,
    pub text: *mut ::std::os::raw::c_char,
    pub submenu: *mut imenu_s,
}
#[test]
fn bindgen_test_layout_imenu_s() {
    const UNINIT: ::std::mem::MaybeUninit<imenu_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<imenu_s>(),
        12usize,
        concat!("Size of: ", stringify!(imenu_s))
    );
    assert_eq!(
        ::std::mem::align_of::<imenu_s>(),
        4usize,
        concat!("Alignment of ", stringify!(imenu_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imenu_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(imenu_s),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(imenu_s),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).submenu) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imenu_s),
            "::",
            stringify!(submenu)
        )
    );
}
pub type imenu = imenu_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imenuex_s {
    pub type_: ::std::os::raw::c_short,
    pub index: ::std::os::raw::c_short,
    pub text: *mut ::std::os::raw::c_char,
    pub submenu: *mut imenuex_s,
    pub icon: *mut ibitmap,
    pub reserved: *mut ::std::os::raw::c_void,
    pub font: *const ifont,
}
#[test]
fn bindgen_test_layout_imenuex_s() {
    const UNINIT: ::std::mem::MaybeUninit<imenuex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<imenuex_s>(),
        24usize,
        concat!("Size of: ", stringify!(imenuex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<imenuex_s>(),
        4usize,
        concat!("Alignment of ", stringify!(imenuex_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imenuex_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(imenuex_s),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(imenuex_s),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).submenu) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imenuex_s),
            "::",
            stringify!(submenu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).icon) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(imenuex_s),
            "::",
            stringify!(icon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(imenuex_s),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).font) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(imenuex_s),
            "::",
            stringify!(font)
        )
    );
}
pub type imenuex = imenuex_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct icanvas_s {
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub scanline: ::std::os::raw::c_int,
    pub depth: ::std::os::raw::c_int,
    pub clipx1: ::std::os::raw::c_int,
    pub clipx2: ::std::os::raw::c_int,
    pub clipy1: ::std::os::raw::c_int,
    pub clipy2: ::std::os::raw::c_int,
    pub addr: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_icanvas_s() {
    const UNINIT: ::std::mem::MaybeUninit<icanvas_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<icanvas_s>(),
        36usize,
        concat!("Size of: ", stringify!(icanvas_s))
    );
    assert_eq!(
        ::std::mem::align_of::<icanvas_s>(),
        4usize,
        concat!("Alignment of ", stringify!(icanvas_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(icanvas_s),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(icanvas_s),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scanline) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(icanvas_s),
            "::",
            stringify!(scanline)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(icanvas_s),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clipx1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(icanvas_s),
            "::",
            stringify!(clipx1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clipx2) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(icanvas_s),
            "::",
            stringify!(clipx2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clipy1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(icanvas_s),
            "::",
            stringify!(clipy1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clipy2) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(icanvas_s),
            "::",
            stringify!(clipy2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(icanvas_s),
            "::",
            stringify!(addr)
        )
    );
}
pub type icanvas = icanvas_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct icontext_menu_properties_s {
    pub font_normal: *mut ifont,
    pub font_selected: *mut ifont,
    pub font_disabled: *mut ifont,
    pub background_color_normal: ::std::os::raw::c_int,
    pub background_color_disabled: ::std::os::raw::c_int,
    pub blackout: ::std::os::raw::c_int,
    pub item_height: ::std::os::raw::c_int,
    pub item_border_indent_horizontal: ::std::os::raw::c_int,
    pub separator_indent_horizontal: ::std::os::raw::c_int,
    pub separator_indent_vertical: ::std::os::raw::c_int,
    pub separator_height: ::std::os::raw::c_int,
    pub separator_style: ::std::os::raw::c_int,
    pub separator_color: ::std::os::raw::c_int,
    pub separator_frequency: ::std::os::raw::c_int,
    pub marker_height: ::std::os::raw::c_int,
    pub marker_indent_horizontal: ::std::os::raw::c_int,
    pub marker_style: ::std::os::raw::c_int,
    pub marker_color: ::std::os::raw::c_int,
    pub border_size: ::std::os::raw::c_int,
    pub border_color: ::std::os::raw::c_int,
    pub border_radius: ::std::os::raw::c_int,
    pub title_height: ::std::os::raw::c_int,
    pub enable_pointer: ::std::os::raw::c_int,
    pub font_normal_color: ::std::os::raw::c_int,
    pub font_selected_color: ::std::os::raw::c_int,
    pub font_disabled_color: ::std::os::raw::c_int,
    pub bullet_show: ::std::os::raw::c_int,
    #[doc = " @brief bullet_style - style of bullet element.\n Values:\n 0 - default\n 1 - draw bitmap at all elements\n By default it has been set to zero and it mean that we draw a bullet as a symbol only at one element."]
    pub bullet_style: ::std::os::raw::c_int,
    pub item_border_indent_vertical: ::std::os::raw::c_int,
    pub background_style: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_icontext_menu_properties_s() {
    const UNINIT: ::std::mem::MaybeUninit<icontext_menu_properties_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<icontext_menu_properties_s>(),
        120usize,
        concat!("Size of: ", stringify!(icontext_menu_properties_s))
    );
    assert_eq!(
        ::std::mem::align_of::<icontext_menu_properties_s>(),
        4usize,
        concat!("Alignment of ", stringify!(icontext_menu_properties_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).font_normal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(font_normal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).font_selected) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(font_selected)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).font_disabled) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(font_disabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).background_color_normal) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(background_color_normal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).background_color_disabled) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(background_color_disabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blackout) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(blackout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).item_height) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(item_height)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).item_border_indent_horizontal) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(item_border_indent_horizontal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).separator_indent_horizontal) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(separator_indent_horizontal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).separator_indent_vertical) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(separator_indent_vertical)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).separator_height) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(separator_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).separator_style) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(separator_style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).separator_color) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(separator_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).separator_frequency) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(separator_frequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).marker_height) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(marker_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).marker_indent_horizontal) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(marker_indent_horizontal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).marker_style) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(marker_style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).marker_color) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(marker_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).border_size) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(border_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).border_color) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(border_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).border_radius) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(border_radius)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).title_height) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(title_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable_pointer) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(enable_pointer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).font_normal_color) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(font_normal_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).font_selected_color) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(font_selected_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).font_disabled_color) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(font_disabled_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bullet_show) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(bullet_show)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bullet_style) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(bullet_style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).item_border_indent_vertical) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(item_border_indent_vertical)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).background_style) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_properties_s),
            "::",
            stringify!(background_style)
        )
    );
}
pub type icontext_menu_properties = icontext_menu_properties_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ifont_selector_properties {
    pub custom_font_enable: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_ifont_selector_properties() {
    const UNINIT: ::std::mem::MaybeUninit<ifont_selector_properties> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifont_selector_properties>(),
        2usize,
        concat!("Size of: ", stringify!(ifont_selector_properties))
    );
    assert_eq!(
        ::std::mem::align_of::<ifont_selector_properties>(),
        2usize,
        concat!("Alignment of ", stringify!(ifont_selector_properties))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).custom_font_enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifont_selector_properties),
            "::",
            stringify!(custom_font_enable)
        )
    );
}
pub type font_selector_properties = ifont_selector_properties;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct icontext_menu_s {
    pub id: *const ::std::os::raw::c_char,
    pub hproc: iv_menuhandler,
    pub menuex: *const imenuex,
    pub menu: *const imenu,
    pub pos_selected_item: irect,
    pub pos_menu: irect,
    pub properties: *mut icontext_menu_properties,
    pub active_element: ::std::os::raw::c_int,
    pub enable_pointer: ::std::os::raw::c_short,
    pub enable_aura: ::std::os::raw::c_short,
    pub use_own_font: ::std::os::raw::c_short,
    pub update_after_close: ::std::os::raw::c_short,
    pub only_choise: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_icontext_menu_s() {
    const UNINIT: ::std::mem::MaybeUninit<icontext_menu_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<icontext_menu_s>(),
        76usize,
        concat!("Size of: ", stringify!(icontext_menu_s))
    );
    assert_eq!(
        ::std::mem::align_of::<icontext_menu_s>(),
        4usize,
        concat!("Alignment of ", stringify!(icontext_menu_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hproc) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(hproc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).menuex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(menuex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).menu) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(menu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos_selected_item) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(pos_selected_item)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos_menu) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(pos_menu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).properties) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(properties)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).active_element) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(active_element)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable_pointer) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(enable_pointer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable_aura) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(enable_aura)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_own_font) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(use_own_font)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).update_after_close) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(update_after_close)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).only_choise) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(icontext_menu_s),
            "::",
            stringify!(only_choise)
        )
    );
}
pub type icontext_menu = icontext_menu_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iapp_caption_s {
    pub rect_portrait: irect,
    pub rect_landscape: irect,
    pub font: *mut ifont,
    pub title_height: ::std::os::raw::c_int,
    pub background_color: ::std::os::raw::c_int,
    pub is_active: ::std::os::raw::c_short,
    pub is_uppercase: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_iapp_caption_s() {
    const UNINIT: ::std::mem::MaybeUninit<iapp_caption_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iapp_caption_s>(),
        56usize,
        concat!("Size of: ", stringify!(iapp_caption_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iapp_caption_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iapp_caption_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rect_portrait) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iapp_caption_s),
            "::",
            stringify!(rect_portrait)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rect_landscape) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(iapp_caption_s),
            "::",
            stringify!(rect_landscape)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).font) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(iapp_caption_s),
            "::",
            stringify!(font)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).title_height) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(iapp_caption_s),
            "::",
            stringify!(title_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).background_color) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(iapp_caption_s),
            "::",
            stringify!(background_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_active) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(iapp_caption_s),
            "::",
            stringify!(is_active)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_uppercase) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(iapp_caption_s),
            "::",
            stringify!(is_uppercase)
        )
    );
}
pub type iapp_caption = iapp_caption_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itaskmgr_s {
    pub title_height: ::std::os::raw::c_int,
    pub title_font: *mut ifont,
    pub task_font: *mut ifont,
    pub task_title_font: *mut ifont,
    pub style: ::std::os::raw::c_int,
    pub profile_present: ::std::os::raw::c_int,
    pub profile_height: ::std::os::raw::c_int,
    pub profile_font: *mut ifont,
    pub shortcut_height: ::std::os::raw::c_int,
    pub shortcut_width: ::std::os::raw::c_int,
    pub shortcut_font: *mut ifont,
    pub task_height: ::std::os::raw::c_int,
    pub full_height: ::std::os::raw::c_int,
    pub full_width: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub border_size: ::std::os::raw::c_int,
    pub indent_from_border: ::std::os::raw::c_int,
    pub bitmap: *mut *mut ibitmap,
    pub bitmap_count: ::std::os::raw::c_int,
    pub separator_size: ::std::os::raw::c_int,
    pub exit_button_indent: ::std::os::raw::c_int,
    pub background_style: ::std::os::raw::c_int,
    pub separator_color: ::std::os::raw::c_int,
    pub border_color: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_itaskmgr_s() {
    const UNINIT: ::std::mem::MaybeUninit<itaskmgr_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<itaskmgr_s>(),
        108usize,
        concat!("Size of: ", stringify!(itaskmgr_s))
    );
    assert_eq!(
        ::std::mem::align_of::<itaskmgr_s>(),
        4usize,
        concat!("Alignment of ", stringify!(itaskmgr_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).title_height) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(title_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).title_font) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(title_font)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).task_font) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(task_font)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).task_title_font) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(task_title_font)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).style) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).profile_present) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(profile_present)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).profile_height) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(profile_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).profile_font) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(profile_font)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shortcut_height) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(shortcut_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shortcut_width) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(shortcut_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shortcut_font) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(shortcut_font)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).task_height) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(task_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).full_height) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(full_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).full_width) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(full_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).border_size) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(border_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).indent_from_border) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(indent_from_border)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bitmap) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(bitmap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bitmap_count) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(bitmap_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).separator_size) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(separator_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).exit_button_indent) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(exit_button_indent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).background_style) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(background_style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).separator_color) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(separator_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).border_color) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(itaskmgr_s),
            "::",
            stringify!(border_color)
        )
    );
}
pub type itaskmgr = itaskmgr_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipager_s {
    pub page_font: *mut ifont,
    pub height: ::std::os::raw::c_int,
    pub indent_horizontal: ::std::os::raw::c_int,
    pub left_width: ::std::os::raw::c_int,
    pub page_width: ::std::os::raw::c_int,
    pub rigth_width: ::std::os::raw::c_int,
    pub separator_size: ::std::os::raw::c_int,
    pub separator_color: ::std::os::raw::c_int,
    pub icon_left: *const ibitmap,
    pub icon_right: *const ibitmap,
    pub current_page: ::std::os::raw::c_int,
    pub total_pages: ::std::os::raw::c_int,
    pub position: irect,
    pub orientation: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ipager_s() {
    const UNINIT: ::std::mem::MaybeUninit<ipager_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ipager_s>(),
        72usize,
        concat!("Size of: ", stringify!(ipager_s))
    );
    assert_eq!(
        ::std::mem::align_of::<ipager_s>(),
        4usize,
        concat!("Alignment of ", stringify!(ipager_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).page_font) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(page_font)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).indent_horizontal) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(indent_horizontal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).left_width) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(left_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).page_width) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(page_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rigth_width) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(rigth_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).separator_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(separator_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).separator_color) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(separator_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).icon_left) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(icon_left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).icon_right) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(icon_right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).current_page) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(current_page)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_pages) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(total_pages)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).orientation) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ipager_s),
            "::",
            stringify!(orientation)
        )
    );
}
pub type ipager = ipager_s;
pub const AppStyles_STYLE_UNKNOWN: AppStyles = 0;
pub const AppStyles_STYLE_KEYBOARD: AppStyles = 1;
pub const AppStyles_STYLE_TOUCHPANEL: AppStyles = 2;
pub const AppStyles_STYLE_TOUCHPANEL_KEYBORAD: AppStyles = 3;
pub const AppStyles_STYLE_MAX_NOT_USED: AppStyles = 4;
pub type AppStyles = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iappstyle_s {
    pub app_style: AppStyles,
}
#[test]
fn bindgen_test_layout_iappstyle_s() {
    const UNINIT: ::std::mem::MaybeUninit<iappstyle_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iappstyle_s>(),
        4usize,
        concat!("Size of: ", stringify!(iappstyle_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iappstyle_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iappstyle_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).app_style) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iappstyle_s),
            "::",
            stringify!(app_style)
        )
    );
}
pub type iappstyle = iappstyle_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iconfig_s {
    pub filename: *mut ::std::os::raw::c_char,
    pub hash: *mut ihash,
    pub vhash: *mut ihash,
    pub modified_hash: *mut ihash,
    pub deleted_keys: *mut *mut ::std::os::raw::c_char,
    pub changed: ::std::os::raw::c_int,
    pub deleted_keys_size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_iconfig_s() {
    const UNINIT: ::std::mem::MaybeUninit<iconfig_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iconfig_s>(),
        28usize,
        concat!("Size of: ", stringify!(iconfig_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iconfig_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iconfig_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filename) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfig_s),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfig_s),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vhash) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfig_s),
            "::",
            stringify!(vhash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modified_hash) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfig_s),
            "::",
            stringify!(modified_hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deleted_keys) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfig_s),
            "::",
            stringify!(deleted_keys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).changed) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfig_s),
            "::",
            stringify!(changed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deleted_keys_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfig_s),
            "::",
            stringify!(deleted_keys_size)
        )
    );
}
pub type iconfig = iconfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iconfigedit_s {
    pub type_: ::std::os::raw::c_int,
    pub icon: *const ibitmap,
    pub text: *mut ::std::os::raw::c_char,
    pub hint: *mut ::std::os::raw::c_char,
    pub name: *mut ::std::os::raw::c_char,
    pub deflt: *mut ::std::os::raw::c_char,
    pub variants: *mut *mut ::std::os::raw::c_char,
    pub submenu: *mut iconfigedit_s,
    pub icon_theme: *mut *mut ibitmap,
}
#[test]
fn bindgen_test_layout_iconfigedit_s() {
    const UNINIT: ::std::mem::MaybeUninit<iconfigedit_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iconfigedit_s>(),
        36usize,
        concat!("Size of: ", stringify!(iconfigedit_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iconfigedit_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iconfigedit_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfigedit_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).icon) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfigedit_s),
            "::",
            stringify!(icon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfigedit_s),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hint) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfigedit_s),
            "::",
            stringify!(hint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfigedit_s),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deflt) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfigedit_s),
            "::",
            stringify!(deflt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).variants) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfigedit_s),
            "::",
            stringify!(variants)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).submenu) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfigedit_s),
            "::",
            stringify!(submenu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).icon_theme) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(iconfigedit_s),
            "::",
            stringify!(icon_theme)
        )
    );
}
pub type iconfigedit = iconfigedit_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iepub3title_s {
    pub title: *mut ::std::os::raw::c_char,
    pub display_seq: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_iepub3title_s() {
    const UNINIT: ::std::mem::MaybeUninit<iepub3title_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iepub3title_s>(),
        8usize,
        concat!("Size of: ", stringify!(iepub3title_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iepub3title_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iepub3title_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).title) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iepub3title_s),
            "::",
            stringify!(title)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).display_seq) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iepub3title_s),
            "::",
            stringify!(display_seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(iepub3title_s),
            "::",
            stringify!(type_)
        )
    );
}
pub type iepub3title = iepub3title_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bookinfo_s {
    pub type_: ::std::os::raw::c_int,
    pub typedesc: *mut ::std::os::raw::c_char,
    pub path: *mut ::std::os::raw::c_char,
    pub filename: *mut ::std::os::raw::c_char,
    pub title: *mut ::std::os::raw::c_char,
    pub author: *mut ::std::os::raw::c_char,
    pub series: *mut ::std::os::raw::c_char,
    pub numinseries: ::std::os::raw::c_int,
    pub genre: [*mut ::std::os::raw::c_char; 10usize],
    pub icon: *mut ibitmap,
    pub year: ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_long,
    pub ctime: time_t,
    pub isbn: *mut ::std::os::raw::c_char,
    pub meta_id: *mut ::std::os::raw::c_char,
    pub first_author: *mut ::std::os::raw::c_char,
    pub drm: ::std::os::raw::c_int,
    pub annotation: *mut ::std::os::raw::c_char,
    pub lang: *mut ::std::os::raw::c_char,
    pub publisher: *mut ::std::os::raw::c_char,
    pub identifiers: *mut ::std::os::raw::c_char,
    pub contains_notes_export: ::std::os::raw::c_int,
    pub epub3titles: *mut *mut iepub3title,
    pub title_sort: *mut ::std::os::raw::c_char,
    pub author_sort: *mut ::std::os::raw::c_char,
    pub version: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_bookinfo_s() {
    const UNINIT: ::std::mem::MaybeUninit<bookinfo_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bookinfo_s>(),
        140usize,
        concat!("Size of: ", stringify!(bookinfo_s))
    );
    assert_eq!(
        ::std::mem::align_of::<bookinfo_s>(),
        4usize,
        concat!("Alignment of ", stringify!(bookinfo_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typedesc) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(typedesc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filename) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).title) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(title)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).author) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(author)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).series) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(series)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numinseries) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(numinseries)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).genre) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(genre)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).icon) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(icon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).year) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctime) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(ctime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isbn) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(isbn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).meta_id) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(meta_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).first_author) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(first_author)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).drm) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(drm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).annotation) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(annotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lang) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(lang)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).publisher) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(publisher)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).identifiers) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(identifiers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contains_notes_export) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(contains_notes_export)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).epub3titles) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(epub3titles)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).title_sort) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(title_sort)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).author_sort) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(author_sort)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(bookinfo_s),
            "::",
            stringify!(version)
        )
    );
}
pub type bookinfo = bookinfo_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_filetype_s {
    pub extension: *mut ::std::os::raw::c_char,
    pub description: *mut ::std::os::raw::c_char,
    pub type_: ::std::os::raw::c_int,
    pub program: *mut ::std::os::raw::c_char,
    pub icon: *mut ibitmap,
}
#[test]
fn bindgen_test_layout_iv_filetype_s() {
    const UNINIT: ::std::mem::MaybeUninit<iv_filetype_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iv_filetype_s>(),
        20usize,
        concat!("Size of: ", stringify!(iv_filetype_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iv_filetype_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iv_filetype_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extension) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_filetype_s),
            "::",
            stringify!(extension)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_filetype_s),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_filetype_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).program) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_filetype_s),
            "::",
            stringify!(program)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).icon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_filetype_s),
            "::",
            stringify!(icon)
        )
    );
}
pub type iv_filetype = iv_filetype_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_wlist_s {
    pub word: *mut ::std::os::raw::c_char,
    pub x1: ::std::os::raw::c_short,
    pub y1: ::std::os::raw::c_short,
    pub x2: ::std::os::raw::c_short,
    pub y2: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_iv_wlist_s() {
    const UNINIT: ::std::mem::MaybeUninit<iv_wlist_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iv_wlist_s>(),
        12usize,
        concat!("Size of: ", stringify!(iv_wlist_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iv_wlist_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iv_wlist_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).word) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_wlist_s),
            "::",
            stringify!(word)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x1) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_wlist_s),
            "::",
            stringify!(x1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y1) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_wlist_s),
            "::",
            stringify!(y1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_wlist_s),
            "::",
            stringify!(x2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y2) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_wlist_s),
            "::",
            stringify!(y2)
        )
    );
}
pub type iv_wlist = iv_wlist_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_sessioninfo_s {
    pub url: *mut ::std::os::raw::c_char,
    pub ctype: *mut ::std::os::raw::c_char,
    pub response: ::std::os::raw::c_long,
    pub length: ::std::os::raw::c_int,
    pub progress: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_iv_sessioninfo_s() {
    const UNINIT: ::std::mem::MaybeUninit<iv_sessioninfo_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iv_sessioninfo_s>(),
        20usize,
        concat!("Size of: ", stringify!(iv_sessioninfo_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iv_sessioninfo_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iv_sessioninfo_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).url) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_sessioninfo_s),
            "::",
            stringify!(url)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctype) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_sessioninfo_s),
            "::",
            stringify!(ctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).response) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_sessioninfo_s),
            "::",
            stringify!(response)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_sessioninfo_s),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).progress) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_sessioninfo_s),
            "::",
            stringify!(progress)
        )
    );
}
pub type iv_sessioninfo = iv_sessioninfo_s;
#[repr(C)]
#[derive(Debug)]
pub struct iv_fbinfo_s {
    pub version: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_uint,
    pub shmkey: ::std::os::raw::c_int,
    pub shmsize: ::std::os::raw::c_int,
    pub refkey: ::std::os::raw::c_int,
    pub refsize: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub vdepth: ::std::os::raw::c_int,
    pub orientation: ::std::os::raw::c_int,
    pub scanline_portrait: ::std::os::raw::c_int,
    pub scanline_landscape: ::std::os::raw::c_int,
    pub scanline: ::std::os::raw::c_int,
    pub fb_offset: ::std::os::raw::c_int,
    pub fb_size: ::std::os::raw::c_int,
    pub ev_offset: ::std::os::raw::c_int,
    pub ev_size: ::std::os::raw::c_int,
    pub evhead: ::std::os::raw::c_int,
    pub evtail: ::std::os::raw::c_int,
    pub einkversion: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 15usize],
    pub data: __IncompleteArrayField<::std::os::raw::c_uchar>,
    pub fb_y_offset: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_iv_fbinfo_s() {
    const UNINIT: ::std::mem::MaybeUninit<iv_fbinfo_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iv_fbinfo_s>(),
        144usize,
        concat!("Size of: ", stringify!(iv_fbinfo_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iv_fbinfo_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iv_fbinfo_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shmkey) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(shmkey)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shmsize) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(shmsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refkey) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(refkey)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refsize) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(refsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vdepth) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(vdepth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).orientation) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(orientation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scanline_portrait) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(scanline_portrait)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scanline_landscape) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(scanline_landscape)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scanline) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(scanline)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fb_offset) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(fb_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fb_size) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(fb_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ev_offset) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(ev_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ev_size) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(ev_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).evhead) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(evhead)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).evtail) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(evtail)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).einkversion) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(einkversion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fb_y_offset) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_fbinfo_s),
            "::",
            stringify!(fb_y_offset)
        )
    );
}
pub type iv_fbinfo = iv_fbinfo_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct subtaskinfo_s {
    pub id: ::std::os::raw::c_int,
    pub name: *mut ::std::os::raw::c_char,
    pub book: *mut ::std::os::raw::c_char,
    pub fgindex: ::std::os::raw::c_int,
    pub order: ::std::os::raw::c_int,
    pub rsv_1s: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_subtaskinfo_s() {
    const UNINIT: ::std::mem::MaybeUninit<subtaskinfo_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<subtaskinfo_s>(),
        24usize,
        concat!("Size of: ", stringify!(subtaskinfo_s))
    );
    assert_eq!(
        ::std::mem::align_of::<subtaskinfo_s>(),
        4usize,
        concat!("Alignment of ", stringify!(subtaskinfo_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(subtaskinfo_s),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(subtaskinfo_s),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).book) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(subtaskinfo_s),
            "::",
            stringify!(book)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fgindex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(subtaskinfo_s),
            "::",
            stringify!(fgindex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(subtaskinfo_s),
            "::",
            stringify!(order)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv_1s) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(subtaskinfo_s),
            "::",
            stringify!(rsv_1s)
        )
    );
}
pub type subtaskinfo = subtaskinfo_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct taskinfo_s {
    pub task: ::std::os::raw::c_int,
    pub nsubtasks: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_uint,
    pub fbshmkey: ::std::os::raw::c_int,
    pub fbshmsize: ::std::os::raw::c_int,
    pub mainpid: pid_t,
    pub appname: *mut ::std::os::raw::c_char,
    pub icon: *mut ibitmap,
    pub subtasks: *mut subtaskinfo,
    pub fbtempkey: ::std::os::raw::c_int,
    pub rsv_2: ::std::os::raw::c_int,
    pub rsv_3: ::std::os::raw::c_int,
    pub rsv_4: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_taskinfo_s() {
    const UNINIT: ::std::mem::MaybeUninit<taskinfo_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<taskinfo_s>(),
        52usize,
        concat!("Size of: ", stringify!(taskinfo_s))
    );
    assert_eq!(
        ::std::mem::align_of::<taskinfo_s>(),
        4usize,
        concat!("Alignment of ", stringify!(taskinfo_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).task) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(task)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nsubtasks) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(nsubtasks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fbshmkey) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(fbshmkey)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fbshmsize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(fbshmsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mainpid) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(mainpid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).appname) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(appname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).icon) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(icon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subtasks) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(subtasks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fbtempkey) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(fbtempkey)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv_2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(rsv_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv_3) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(rsv_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsv_4) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(taskinfo_s),
            "::",
            stringify!(rsv_4)
        )
    );
}
pub type taskinfo = taskinfo_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iv_mtinfo_s {
    pub active: bool,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub pressure: ::std::os::raw::c_int,
    pub devtype: input_dev_e,
    pub timems: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_iv_mtinfo_s() {
    const UNINIT: ::std::mem::MaybeUninit<iv_mtinfo_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iv_mtinfo_s>(),
        32usize,
        concat!("Size of: ", stringify!(iv_mtinfo_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iv_mtinfo_s>(),
        8usize,
        concat!("Alignment of ", stringify!(iv_mtinfo_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).active) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_mtinfo_s),
            "::",
            stringify!(active)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_mtinfo_s),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_mtinfo_s),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pressure) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_mtinfo_s),
            "::",
            stringify!(pressure)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).devtype) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_mtinfo_s),
            "::",
            stringify!(devtype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timems) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(iv_mtinfo_s),
            "::",
            stringify!(timems)
        )
    );
}
pub type iv_mtinfo = iv_mtinfo_s;
pub type iv_mtinfo_section = [iv_mtinfo; 2usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct apinfo_s {
    pub ssid: [::std::os::raw::c_char; 64usize],
    pub mode: ::std::os::raw::c_int,
    pub channel: ::std::os::raw::c_int,
    pub security: WIFI_SECURITY,
    pub quality: ::std::os::raw::c_int,
    pub level: ::std::os::raw::c_int,
    pub noise: ::std::os::raw::c_int,
    pub mac: [::std::os::raw::c_uchar; 8usize],
    pub timestamp: time_t,
}
#[test]
fn bindgen_test_layout_apinfo_s() {
    const UNINIT: ::std::mem::MaybeUninit<apinfo_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<apinfo_s>(),
        100usize,
        concat!("Size of: ", stringify!(apinfo_s))
    );
    assert_eq!(
        ::std::mem::align_of::<apinfo_s>(),
        4usize,
        concat!("Alignment of ", stringify!(apinfo_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ssid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(apinfo_s),
            "::",
            stringify!(ssid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(apinfo_s),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(apinfo_s),
            "::",
            stringify!(channel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).security) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(apinfo_s),
            "::",
            stringify!(security)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quality) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(apinfo_s),
            "::",
            stringify!(quality)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(apinfo_s),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).noise) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(apinfo_s),
            "::",
            stringify!(noise)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(apinfo_s),
            "::",
            stringify!(mac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(apinfo_s),
            "::",
            stringify!(timestamp)
        )
    );
}
pub type wifiapinfo = apinfo_s;
#[repr(C)]
#[derive(Debug)]
pub struct wifi_ap_list_s {
    pub ap_quantity: ::std::os::raw::c_int,
    pub apinfo: __IncompleteArrayField<wifiapinfo>,
}
#[test]
fn bindgen_test_layout_wifi_ap_list_s() {
    const UNINIT: ::std::mem::MaybeUninit<wifi_ap_list_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wifi_ap_list_s>(),
        4usize,
        concat!("Size of: ", stringify!(wifi_ap_list_s))
    );
    assert_eq!(
        ::std::mem::align_of::<wifi_ap_list_s>(),
        4usize,
        concat!("Alignment of ", stringify!(wifi_ap_list_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ap_quantity) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wifi_ap_list_s),
            "::",
            stringify!(ap_quantity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).apinfo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(wifi_ap_list_s),
            "::",
            stringify!(apinfo)
        )
    );
}
pub type iv_wifi_ap_list = wifi_ap_list_s;
pub type pointer_to_word_hand_t = ::std::option::Option<
    unsafe extern "C" fn(
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        forward: ::std::os::raw::c_int,
    ) -> *mut iv_wlist,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub union network_interface {
    pub intr: [::std::os::raw::c_char; 8usize],
    pub addr: [::std::os::raw::c_char; 16usize],
    pub hw_addr: [::std::os::raw::c_char; 18usize],
}
#[test]
fn bindgen_test_layout_network_interface() {
    const UNINIT: ::std::mem::MaybeUninit<network_interface> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<network_interface>(),
        18usize,
        concat!("Size of: ", stringify!(network_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<network_interface>(),
        1usize,
        concat!("Alignment of ", stringify!(network_interface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(network_interface),
            "::",
            stringify!(intr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(network_interface),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hw_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(network_interface),
            "::",
            stringify!(hw_addr)
        )
    );
}
#[repr(C)]
pub struct network_interface_array_s {
    pub count: ::std::os::raw::c_uint,
    pub net_int: __IncompleteArrayField<network_interface>,
}
#[test]
fn bindgen_test_layout_network_interface_array_s() {
    const UNINIT: ::std::mem::MaybeUninit<network_interface_array_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<network_interface_array_s>(),
        4usize,
        concat!("Size of: ", stringify!(network_interface_array_s))
    );
    assert_eq!(
        ::std::mem::align_of::<network_interface_array_s>(),
        4usize,
        concat!("Alignment of ", stringify!(network_interface_array_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(network_interface_array_s),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).net_int) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(network_interface_array_s),
            "::",
            stringify!(net_int)
        )
    );
}
pub type network_interface_array = network_interface_array_s;
pub const bt_state_e_BT_STATE_OFF: bt_state_e = 0;
pub const bt_state_e_BT_STATE_SUSPENDED: bt_state_e = 1;
pub const bt_state_e_BT_STATE_READY: bt_state_e = 2;
pub const bt_state_e_BT_STATE_CONNECTED: bt_state_e = 3;
pub const bt_state_e_BT_STATE_TRANSFERRING: bt_state_e = 4;
pub const bt_state_e_BT_STATE_ERROR: bt_state_e = 5;
pub const bt_state_e_BT_STATE_MAX: bt_state_e = 6;
pub type bt_state_e = ::std::os::raw::c_uint;
pub use self::bt_state_e as bt_state;
pub const audio_output_e_AUDIO_OUT_NONE: audio_output_e = 0;
pub const audio_output_e_AUDIO_OUT_HP: audio_output_e = 1;
pub const audio_output_e_AUDIO_OUT_BT: audio_output_e = 2;
pub type audio_output_e = ::std::os::raw::c_uint;
pub use self::audio_output_e as audio_output_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct audio_output_info {
    pub type_: audio_output_t,
    pub description: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_audio_output_info() {
    const UNINIT: ::std::mem::MaybeUninit<audio_output_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<audio_output_info>(),
        36usize,
        concat!("Size of: ", stringify!(audio_output_info))
    );
    assert_eq!(
        ::std::mem::align_of::<audio_output_info>(),
        4usize,
        concat!("Alignment of ", stringify!(audio_output_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(audio_output_info),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(audio_output_info),
            "::",
            stringify!(description)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct network_interface_info {
    pub ip_addr: network_interface,
    pub mask: network_interface,
    pub br_addr: network_interface,
    pub hw_addr: network_interface,
}
#[test]
fn bindgen_test_layout_network_interface_info() {
    const UNINIT: ::std::mem::MaybeUninit<network_interface_info> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<network_interface_info>(),
        72usize,
        concat!("Size of: ", stringify!(network_interface_info))
    );
    assert_eq!(
        ::std::mem::align_of::<network_interface_info>(),
        1usize,
        concat!("Alignment of ", stringify!(network_interface_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(network_interface_info),
            "::",
            stringify!(ip_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mask) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(network_interface_info),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).br_addr) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(network_interface_info),
            "::",
            stringify!(br_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hw_addr) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(network_interface_info),
            "::",
            stringify!(hw_addr)
        )
    );
}
#[doc = "< application is a reader, affects behavior of panel\n for proper work, set this attribute before first acces to panel API"]
pub const APPLICATION_ATTRIBUTE_APPLICATION_READER: APPLICATION_ATTRIBUTE = 0;
#[doc = "< maximal value of the attribute"]
pub const APPLICATION_ATTRIBUTE_APPLICATION_ATTRIBUTE_MAX: APPLICATION_ATTRIBUTE = 31;
#[doc = " Enum APPLICATION_ATTRIBUTE wich can be used for setting current application attributes\n @see SetCurrentApplicationAttribute, TestCurrentApplicationAttribute"]
pub type APPLICATION_ATTRIBUTE = ::std::os::raw::c_uint;
pub const PixelFormat_e_kFmtGrayscale8: PixelFormat_e = 0;
pub const PixelFormat_e_kFmtRGB24: PixelFormat_e = 1;
pub type PixelFormat_e = ::std::os::raw::c_uint;
pub use self::PixelFormat_e as PixelFormat;
pub const ImageSignatureType_e_kImgTypeUnknown: ImageSignatureType_e = 0;
pub const ImageSignatureType_e_kImgTypeBMP: ImageSignatureType_e = 1;
pub const ImageSignatureType_e_kImgTypeGIF: ImageSignatureType_e = 2;
pub const ImageSignatureType_e_kImgTypeJPG: ImageSignatureType_e = 3;
pub const ImageSignatureType_e_kImgTypePNG: ImageSignatureType_e = 4;
pub const ImageSignatureType_e_kImgTypeTIFF: ImageSignatureType_e = 5;
pub type ImageSignatureType_e = ::std::os::raw::c_uint;
pub use self::ImageSignatureType_e as ImageSignatureType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iprofile_s {
    pub name: *mut ::std::os::raw::c_char,
    pub path: *mut ::std::os::raw::c_char,
    pub type_: ::std::os::raw::c_int,
    pub avatar: *mut ibitmap,
}
#[test]
fn bindgen_test_layout_iprofile_s() {
    const UNINIT: ::std::mem::MaybeUninit<iprofile_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iprofile_s>(),
        16usize,
        concat!("Size of: ", stringify!(iprofile_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iprofile_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iprofile_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iprofile_s),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iprofile_s),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iprofile_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).avatar) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(iprofile_s),
            "::",
            stringify!(avatar)
        )
    );
}
pub type iprofile = iprofile_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iprofiles_s {
    pub profile: *mut iprofile,
    pub count: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_iprofiles_s() {
    const UNINIT: ::std::mem::MaybeUninit<iprofiles_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iprofiles_s>(),
        8usize,
        concat!("Size of: ", stringify!(iprofiles_s))
    );
    assert_eq!(
        ::std::mem::align_of::<iprofiles_s>(),
        4usize,
        concat!("Alignment of ", stringify!(iprofiles_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).profile) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iprofiles_s),
            "::",
            stringify!(profile)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iprofiles_s),
            "::",
            stringify!(count)
        )
    );
}
pub type iprofiles = iprofiles_s;
pub const MencaFileStatus_e_kMencaNoStatus: MencaFileStatus_e = 0;
pub const MencaFileStatus_e_kMencaInCloud: MencaFileStatus_e = 1;
pub const MencaFileStatus_e_kMencaSyncing: MencaFileStatus_e = 2;
pub const MencaFileStatus_e_kMencaDownloaded: MencaFileStatus_e = 3;
pub type MencaFileStatus_e = ::std::os::raw::c_uint;
pub use self::MencaFileStatus_e as MencaFileStatus;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BookSyncStatus_s {
    pub menca_status_: MencaFileStatus,
}
#[test]
fn bindgen_test_layout_BookSyncStatus_s() {
    const UNINIT: ::std::mem::MaybeUninit<BookSyncStatus_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BookSyncStatus_s>(),
        4usize,
        concat!("Size of: ", stringify!(BookSyncStatus_s))
    );
    assert_eq!(
        ::std::mem::align_of::<BookSyncStatus_s>(),
        4usize,
        concat!("Alignment of ", stringify!(BookSyncStatus_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).menca_status_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BookSyncStatus_s),
            "::",
            stringify!(menca_status_)
        )
    );
}
pub type BookSyncStatus = BookSyncStatus_s;
pub const AudioPlayerType_e_kAudioPlayer: AudioPlayerType_e = 1;
pub const AudioPlayerType_e_kAudioBooks: AudioPlayerType_e = 2;
pub const AudioPlayerType_e_kBrowser: AudioPlayerType_e = 4;
pub const AudioPlayerType_e_kReaderPlayer: AudioPlayerType_e = 8;
pub type AudioPlayerType_e = ::std::os::raw::c_uint;
pub use self::AudioPlayerType_e as AudioPlayerType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AudioPlayingInfo_s {
    pub type_: AudioPlayerType,
    pub pid: ::std::os::raw::c_int,
    pub title: [::std::os::raw::c_char; 512usize],
    pub author: [::std::os::raw::c_char; 512usize],
    pub duration: [::std::os::raw::c_char; 32usize],
    pub percent: ::std::os::raw::c_int,
    pub play_state: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_AudioPlayingInfo_s() {
    const UNINIT: ::std::mem::MaybeUninit<AudioPlayingInfo_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<AudioPlayingInfo_s>(),
        1072usize,
        concat!("Size of: ", stringify!(AudioPlayingInfo_s))
    );
    assert_eq!(
        ::std::mem::align_of::<AudioPlayingInfo_s>(),
        4usize,
        concat!("Alignment of ", stringify!(AudioPlayingInfo_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioPlayingInfo_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioPlayingInfo_s),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).title) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioPlayingInfo_s),
            "::",
            stringify!(title)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).author) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioPlayingInfo_s),
            "::",
            stringify!(author)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).duration) as usize - ptr as usize },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioPlayingInfo_s),
            "::",
            stringify!(duration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).percent) as usize - ptr as usize },
        1064usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioPlayingInfo_s),
            "::",
            stringify!(percent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).play_state) as usize - ptr as usize },
        1068usize,
        concat!(
            "Offset of field: ",
            stringify!(AudioPlayingInfo_s),
            "::",
            stringify!(play_state)
        )
    );
}
pub type AudioPlayingInfo = AudioPlayingInfo_s;
pub type proxy_settings = ::std::os::raw::c_char;
pub const eTaskOomPriority_kTaskOomPriorityLow: eTaskOomPriority = 0;
pub const eTaskOomPriority_kTaskOomPriorityNormal: eTaskOomPriority = 1;
pub const eTaskOomPriority_kTaskOomPriorityHigh: eTaskOomPriority = 2;
pub type eTaskOomPriority = ::std::os::raw::c_uint;
pub use self::eTaskOomPriority as TaskOomPriority;
pub const CustomGattSessionStatus_e_GattSessionStatus_uncknown: CustomGattSessionStatus_e = 0;
pub const CustomGattSessionStatus_e_GattSessionStatus_disconnected: CustomGattSessionStatus_e = 1;
pub const CustomGattSessionStatus_e_GattSessionStatus_errorCommon: CustomGattSessionStatus_e = 2;
pub const CustomGattSessionStatus_e_GattSessionStatus_errorConnection: CustomGattSessionStatus_e =
    3;
